{"data":{"wordpressTag":{"id":"b39c3932-5665-5b1c-b295-757fb0ac37d9","name":"بازارکار برنامه نویسی","description":""},"allWordpressPost":{"edges":[{"node":{"id":"fab3bbc3-ed46-505e-a22a-35402bfdfc58","title":"چطوری برنامه نویسی یاد بگیرم؟","excerpt":"<p>یادگیری هر کسی با کسی دیگه متفاوته. من نمیتونم روش کلی بگم. اجازه بدید داستان خودمو براتون تعریف کنم:. تقریباً 15 سالم بود که داشتم به برنامه نویسی علاقه&zwnj;مند میشدم و با html و css شروع کردم. اونموقع ها نهایت کاری که میکردم این بود یه وردپرس بزنم و افزونه و قالب نصب کنم و &hellip; <a href=\"https://backend.hesamkaveh.com/%da%86%d8%b7%d9%88%d8%b1%db%8c-%d8%a8%d8%b1%d9%86%d8%a7%d9%85%d9%87-%d9%86%d9%88%db%8c%d8%b3%db%8c-%db%8c%d8%a7%d8%af-%d8%a8%da%af%db%8c%d8%b1%d9%85%d8%9f/\" class=\"more-link\">ادامه خواندن <span class=\"screen-reader-text\">چطوری برنامه نویسی یاد بگیرم؟</span></a></p>\n","content":"<p style=\"text-align: right;\">\n\tیادگیری هر کسی با کسی دیگه متفاوته. من نمیتونم روش کلی بگم. اجازه بدید داستان خودمو براتون تعریف کنم:.\n</p>\n<p style=\"text-align: right;\">\n\tتقریباً 15 سالم بود که داشتم به برنامه نویسی علاقه&zwnj;مند میشدم و با html و css شروع کردم. اونموقع ها نهایت کاری که میکردم این بود یه وردپرس بزنم و افزونه و قالب نصب کنم و ادیتشون کنم. و خب درواقع پروژه خاص و حرفه&zwnj;ای ای انجام نمی&zwnj;دادم. همین باعث شد که تقریباً طی 4 سال چندین بار html و css بخونم و درنهایت بازم هیچی بلد نباشم چون تقریبا تمرین عملی نداشتم. اومدم دانشگاه و تو جو رقابتی با چند تا از بچه&zwnj;ها قرار گرفتیم و باعث شد اعتماد به نفس اینو پیدا کنم که پروژه واقعی انجام بدم، درصورتی که بازم دانش زیادی نداشتم. برای دست گرمی یه عکس از یک وبسایت گیراوردم و شروع کردم به کد زنیش. بیشتر کد هایی که پیاده کردم با آزمون و خطا بود یا با سرچ! درواقع 4 سال و چند باری که html خوندنم اونقدری کمک نکرده بود!! اونجا بود که متوجه شدم <strong>اینکه چقدر برای انجام یک کار دورخیز میکنیم مهم نیست، مهم اینه&nbsp;که واقا میخوایم اون کار رو انجام بدیم و شروعش می&zwnj;کنیم یا نه!</strong>\n</p>\n<p><!--more--></p>\n<p>\n\tبعد از اون قضیه دیگه آموزش من پروژه محور شد. یکم چشم و گوشتونو باز کنین کلی پروژه به چشمتون میخوره که یا بقیه بهتون پیشنهاد کردن یا خودتون باید پیشنهاد بدید و بگیریدش. من پروژه هایی رو انتخاب می&zwnj;کردم که با کمی تحقیق در موردشون این حسو داشتم که میتونم انجامشون بدم(حتی اگه در اون لحظه دانششو نداشتم. این روش یسری حسن داره:\n</p>\n<ul style=\"text-align: right;\">\n<li>\n\t\tاولاً اینکه درگیر کار می&zwnj;شید و میبینید چیو باید یاد بگیرید و چیزای اضافیو یاد نمیگیرید(بعدها نیاز پیدا کنید یاد میگیرید). مهم اینه که شما راه میوفتید\n\t</li>\n<li>\n\t\tعقلانیه که پروژه هایی که قبول کردید انتظار زیادی ازتون ندارن و لزومی نداره کار خیلی حرفه&zwnj;ای تحویل بدید(البته نه به این معنا که تلاش نکنین)\n\t</li>\n<li>\n\t\tدر قبال یادگیریتون پول هم دریافت میکنید. شاید مقدار زیادی نباشه ولی شیرین&zwnj;ترینه\n\t</li>\n</ul>\n<p style=\"text-align: right;\">\n\tهنوزم که هنوزه دارم از این روش جواب میگیرم. همین وبلاگی که می&zwnj;بینید بهونه ای شد که reactjs یاد بگیرم درحالی که میتونستم خیلی راحت با وردپرس بزنم. اما دنبال یه پروژه ای بودم که باهاش ریکت یاد بگیرم و البته مدت ها بود میخواستم وبلاگ بزنم.&nbsp;البته اینجور پروژه ها معمولاً مشکلات و چالش هایی دارن که به مرور زمان حل میشن.\n</p>\n<p style=\"text-align: right;\">\n\tآها یه نکته رو یادم رفت بگم&hellip; اگه میخواید لایببری جدید یاد بگیرید از example ها کمک بگیرید. معمولاً لایبرری ها یسری example دارن که یه پروژه ساده باهاشون پیاده&zwnj;سازی شده. من مستقیم میرم سر تست اونا و سعی میکنم ادیتش کنم به چیزی که میخوام. هرجا هم مشکل بخورم از داکیومنتش کمک میگیرم یا سرچ میکنم.\n</p>\n<p style=\"text-align: right;\">\n\tروش دیگه ای هم هست اینکه اول مطالعه کنید و با دورخیز مناسبی وارد پروژه شید. درواقع بعضیا آکادمیک کار می&zwnj;کنن بعد عملی. شاید این بهترین روش باشه اما نه برای شروع! شما در اول راه برای شروع کار و پروژه نیاز به انگیزه دارید و چه انگیزه&zwnj;ای بهتر از تجربه انجامش؟!\n</p>\n<h3 style=\"text-align: right;\">\n\tچه زبان برنامه نویسی بهتره؟<br />\n</h3>\n<p style=\"text-align: right;\">\n\tواقعیتش اینه که هر زبانی هدفی داره. ولی اگه هنوز زبانی رو انتخاب نکرده&zwnj;اید نگران نباشید. بجا اینکه وسواس به خرج بدید و هی تحقیق کنید که اسمشو میذارم دورخیز برای یه شروع قوی(که معمولا اتفاق نمیوفته)، خودتونو درگیر یک زبان کنید و به مرور زمان زبان مورد علاقتونو پیدا میکنید. یک زبان قدیمی و با داکیومنت بالا بهترین انتخاب میتونه باشه. مثل پایتون یا c#. البته اگه پیشنهاد منو بخواید چیزی نیست جز پایتون.\n</p>\n<p style=\"text-align: right;\">\n\tیه توصیه:<strong> تو دنیای نرم&zwnj;افزار، با همون تکنولوژی که راه دستته و کارت رو راه می اندازه شروع کن، هر وقت به نقطه&zwnj;ای رسیدی که کارت دیگه راه نیافتاد خودت می&zwnj;فهمی وقت تغییره و باید سراغ چی بری.</strong>\n</p>\n<h3 style=\"text-align: right;\">\n\t&nbsp;<br />\n</h3>\n<h3 style=\"text-align: right;\">\n\tبرنامه نویسی دسکتاپ، وب و یا موبایل؟<br />\n</h3>\n<p style=\"text-align: right;\">\n\tشاید امروزه برنامه نویسی موبایل خیلی رو بورس باشه و نقش وب کمرنگ تر بنظر بیاد. اما اکثر برنامه&zwnj;های موبایل به وب وابسته اند. برنامه نویسی دسکتاپ هم دچار تحول بوده و دیگه کمتر اپ دسکتاپ می&zwnj;بینیم اما حوزه های جدیدی در برنامه نویسی بوجود آمده مثل ماشین لرنینگ یا داده کاوی. شاید در ابتدای کار مجبور شید چند پلتفرم یا حوزه های مختلف امتحان کنید تا متوجه شید به چی علاقه دارید.\n</p>\n<h3 style=\"text-align: right;\">\n\tاز چه منبعی یاد بگیرم؟<br />\n</h3>\n<p style=\"text-align: right;\">\n\tبرای یادگیری از هر منبعی میتونید استفاده کنید. بعضی منبع ها از بعضی دیگه بهترن ولی <strong>بهترین منبع اونیه که شما باهاش ارتباط برقرار می&zwnj;کنید.</strong> بطور مثال جادی در یک دوره ای به اسم بستون، یه چیز هایی در مورد django گفت در حالی که هدفش آموزش جانگو نبود و شاید مطالب جانگویی که گفت زیاد حرفه&zwnj;ای نبود. ولی همون کافی بود تا منو با جانگو آشنا کنه و بقیه چیز هاشو به مرور زمان و طی پروژه های مختلف یاد گرفتم(البته دنیای برنامه نویسی یه چیز نامحدودیه و هیچ&zwnj;وقت یادگیری متوقف نمیشه). درواقع اون آموزش برای من مفید بود بخاطر اینکه یه حداعقلاتی به من یاد داد و اعتماد به نفس و انگیزه منو برای یادگیری بیشتر کرد.\n</p>\n<h3 style=\"text-align: right;\">\n\tبرنامه نویسی کار کردم ولی یادم میره. چه کنم؟<br />\n</h3>\n<p style=\"text-align: right;\">\n\tتمرین تمرین تمرین. برنامه نویسی دقیقاً یک ورزش ذهنیه و همونطوری که ورزشکار نیاز به تمرین داره تا رو فرم بمونه، برنامه نویس هم باید از ذهنش استفاده کنه و اینطوری خودشو آماده نگه داره(چه برای یادگیری چیز جدید، چه برای استفاده از دانش قبلی)\n</p>\n<p style=\"text-align: right;\">\n\tاگرم برای کار های تکراری مجدداً سرچ می&zwnj;کنید یا از کد پروژه های قبلیتون کمک میگیرید، نگران نباشید. شما مثل حرفه&zwnj;ای ترین برنامه نویس ها عمل می&zwnj;کنید:)\n</p>\n<h3 style=\"text-align: right;\">\n\tبازارکار برای برنامه نویسی چطوره؟<br />\n</h3>\n<p style=\"text-align: right;\">\n\tنمیخوام در مورد بازار در این پست حرف بزنم چون بحث&zwnj;های زیادی داره. بطور کلی شما هرچی رو واقا دوست داشته باشید و مهارت داشته باشید میتونید ازش پول بدست بیارید. چه برسه به برنامه نویسی که الان خیلی هم رو بورسه.\n</p>\n<p style=\"text-align: right;\">\n\t<strong>چند نکته:</strong>\n</p>\n<ul>\n<li style=\"text-align: right;\">\n\t\tالزاماً هرکی که دانش آکادمیک داره، نمیتونه عملی پیادش کنه. بخاطر همینه که معمولا استاد دانشگاه&zwnj;ها حتی اگه مبحثی رو تسلط دارن نمیتونن در عمل پیاده سازیش کنند.\n\t</li>\n<li style=\"text-align: right;\">\n\t\tاگه میخواید در عمل خوب باشید، تمرین کنید. مطالعه کافی نیست.\n\t</li>\n<li style=\"text-align: right;\">\n\t\tاز گرفتن پروژه نترسید.\n\t</li>\n<li style=\"text-align: right;\">\n\t\tپروژه ای که با علایقتون همسو نیست نگیرید، حتی اگه پول توش باشه. اولاً زمانتون برای لذت از زندگی محدوده و باید با چیزایی که خوشحالتون میکنه وقت بگذرونید. دوماً همون وقتو میتونید بذارید و چیزایی یاد بگیرید که روی آیندتون تأثیر داره.\n\t</li>\n<li>\n<p style=\"text-align: right;\">\n\t\t\tو از همه مهمتر، سخت نگیرید. برید دنبال علاقتون و خودتونو درگیرش کنید.\n\t\t</p>\n</li>\n</ul>\n","slug":"%da%86%d8%b7%d9%88%d8%b1%db%8c-%d8%a8%d8%b1%d9%86%d8%a7%d9%85%d9%87-%d9%86%d9%88%db%8c%d8%b3%db%8c-%db%8c%d8%a7%d8%af-%d8%a8%da%af%db%8c%d8%b1%d9%85%d8%9f","tags":[{"name":"آموزش برنامه نویسی"},{"name":"بازارکار برنامه نویسی"},{"name":"چطوری برنامه نویسی یاد بگیرم"},{"name":"چه زبان برنامه نویسی بهتره"},{"name":"منبع آموزش برنامه نویسی"},{"name":"نکات برنامه نویسی"}],"featured_media":{"alt_text":"","localFile":{"childImageSharp":{"fluid":{"base64":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAJCAIAAAC9o5sfAAAACXBIWXMAAAsSAAALEgHS3X78AAAB8UlEQVQozzWRe0/TYBTG+YB+AYxoAkqMf0wwIiYEnZauyzYY7Ea7W7u+fXvZDXACMkbZXBhOtrdvadBoNDHTsXaX4EewnSN5/jg5Ob+c5zlnCmqmI2yKel/EfVEfSMYQahbQLEEzJ0KmiC1ojCC2JN2aIJo5NalQN3P+Q/j8K1n9Gj1sSqj7Tu/I7a6CB1ls5ow+f/GbP2zyzU7yrAPRLSyga+XqZqNw7I/z/MHZJiu+XH0TTbBGq8VCsLpOksHwa4LK5guCUgLlg/0PL5hKW7y03fUcOHt145Ura6/IVJxT91K5Qs618Gzh0WyAXllJuZ96ffMP7otbQbqoJkolObfINb7b6RwYop50OaLLzUg6knhfTeSPFMrzeG5uZuZOIOnazjHLJHV3enpp9h7zfD6UkpbXWa7x0z7Q/8zXAP+FJ6Uv+KE/JdBlzAi7bveaa3EpBvxcNkp5KYIgKJLw+96G2YwsK6yKHdvI3qz1oD7kP33boN1p1YikFbGwG6AJH++t1M5raq3eNo4+NiISeBIjPVys3qhxp9hGxrBjexg/0d2hSLRYZRhB3ldj28EwSIcLZVraCe9Ut/bqoeLpppD3JqGHzjDHmnS72Tm6gHoQD/hWN4Mt9uIPr40AGthNgEzQ7oLWWMj+uSUgyxkeU/8AakZ1DzRee6YAAAAASUVORK5CYII=","aspectRatio":2.1818181818181817,"src":"/static/667f338fa3fabcc9cfff3b3131d6b3e2/5a67f/programming.png","srcSet":"/static/667f338fa3fabcc9cfff3b3131d6b3e2/b1628/programming.png 188w,\n/static/667f338fa3fabcc9cfff3b3131d6b3e2/ae0e1/programming.png 375w,\n/static/667f338fa3fabcc9cfff3b3131d6b3e2/5a67f/programming.png 750w,\n/static/667f338fa3fabcc9cfff3b3131d6b3e2/bc549/programming.png 960w","sizes":"(max-width: 750px) 100vw, 750px"}}},"media_details":{"width":960,"height":440,"file":"2018/09/programming.png"}}}}]},"site":{"siteMetadata":{"title":"حسام‌ کاوه","subtitle":"با تلاش من و شما جهان بهتر خواهد شد. نوشته هایی در مورد پیشرفت شخصی، کسب و کار و برنامه نویسی"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"b39c3932-5665-5b1c-b295-757fb0ac37d9"}}