{"data":{"wordpressTag":{"id":"03764521-87a9-51e8-9e4f-2c81e01f7f4a","name":"خوبی و بدی های دانشگاه","description":""},"allWordpressPost":{"edges":[{"node":{"id":"1cd6acd7-1a53-517e-94a1-422da184b4c6","title":"چرا دانشگاه روی دانشجو تاثیرات بد میگذارد؟","excerpt":"<p>دانشجوی ترم ۷ ام. دانشجو&#8230;. دانشجو بودن خوبی هایی داره. مثلا وقتی با تاکسی میام اراک میگم دانشجو ام تا طرف دلش بسوزه و تخفیف بده. یا وقتی پسری میره خواستگاری دختر مورد علاقش و میپرسن چی دست و بالته؟ میگه دانشجو ام، چیزی ندارم. دانشجو یعنی بدبخت، یعنی بیچاره ای که وبال گردن خانوادشه. &hellip; <a href=\"https://backend.hesamkaveh.com/%da%86%d8%b1%d8%a7-%d8%af%d8%a7%d9%86%d8%b4%da%af%d8%a7%d9%87-%d8%b1%d9%88%db%8c-%d8%af%d8%a7%d9%86%d8%b4%d8%ac%d9%88-%d8%aa%d8%a7%d8%ab%db%8c%d8%b1%d8%a7%d8%aa-%d8%a8%d8%af-%d9%85%db%8c%da%af%d8%b0/\" class=\"more-link\">ادامه خواندن <span class=\"screen-reader-text\">چرا دانشگاه روی دانشجو تاثیرات بد میگذارد؟</span></a></p>\n","content":"\n<p>دانشجوی ترم ۷ ام. دانشجو&#8230;. دانشجو بودن خوبی هایی داره. مثلا وقتی با تاکسی میام اراک میگم دانشجو ام تا طرف دلش بسوزه و تخفیف بده. یا وقتی پسری میره خواستگاری دختر مورد علاقش و میپرسن چی دست و بالته؟ میگه دانشجو ام، چیزی ندارم. دانشجو یعنی بدبخت، یعنی بیچاره ای که وبال گردن خانوادشه. یعنی بهترین بهونه برای چیزی نداشتن! اصلا واژه و شغل دانشجو چیزیه که دولت ها به افراد چسبوندن تا سرکوبشون کنند. دولت ها دوست ندارند افراد جامعه مسیر های متفاوتی داشته باشن. اینکه افراد یک مسیر ثابتی رو برن برای دولت ها خیلی خوشاینده چون میتونه راحتتر روشون کنترل و نظارت داشته باشه. ضمن اینکه تو این مسیر سرکوب بخورن واسش خیلی بهتره چون خودش اون بالا و رأس قدرت میمونه و بقیه رو بازیچه خودش میکنه. اینکه دانشجو فکر کنه فرد مهمیه میتونه خیلی به ضرر دولت ها باشه. اصلا پستم سیاسی نیست، اما این سرکوب خوردن واقعیتیه که روی ناخودآگاهمون تاثیر زیادی داره. البته فقط دانشگاه نیست که به محصل بی احترامی میشه، سیستم آموزشی از ریشه خرابه، چقدر کتک خوردیم تا به اینجا برسیم؟ من معلمی داشتم که لای انگشتامون خودکار میگذاشت که چرا نمره بدی گرفتی. بیشترین دغدغمون یک‌زمان این بود که از زیر شلنگ معلم جون سالم به در ببریم.</p>\n\n\n\n<p>دانشگاه اندازه  یکی دو ترم خوبه. اون ترم های اول جوگیر بودیم و فکر میکردیم هممون با علاقه رشتمونو انتخاب کردیم و هممون قراره فعال باشیم. مغرور هم بودیم&#8230; فکر میکردیم خدای رشتمونیم. اما بعد ها با دروس و نیاز های جدیدی آشنا شدیم که باعث شد با زیرشاخه های رشتمون آشنا شیم و کم کم یکی از زمینه های مورد علاقمونو انتخاب کردیم. برای بعضی ها ممکنه زودتر و برای بعضی ها دیرتر اتفاق بیوفته. اونوقته که فکرمون یک سایز بزرگتر شده و لااقل بعد از اون من نکته مثبتی ندیدم تو دانشگاه. از اونموقع به بعد دیگه دانشگاه میشه عذاب، میشه مانعی برای رسیدن به اهداف. اونوقته که میخوایم وقتمونو بگذاریم برای یادگیری و کار و متقابلا از یکسری درس های غیرمرتبط عقب میوفتیم ولی استاد های عزیز لطف میکنن با نمره ندادن دانشگاهمونو طولانی تر میکنند تا چیزی که میخوان رو یاد بگیریم، نه چیزی که خودمون تصمیمشو داریم. این یعنی چی؟ یعنی توهین به تصمیمات دانشجو، توهین به اهداف دانشجو، جلوگیری از اینکه افراد حس مهم بودن کنند. شخص دانشجو از دیدگاه اساتید  یک موجود علافیه که نمیدونه کدوم سمت باید بره و نیاز داره تا راه بگذارن جلوش. <br></p>\n\n\n\n<p>اساتید عزیز، کارکنان عزیز دانشگاه لطفا بفهمید! دانشجو بخواد چیزی یاد بگیره خودش میره دنبالش. اینترنت هست. ازونجا یاد میگیره. همایش ها هستن، اونجا با چیز های جدید آشنا میشه. اگرم سوالی داشته باشه یا کمک بخواد اونوقت میاد و کمک میگیره. شما این حقو ندارید مجبورش کنید به یادگیری چیز هایی که شما بلدید و نه به کارش میاد و نه علاقه داره. اگه میخواید درستون واسش مفید باشه نباید مجبورش کنید، باید جذبش کنید!</p>\n\n\n\n<p>بهتر بود دانشگاه اختیاری باشه. کاش فرهنگ غنی جامعمون درک بیشتری از دنیای world wide web داشت و میفهمید تقریبا هرچیزی اونجا هست. اوایل خانواده ام مخالف درس نخواندن من بودند(من هیچوقت درس هایی که علاقه نداشتم رو نمره خوب نمیگرفتم. معدلمم معمولا جزو معدل های بالا نبوده). میگفتن اگه درس نخونی پس چطوری میخوای یاد بگیری؟</p>\n\n\n\n<p>پ.ن:</p>\n\n\n\n<ul><li>من نرم افزار میخونم و خودآموزی تو این رشته جواب میده. منتهی رشته هایی هم هست که اونقدری سورس ندارند و برای یادگیریشون به دانشگاه نیازه.</li><li>کاملا مخالف سیستم نمره دهی هستم. کار ندارم کجای جهان دانشگاه ها چطورین. من طرز دید خودمو دارم. دانشجو اگه درسیو بیوفته یکی دو ترم بعد بالاخره برش میداره و پاسش میکنه. اما&#8230; آیا اینطوری پاس کردن واقعا همراه با یادگیریه؟ آیا اگه میخواست اون درسو یاد بگیره همون ترم اول تلاششو نمیکرد؟</li></ul>\n","slug":"%da%86%d8%b1%d8%a7-%d8%af%d8%a7%d9%86%d8%b4%da%af%d8%a7%d9%87-%d8%b1%d9%88%db%8c-%d8%af%d8%a7%d9%86%d8%b4%d8%ac%d9%88-%d8%aa%d8%a7%d8%ab%db%8c%d8%b1%d8%a7%d8%aa-%d8%a8%d8%af-%d9%85%db%8c%da%af%d8%b0","tags":[{"name":"بدی های دانشگاه"},{"name":"به دانشگاه برویم؟"},{"name":"تاثیرات بد تحصیل"},{"name":"تاثیرات بد دانشگاه"},{"name":"خوبی و بدی های دانشگاه"},{"name":"دانش آموز"},{"name":"دانشجو"},{"name":"دانشگاه"},{"name":"سرکوب گری"},{"name":"سیستم آموزش و پرورش"},{"name":"مشکلات دانشگاه"},{"name":"مشکلات مدارس"},{"name":"مشکلات نظام آموزشی"}],"featured_media":{"alt_text":"","localFile":{"childImageSharp":{"fluid":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAXABQDASIAAhEBAxEB/8QAGAABAAMBAAAAAAAAAAAAAAAAAAIDBAX/xAAVAQEBAAAAAAAAAAAAAAAAAAAAAf/aAAwDAQACEAMQAAAB6dM8C9tAldQagf/EABwQAAICAgMAAAAAAAAAAAAAAAECABEDEiEyQv/aAAgBAQABBQJmN78zJ39KbDJZXFAKn//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQMBAT8BH//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQIBAT8BH//EABoQAAICAwAAAAAAAAAAAAAAAAARARAhQWH/2gAIAQEABj8CMzfBjJe6/8QAGxABAAMBAAMAAAAAAAAAAAAAAQARITEQcYH/2gAIAQEAAT8hMgyocNPfgPGQaF3R7AMNjO2+RzXOiUKJ/9oADAMBAAIAAwAAABDA777/xAAWEQEBAQAAAAAAAAAAAAAAAAABESD/2gAIAQMBAT8QC4//xAAVEQEBAAAAAAAAAAAAAAAAAAABIP/aAAgBAgEBPxBj/8QAHBABAAMAAgMAAAAAAAAAAAAAAQARITFhQYGh/9oACAEBAAE/EFq0rDqI2NUA1BssMmo+DodRHXMEHHuUGhieYuo0ZaiWgrVHT7KVrAowKJ//2Q==","aspectRatio":0.8519003931847968,"src":"/static/7d3bad3465d553f63d3add78d9ed73f0/00201/student-1-1.jpg","srcSet":"/static/7d3bad3465d553f63d3add78d9ed73f0/60a63/student-1-1.jpg 188w,\n/static/7d3bad3465d553f63d3add78d9ed73f0/4cd1e/student-1-1.jpg 375w,\n/static/7d3bad3465d553f63d3add78d9ed73f0/00201/student-1-1.jpg 650w","sizes":"(max-width: 650px) 100vw, 650px"}}},"media_details":{"width":650,"height":763,"file":"2018/12/student-1-1.jpg"}}}}]},"site":{"siteMetadata":{"title":"حسام‌ کاوه","subtitle":"با تلاش من و شما جهان بهتر خواهد شد. نوشته هایی در مورد پیشرفت شخصی، کسب و کار و برنامه نویسی"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"03764521-87a9-51e8-9e4f-2c81e01f7f4a"}}