{"data":{"wordpressTag":{"id":"168b2ece-2cd2-520d-b926-695c32fa6106","name":"اعتیاد به اینستاگرام","description":""},"allWordpressPost":{"edges":[{"node":{"id":"cf44bb0b-2b3b-5416-a5e5-47653c4075b9","title":"تجربه یک ماهه من از ترک اعتیاد، اعتیادی به سبک عادت","excerpt":"<p>اعتیاد فقط راجع به مواد مخدر نیست، من اعتیاد را نوعی وابستگی بد و به نوعی عادت می‌دونم و معمولا این وابستگی اعتیاده که بده وگرنه مثلا یک نخ سیگار به تنهایی چیز خاصی نیست. اعتیاد می‌تونه راجع به هرجیزی باشه، از چیز های خوب مثل قهوه بگیر تا چیز های بد مثل سیگار و &hellip; <a href=\"https://backend.hesamkaveh.com/%d8%aa%d8%ac%d8%b1%d8%a8%d9%87-%db%8c%da%a9-%d9%85%d8%a7%d9%87%d9%87-%d9%85%d9%86-%d8%a7%d8%b2-%d8%aa%d8%b1%da%a9-%d8%a7%d8%b9%d8%aa%db%8c%d8%a7%d8%af/\" class=\"more-link\">ادامه خواندن <span class=\"screen-reader-text\">تجربه یک ماهه من از ترک اعتیاد، اعتیادی به سبک عادت</span></a></p>\n","content":"<p>اعتیاد فقط راجع به مواد مخدر نیست، من <strong>اعتیاد</strong> را نوعی وابستگی بد و به<strong> نوعی عادت</strong> می‌دونم و معمولا این وابستگی اعتیاده که بده وگرنه مثلا یک نخ سیگار به تنهایی چیز خاصی نیست. اعتیاد می‌تونه راجع به هرجیزی باشه، از چیز های خوب مثل قهوه بگیر تا چیز های بد مثل سیگار و الکل.<!--more--></p>\n<p>میخوام اول راجع به اینستاگرام حرف بزنم و بعد ربطش بدم به عادت هامون توی زندگی. من یک ماهه که اینستاگرام رو کنار گذاشتم و استفاده ای نداشتم. استفاده من از اینستاگرام بیشتر حول پست های آموزشی، بیزینسی و انگیزشی بود. از اول که اینستاگرام نصب کردم تا الان کم پیش اومده واسم مهم باشه فالوور هام چه عکسی از خودشون گذاشتن، مثلا غذا چی خوردن، کجا رفتند، باکی رفتند یا&#8230; . بعضی پست ها رو که اصلا ناشی از افسردگی میدونم.</p>\n<h2>چرا اینستاگرام رو حذف کردم؟</h2>\n<p>مطالب آموزشی و بیزینسی که از کارآفرین های بزرگ (چه داخل چه خارج) دنبال میکردم واسم جذاب بودن. اما کم کم به این نتیجه رسیدم که کتاب خواندن می‌تونه خیلی موثرتر باشه. اما این به تنهایی دلیل حذف کردنش نیست! بعضی وقتا از سر بیکاری یه از سر رفتن حوصله اینستاگرام چک می‌کردم، دقیقا مثل خیلی های دیگه&#8230;. منتهی اون تایم ها حتی اگه مطالب آموزشی دنبال میکردم یادگیری چندانی نداشتم. چون اینستاگرام بیشتر برا سرگرمی مناسبه تا آموزش!</p>\n<p>از طرفی&#8230; من واقعا واسم مهم نیست بقیه چطور زندگی میکنند و در طول زندگیشون چه کار های قشنگی انجام می‌دن. نه اینکه مهم نباشه، مهمه ولی نمیخوام از ریز ریز جزئیاتشون باخبر شم! من هیچوقت اینجور مطالب رو دنبال نمی‌کردم اما چشمم بهشون می‌خورد و متاسفانه اینجور مطالب حتی اگه مستقیم روی طرز فکر آدم اثر نگذاره، رو ناخودآگاه آدم اثر میگذاره. و ضمنا نمیخوام مردم درست یا غلط زندگی رو تو اینستاگرام به من نشون بدهند؛ من یک فرصت دارم که یک زندگی ای رو کنترل کنم و اون زندگی خودمه، پس به سبک خودم عمل می‌کنم.</p>\n<h2>خوب، بد، زشت</h2>\n<p>تایم زیادی رو تو اینستاگرام نمی‌گذروندم ولی معمولا همون تایم بخاطر فرار از بیکاری بود! خوب نیست آدم همه تایم هاشو پر کنه، یه تایم هایی برای بیکاری، تفکر، وقت گذروندن با خانواده و&#8230; لازمه. با حذف اینستاگرام یه موقع هایی واقعا بیکار می‌شدم و خب این اوایل سخت بود واسم، چون عادت داشتم همیشه سرم با یه چیزی مشغول باشه، ولی دیگه طبق عادتم تو وقت های بیکاری اینستاگرامو چک نمی‌کردم. اما بعد ها متوجه شدم تایم بیکاری در اتوبوس رو میتونم با یه لبخند و اندکی تفکر پر کنم. یا اگه خانه باشم میتونم وقتمو با خانواده بگذرونم یا کتاب بخوانم.</p>\n<h2>چرخه عادت</h2>\n<p>و اینکه یه نکته ای هست. معمولا کار های تکراری شما بخاطر عادتتونه نه یک تصمیم که تفکر پشتش باشه. اگه تایم های بیکاری اینستاگرامتونو چک می‌کنید بخاطر یه چرخه سادست. شما بیکار شده اید، پس اینستاگرام چک میکنید، درنتیجه جایزه می‌گیرید. جایزتون چیه؟ احساس خوب مفید بودن. اینطوری دیگه اون احساس گناه بیکار موندنتون تبدیل میشه به یه حس خوب و رضایت.</p>\n<p><img class=\"aligncenter wp-image-158 size-full\" src=\"https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/11/Habit.jpg?resize=660%2C384&#038;ssl=1\" alt=\"\" width=\"660\" height=\"384\" srcset=\"https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/11/Habit.jpg?w=785&amp;ssl=1 785w, https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/11/Habit.jpg?resize=300%2C175&amp;ssl=1 300w, https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/11/Habit.jpg?resize=768%2C447&amp;ssl=1 768w\" sizes=\"(max-width: 660px) 100vw, 660px\" data-recalc-dims=\"1\" /></p>\n<p>در این نمودار محرک شما اینه که بیکار شده اید و بیکار شدن را دوست ندارید<strong>(محرک یا سرنخ)</strong>. پس دنبال راهی هستید که بهتون حس خوب بده، پس طبق عادتتون عمل می‌کنید و اینستاگرام چک میکنید<strong>(روتین یا کار تکراری)</strong>، وقتتون سپری میشه و حس میکنید کار مهمی انجام میدید<strong>(پاداش)</strong>. اما متاسفانه فقط موقع بیکار شدن این چرخه انجام نمی‌شه. زیاد دیدم مردم از ناراحنی یا استرس به چرخه ای مشابه این چرخه عمل میکنند. درواقع اینستاگرام شده جزوی از عادت های ما برای مواجهه با موقعیت های مختلف زندگی و ارضاء کردن اون. درواقع هرکسی چرخه منحصر به فرد خودش رو داره و هرکسی که مدام اینستاگرام چک میکنه، انتظار یک پاداشی خاص داره. ممکنه اینستاگرام برای یکی حس شادی و خوشحالی داشته باشه، ولی به من این حس دست میده که بیکار نیستم و سرم شلوغه، درواقع خودمو گول میزنم که وقتم رو مفید استفاده میکنم.</p>\n<p>پس در هر چرخه عادت سه پارامتر مهم هست. محرک، کار تکراری که انجام میدید، و پاداشی که می‌گیرید. اگه میخواید چرخه عادت ( بی‌کاری ـ چک کردن اینستاگرام ـ احساس مفید بودن ) رو حذف کنید باید بگم که نمیتونید! اما می‌توانید اونو عوض کنید.</p>\n<h2>چگونه چرخه عادت خود را عوض کنم؟</h2>\n<p><strong>محرک</strong> و <strong>پاداش</strong> شما معمولا یکسانه. یعنی در موقعیت های مشابه، انتظار پاداش خاصی را دارید و با یک روتین یا کار تکراری به اون پاداش می‌رسید و اون احساس خوب بهتون دست می‌ده. <strong>شما نمی‌تونین این چرخه رو حذف کنید چون مغزتون جوری برنامه ریزی شده که به ازای محرک های خاص پاداش خاصی انتظار داشته باشه. اما میتونید روتین(کار تکراری) رو عوض کنید.</strong> برگردیم به مثال خودمون. بیکار شدم==&gt; پس باید یک راهی پیدا کنم که احساس خوب بهم دست بده(وقتمو مفید سپری کنم) ==&gt; پس اینستاگرام رو چک میکنم. این چرخه نمیتونه حذف شه. چون محرک شما(احساس بیکاری) حذف نمیشه و یجوری باید بهش جواب داده شه. من به جای اینکه با اینستاگرام به این چرخه پاسخ بدم، کتاب میخونم یا وقتمو با خانواده سپری میکنم. درواقع کتاب/خانواده می‌شه واسطه ای برای از بیکاری به حس خوب رسیدن(تا قبل از این اینستاگرام واسطه بود).</p>\n<p><em>چرخه عادت قبلی من:</em> <strong>بیکار</strong> شدم ـ از <strong>اینستاگرام</strong> استفاده میکنم ـ احساس <strong>مفید</strong> بودن</p>\n<p><em>چرخه عادت جدید من:</em> <strong>بیکار</strong> شدم ـ <strong>کتاب</strong> میخوانم ـ احساس <strong>مفید</strong> بودن</p>\n<h2>مثالی دیگر از چرخه عادت</h2>\n<p><img class=\"alignnone size-full wp-image-172\" src=\"https://i1.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/11/habit-to-cigar.jpg?resize=660%2C385&#038;ssl=1\" alt=\"\" width=\"660\" height=\"385\" srcset=\"https://i1.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/11/habit-to-cigar.jpg?w=700&amp;ssl=1 700w, https://i1.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/11/habit-to-cigar.jpg?resize=300%2C175&amp;ssl=1 300w\" sizes=\"(max-width: 660px) 100vw, 660px\" data-recalc-dims=\"1\" /></p>\n<p>&nbsp;</p>\n<p>اگه عادت های ما نباشن زندگی خیلی سخت میشه. فرض کنید می‌خواهید کفش بپوشید، اول کدام کفش را پایتان می‌کنید؟ راست یا چپ؟ این طبق عادت شما انجام میشه و نیازی نیست هربار بهش فکر کنید. عادت ها بطور کلی خوب هستند چون <strong>دو بخش اصلی</strong> دارند یعنی <strong>محرک</strong> و <strong>پاداش</strong>. ولی یک<strong> بخش قابل تغییر</strong> دارند که اون تعیین کننده خوب یا بد بودن عملتونه. مثلا فردی را تصور کنید که هروقت ناراحته سیگار می‌کشه. بیاید چرخه عادت این فرد را بررسی کنیم. فرد ناراحت شده( محرک )  ==&gt; میخواد آرام شه( پاداش ) ==&gt; سیگار میکشه(نیکوتین باعث آرام شدن میشه)(کار تکراری). ممکنه افراد به دلایل مختلفی سیگار بکشند اما من همچین فردی مد نظرم بود. اگه بتونید محرک و پاداشتون را به درستی تشخیص بدهید، میتوانید کارتکراری(روتین) را عوض کنید. یک روتین جایگزین برای همچین فرد سیگاری ای میتونه وقت گذاشتن و درد و دل کردن با همسر باشه.</p>\n<p><img class=\"alignnone size-full wp-image-173\" src=\"https://i2.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/11/changed.jpg?w=100%25&#038;ssl=1\" alt=\"\" srcset=\"https://i2.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/11/changed.jpg?w=540&amp;ssl=1 540w, https://i2.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/11/changed.jpg?resize=300%2C160&amp;ssl=1 300w\" sizes=\"(max-width: 540px) 100vw, 540px\" data-recalc-dims=\"1\" /></p>\n<p>چرخه عادت به سیگار(همون اعتیاد به سیگار) به خودی خودش بد نیست. چون هرکی ناراحت باشه باید یجوری خودشو آروم کنه. منتهی راهی که برای پاسخگویی به این عادته، یعنی سیگار کشیدن، اون بده. سیگار صرفا یک وسیله ایه که باعث بشه چرخه عادت ما تکمیل بشه:</p>\n<p><em>چرخه عادت با پاسخگویی بد:</em> احساس <em><strong>ناراحتی</strong></em> ـ <strong>سیگار</strong> ـ احساس <em><strong>آرامش</strong></em>(نیکوتین)</p>\n<p><em>پاسخگویی خوب:</em> احساس <em><strong>ناراحتی</strong></em> ـ ارتباط با<strong> همسر</strong> ـ احساس <em><strong>آرامش</strong></em></p>\n<p>پس چرخه عادت های ما بد نیستن چون کاملا نیاز های طرف رو پوشش میدن. منتهی این مهمه که چطوری به اونها پاسخ بدیم.</p>\n<p>&nbsp;</p>\n<p>اگر آدم چرخه عادت هاشو بشناسه و این اراده رو داشته باشه که کار های تکراریشو تغییر بده، میتونه اون کار رو بعضی وقت ها بصورت انتخابی انجام بده. مثلا من میتونم اینستاگرام بیام و موتادش نباشم. اینستاگرام جای بسیار خوبیه برای افرادی که میخوان با کسی ارتباط بزنن یا کسی رو بشناسن. منتهی مشکلی که داره اینه که پست های دیگران روی آدم تاثیر میگذارند و من راه حلی برای این پیدا نکرده ام.</p>\n<p>عادت های ما بیشتر از قدرت تفکر تو زندگیمون تاثیر دارن، کتاب قدرت عادت یاد میده تا با تفکر عادت هامونو جایگزین کنیم.</p>\n","slug":"%d8%aa%d8%ac%d8%b1%d8%a8%d9%87-%db%8c%da%a9-%d9%85%d8%a7%d9%87%d9%87-%d9%85%d9%86-%d8%a7%d8%b2-%d8%aa%d8%b1%da%a9-%d8%a7%d8%b9%d8%aa%db%8c%d8%a7%d8%af","tags":[{"name":"اعتیاد به اینستاگرام"},{"name":"اعتیاد به سیگار"},{"name":"جایگزین کردن عادت ها"},{"name":"قدرت عادت"}],"featured_media":{"alt_text":"","localFile":{"childImageSharp":{"fluid":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAQABQDASIAAhEBAxEB/8QAGAAAAwEBAAAAAAAAAAAAAAAAAAIDBAX/xAAWAQEBAQAAAAAAAAAAAAAAAAAAAwT/2gAMAwEAAhADEAAAAb1RslOebQ//xAAYEAADAQEAAAAAAAAAAAAAAAAAAQIRA//aAAgBAQABBQLnODK4LZ6KjR4z/8QAFhEBAQEAAAAAAAAAAAAAAAAAAAER/9oACAEDAQE/AYx//8QAGREAAgMBAAAAAAAAAAAAAAAAABEBAhIh/9oACAECAQE/AbN9Nyf/xAAaEAACAgMAAAAAAAAAAAAAAAAAETFBARAh/9oACAEBAAY/AneuZQrIIP/EABwQAAICAgMAAAAAAAAAAAAAAAABESExQVFhsf/aAAgBAQABPyHLq2OhFEM0P4LhXobRYRkuR//aAAwDAQACAAMAAAAQpy//xAAVEQEBAAAAAAAAAAAAAAAAAAARAP/aAAgBAwEBPxAEL//EABcRAQEBAQAAAAAAAAAAAAAAAAEAETH/2gAIAQIBAT8Q2gM7f//EABwQAQACAgMBAAAAAAAAAAAAAAEAESFBUWHB4f/aAAgBAQABPxAa2jwdOWCLa2XfyNSqZqCD1cAKOHxBI6qIltJ//9k=","aspectRatio":1.2152777777777777,"src":"/static/630e48d205c6f89a826cbe6e3da60b80/13e10/the-pwer-of-habit.jpg","srcSet":"/static/630e48d205c6f89a826cbe6e3da60b80/60a63/the-pwer-of-habit.jpg 188w,\n/static/630e48d205c6f89a826cbe6e3da60b80/4cd1e/the-pwer-of-habit.jpg 375w,\n/static/630e48d205c6f89a826cbe6e3da60b80/13e10/the-pwer-of-habit.jpg 700w","sizes":"(max-width: 700px) 100vw, 700px"}}},"media_details":{"width":700,"height":576,"file":"2018/11/the-pwer-of-habit.jpg"}}}}]},"site":{"siteMetadata":{"title":"حسام‌ کاوه","subtitle":"با تلاش من و شما جهان بهتر خواهد شد. نوشته هایی در مورد پیشرفت شخصی، کسب و کار و برنامه نویسی"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"168b2ece-2cd2-520d-b926-695c32fa6106"}}