{"data":{"wordpressPost":{"title":"نود و هفت: کوله باری برای سال جدید","acf":{"description":""},"wordpress_id":375,"content":"\n<p>ما آدما تو زندگیمون به سمت و سو های زیادی میریم. همچو کشتی در دریای طوفانی. تنها چیزی که میتونه سمت و سوی حرکتمونو مشخص کنه اینه که بدونیم کدوم سمت برویم! اما فقط این کافی نیست. باید بدونیم با چه سرعتی پیش برویم تا هم پیشروی خوبی داشته باشیم هم سوختمون تموم نشه. </p>\n\n\n\n<!--more-->\n\n\n\n<h3>ورزش</h3>\n\n\n\n<p>من تو زندگیم عشق های زیادی داشتم. از معدود عشق های پایداری که از بچگیم همراهم بوده دوچرخه سواریمه. سال پیش هم این عشق به گرمی گذشت. اگه بخوام یک حساب سرانگشتی کنم سال پیش جمعا به اندازه یک ماه با دوچرخه در مسافرت بودم. هیچوقت اینطوری نگاه نمی‌کنم که یک ماه تو زندگیم عقب افتادم، چون تابحال به هرجا رسیدم مدیون ورزش و علی‌الخصوص دوچرخه سواری بودم. فقط یک ورزش نیست&#8230; بلکه کلی مهارت به آدم یاد میده.</p>\n\n\n\n<p>اما سبک دوچرخه سواری من یک مشکل داره. ماه به ماه ممکنه سوار دوچرخه نشم (و عملا ورزش نداشته باشم) تا اینکه برم مسافرت. امسال قصد دارم برای کار های روزمره کمتر از ماشین استفاده کنم و همچنین هر جمعه دوچرخه سواری کنم. </p>\n\n\n\n<p>سال پیش یکم استخر و فوتسال و باشگاه بدنسازی هم رفتم. یکی از اینا رو با برنامه و درحد لالیگا ادامه میدم. احتمالا انتخابم شنا خواهد بود چون قبلا بصورت حرفه ای دنبال میکردم( هر کسی کو دور ماند از اصل خویش*** باز جوید روزگار وصل خویش )<br></p>\n\n\n\n<h3>پول و مهارت</h3>\n\n\n\n<p>پول و مهارت دو چیز کاملا جدا از هم هستن. آدمای پولدار کسایی نیستن که مهارت بالایی دارند، بلکه کسایی هستن که میدونن از مهارتشون چطوری استفاده کنند. خیلی تلاش کردم بتونم در مورد این دو حیث جداگونه بنویسم اما هی نوشتم و هی پاک کردم. خلاصه که نشد که بشه. سال گذشته در یک درگیری بودم بین اینکه مهارت زیاد کنم یا درآمد کسب کنم. درنهایت به این نتیجه رسیدم الان وقتیه که به مهارت بیشتر از پول نیاز دارم و پول درآوردن رو محدود کردم به رفع نیاز هام. تقریبا نیمی از سال را فقط به مهارت چسبیده بودم و نیمی از سال را به کسب درآمد. با این‌حال رشد ۲ برابری در درآمدم داشتم که عملا از لذتش بخاطر گرونی ها بهره ای نبردم.</p>\n\n\n\n<p>اما امسال یکم وضع فرق داره. یکم بیشتر تمرکز میکنم روی درآمد و برای رشد ۳ برابری آماده شدم. نگاهی که به برنامه نویسی دارم عین نگاه به یک ابزاره که کارمو راه میندازه. بنابراین بیزینسی به برنامه نویسی نگاه میکنم و اینم میدونم که تا آخر عمر برنامه نویسی نمیکنم.</p>\n\n\n\n<h3>وزارت فرهنگ و سواد</h3>\n\n\n\n<p>کتاب فقط ۷ تا خواندم. افتضاحه. حس میکنم بیشتر از اینکه کتاب‌خوان باشم، حرفشو می‌زنم. امسال تصمیم دارم 15 تا کتاب بخوانم. برای من جهش نسبتا بزرگیه رسیدن به این تعداد و برای همین یک پست مینویسم از کتاب هایی که باید بخوانم و اونجا برنامه ریزی می‌کنم. </p>\n\n\n\n<h3>صدا و سیما</h3>\n\n\n\n<p>و اما وبلاگ&#8230; ۷ ماهه شده و ۱۴ تا پست. یعنی ۲ تا در ماه.  فکر میکردم کمتر از اینا باشه و خب راضیم که اینطور بوده. نوشتن رو ۱۰۰٪ ادامه میدم و برنامه دارم چند بخش جالب بهش اضافه کنم مثل نوشتن در مورد کتاب هایی که خواندم یا خاطرات سفر.</p>\n\n\n\n<p>به <a rel=\"noreferrer noopener\" aria-label=\"لیموناد (در یک برگه جدید باز می‌کند)\" href=\"http://limoonad.com/\" target=\"_blank\">لیموناد</a> هم قول دادم یک دوره آموزش جنگو منتشر کنم. دارم روش کار میکنم و نیمه اول سال منتشر میشه.</p>\n\n\n\n<h3>تجربه های جدید</h3>\n\n\n\n<p>عاشقشم! یکی از چیزایی که باعث میشه زنده بمونم تجربه های خاص و پر هیجانه. به هیچ قیمتی نمیفروشمشون و الان هم سنم جوریه که میتونم تجربشون کنم. </p>\n\n\n\n<p>امسال چه از نظر شغلی چه از نظر تفریحی چند تا تجربه باحال دارم. reactjs کار کردم و به یکی از فریمورک های محبوبم اضافه شد! میتونید قالب این وبسایت را از <a rel=\"noreferrer noopener\" aria-label=\"گیت‌هاب (در یک برگه جدید باز می‌کند)\" href=\"https://github.com/hesamkaveh/sansi\" target=\"_blank\">گیت‌هاب</a> بگیرید و استفاده کنید. قبل تر در مورد <a href=\"https://hesamkaveh.com/%d8%a7%d8%b2-reactjs-%d8%aa%d8%a7-gatsbyjs-%d9%80-%d8%aa%d8%ac%d8%b1%d8%a8%db%8c%d8%a7%d8%aa-%d9%85%d9%86-%d8%a7%d8%b2-%d8%af%d9%86%db%8c%d8%a7%db%8c-reactjs\">دلیل استفادم از gatsby</a> نوشتم.</p>\n\n\n\n<p>تجربه تدریس پایتون هم داشتم با ۷۰ تا دانشجو! در دانشگاه اراک کلاس آموزش مقدماتی پایتون گذاشتم و استقبال خیلی خوبی شد. بازم از این جور کلاس ها برگزار میکنم ولی مطمئنن به عنوان یک شغل بهش نگاه نمی‌کنم.<br></p>\n\n\n\n<p>تجربه ورزشی خیلی خاصی هم که داشتم غارنوردی بود. تابحال وقتی فکرم میرفت سمت غار، یک محیط امن که پر از چراغ و بازدیدکنندست رو تصور میکردم. اما غارپیمایی یعنی رفتن به جایی که تنها چیزی که توش وجود نداره امنیته. ولی در عوض تاریکی مطلق، خفاش، کار های خفن مثل صخره نوردی و این چیزا توش هست. </p>\n\n\n\n<p>امسال از نظر ورزشی صخره‌نوردی رو امتحان میکنم و از نظر شغلی هم اعتقاد دارم reactjs اونقدری گسترده هست که بتونم واسش وقت بذارم. التبه قصد دارم نیم نگاهی هم به nodejs بندازم.</p>\n\n\n\n<h3>روابط</h3>\n\n\n\n<p>ترکوندم! امسال رشد زیادی تو روابطم داشتم که از مهارت هاییه که تو سفر با دوچرخه بدست آوردم. دیگه به اون مهارتی رسیدم که با هرکسی بخوام بتونم ارتباط بزنم. از این بین دو تا دوست خوب پیدا کردم و یکمم دارم روی دوست های صمیمیم تجدید نظر می‌کنم. دوست خیلی روی آدم تاثیر داره و خواه ناخواه مسیر شبیه به همی رو طی میکنیم. </p>\n\n\n\n<h3>اولویت ها<br></h3>\n\n\n\n<ul><li>استارتاپ اخیرمونو به درآمد میرسونم.</li><li>ورزش پیوسته</li><li>مطالعه</li><li>دوره آموزشی آنلاین</li><li>عمیق کردن روابط</li></ul>\n","date":"2019,3,22","publish_date":"22-03-2019 11:17:00 am","modified_date":"22-03-2019 11:18:12 am","categories":[{"name":"قوانین زندگی من"}],"tags":[{"name":"برنامه ریزی","slug":"%d8%a8%d8%b1%d9%86%d8%a7%d9%85%d9%87-%d8%b1%db%8c%d8%b2%db%8c"}],"featured_media":null}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"a958e1b7-a4b4-558c-ae80-337f01ceda81"}}