{"data":{"wordpressPost":{"title":"تجربیات یک فریلنسر از ۳ سال حبس شدن در اتاق","acf":null,"wordpress_id":76,"content":"<p>شنیدید میگن با هرکی بگردی شبیه به همون می‌شی؟ یا شخصیت آدم میانگین شخصیت های ۵ نفر اطرافشه؟ من سه ساله که تو یک اتاق حبس شدم. تقصیر خودم بودا! انتخابی بود که خودم کردم، خودم کردم که لعنت بر خودم باد. این سه سال بیشتر دوستام مجازی بودن یا نهایتا هر چند روزی یکدومشونو میدیدم&#8230;. خب محدودیت داشتم تو خروج از اتاق. البته نه اینکه نگهبانی بالا سرم باشه یا کسی مجبورم کرده باشه تو اتاق بمونما، خودم اینطور میخواستم. آها شخصیتم یجورایی میانگینی شده بود از خودم و کامپیوترم! شاید چون باهاش از هرکسی راحتتر بودم و بیشترین وقتو هم با همین زبون بسته میذاشتم. البته اگه یک اینترنت درست درمون بهش وصل باشه همچینم زبون بسته نیست. این سه سال داشتم سعی میکردم زبون حرف زدن باهاشو بیشتر و بیشتر یاد بگیرم اما هرچی جلوتر می‌رفتم مییدیدم چیزای خیلی بیشتری هست&#8230; انگارکه از هرطرف انتهاش سرابی بیش نیست!<br />\nبعضی وقتا هم با بچه ها کنار هم جمع میشدیم و هرکدوم مینشستیم پشت لپ تاپمون و کارمونو میکردیم. تا حدیش خوب بود و مشکلاتمونو با هم به اشتراک میذاشتیم و بعضا زودتر حل میشد. اما بعضی وقت‌ها خوب نبود. نظر منو بخوای لپ تاپ عین ناموس آدم میمونه. بعضی وقت‌ها میشه اکیپی کنار هم نشست. اما معمولا ترجیه بر اینه که خلوت کنیم و تو سکوت و تمرکز کامل عشق بازی کنیم.<!--more--><br />\nهمه ی اینارو گفتم که فقط یجیزی بهتون بگم. من فریلنسری رو دوست دارم اما هرچیزی حدی داره. دوست ندارم یه خفن کامپیوتری باشم، ولی الان همچین دید رو نسبت به خودم دارم. نه به این معنا که ته کامپیوترو دراوردما، بلکه به این معنا که دور خودمو پر کردم از یک مشت تسک که تک تکشون ارزشمندن برام و انگار هیچوقت تمومی ندارن.</p>\n<h2>فریلنسری، خوب، بد، زشت<strong><br />\n</strong></h2>\n<p>هرچیزی خوبی ها و بدی های خودشو داره. اما <strong>هرچیزی زیادیش بده! هرچیزی!</strong></p>\n<ul>\n<li>تجربه فریلنسری بهم اجازه داد<strong> فقط هرچیزی رو که به کارم میاد و علاقه دارم یاد بگیرم</strong>. اما شاید اگه تو یه شرکت بودم، چیز های متفاوت تری یاد میگرفتم. چیز هایی که گاها دلم نمیخواست ولی خب ضایعه اگه انجامشون ندم یا بلد نباشمشون.</li>\n<li><strong>هم تندتر پیشرفت میکنید هم کندتر.</strong> واقعیتش به نظر قطعی نرسیدم. بعضی چیزا و مشکلات هستن که تو خلوت خودم راحتتر یادشون میگیرم، وقتی یک Road map مشخص داشته باشم، احتمالا تا یک سطحی رو تنهایی راحتتر پیش میرم. اما بعضی مشکلات هستن هم فکری میخوان. از طرفی، یکسری تجربیات هست که بقیه با سعی و خطا بسیار کسب کردن و احتمالا حضوری بهترین روش باشه که در اختیارتون بذارنش.</li>\n<li>یه فریلنسر<strong> وقتش آزاده</strong>. هرموقع که میخواد کار میکنه هر موقع که میخواد کار نمیکنه. هرموقع که میخواد میره مسافرت. ولی این شیوه کار کردن بسیار بسیار <strong>اعتیاد آوره</strong>. اگه موتادش بشید احتمالا انجام تسک هاتونو حتی به خواب شب ترجیه میدید. اگه قراره روزی 8 ساعت بخوابید همون 8 ساعت میخوابیدا، ولی تا وقتی ذهنتون میکشه کار میکنید و همین باعث میشه خوابتون هم به هم بریزه.</li>\n<li><strong>از جامعه دور میشید.</strong> این اصلی ترین مشکل فریلنسریه. من یک آدمی بودم که تنهایی تا سر کوچه هم نمیرفتم، اما الان راحتترم که با کامپیوترم حرف بزنم تا با دوستام!</li>\n<li>سلامتی رو جدی بگیرید. البته فریلنسر ها معمولا بیشتر وقتشونو درحال ورزشن، ورزش از نوع ذهنی. اما<strong> بدنتون بعد یک مدت ضعیف میشه.</strong> سعی کنید برا کارتون خرج کنید. <strong>مهندس کامپیوتر فقط یک لپ تاپ نمیخواد</strong>، بلکه صندلی، میز و مانیتور خیلی خیلی مهمند. حتی عینک کامپیوتر هم برا اینجور افراد ساخته شده&#8230; ما استفاده نکنیم پس کی قراره استفاده کنه؟ بخدا که خیلی تاثیر داره. من بطور میانگین روزانه 15 کیلومتر رکاب میزنم. کمتر ماهی پیش میاد که استخر نرم. با اینحال تا وقتی تجهیزاتمو بروز نکرده بودم کمردرد و گردن درد داشتم.</li>\n</ul>\n<ul>\n<li><strong>فریلنسر ها معمولا راحتتر متمرکز می‌شوند.</strong> درسته که کسی که میتونه تمرکز کنه، در هرجایی میتونه تمرکز کنه. اما به شدت معتقدم که تو خونه راحتتر میتونید تمرکز کنید. <strong>باید تکنیک هاشو بلد باشید</strong> وگرنه میشید یه مولتی تسکر و بین هزاران تسک فکرتون آشفته میشه! مطمئنا <strong>اگه کسی بلد نباشه با چه روشی تمرکز کنه، خب نمیتونه تمرکز کنه!</strong> دیگه فرقی نداره تو شرکت کار کنه یا تو خونه! معمولا برای اینکه کارهام باهم قاطی نشه روی کاغذ کار هایی که باید انجام بدمو مینویسم(ToDo List) و کاری که الان مشغولشم رو هم مشخص میکنم(Current Task).</li>\n</ul>\n<p><img class=\"alignnone wp-image-81 size-full\" src=\"https://back.hesamkaveh.com/wp-content/uploads/2018/10/20181004_224344.jpg\" alt=\"\" width=\"1080\" height=\"810\" srcset=\"http://backend.hesamkaveh.com/wp-content/uploads/2018/10/20181004_224344.jpg 1080w, http://backend.hesamkaveh.com/wp-content/uploads/2018/10/20181004_224344-300x225.jpg 300w, http://backend.hesamkaveh.com/wp-content/uploads/2018/10/20181004_224344-768x576.jpg 768w, http://backend.hesamkaveh.com/wp-content/uploads/2018/10/20181004_224344-1024x768.jpg 1024w\" sizes=\"(max-width: 1080px) 100vw, 1080px\" /></p>\n<h2>چند توصیه برای فریلنسر ها</h2>\n<ul>\n<li>مواظب باشید خوابتون به هم نریزه! جدا ازینکه خواب نامنظم برای بدنتون ضرر داره، باعث میشه کنترل زمانیتونو از دست بدید. <strong>چیزی که به‌نظرم مهمتر از صبح زود بیدار شدنه، خواب منظم داشتنه</strong>. شخصا پر بازده ترین روز هام روز های متوالی ای بوده که صبح زود از خواب بیدار میشدم. تسکی رو که روز های عادی تو 1 ساعت انجام میدادم، در همچین روزهایی زودتر انجامشون میدم.</li>\n<li><strong>ساعت کاری</strong> تعریف کنید. خیلی خیلی مهمه! هم باعث میشه از جامعه دور نشید و به کار های دیگرتون برسید همینکه باعث میشه بازدهتون بالاتر بره و سریع تر تسک هارو انجام بدین. و شاید هزار تا خوبی دیگه!</li>\n<li><strong>اجتماعی باشید</strong>. اگه خوره کامپیوتر باشید احتمالا بهترین نعمت دنیا نصیبتون شده. چون کار و تفریحتون یکیه! یا بهتره بگم کارتون تفریحتونه! ولی از حدش رد نکنید! حداعقل جمعه هارو به خودتون استراحت بدید. باعث میشه هم اجتماعی تر باشید و انسانی تر زندگی کنید و همینکه ذهنتون باز شه و تو ادامه کار بهتر پیش برید! ضمنا! هیچ کس و هیچ شرکتی دوست نداره کارمند یا دوستش یه برنامه نویسی باشه که همش سرش تو کامپیوتره و دیوانه وار درحال کد زدنه!</li>\n<li><strong>ورزش</strong> کنید. هیچ چیز از سلامتی مهمتر نیست. من کارمو دوست دارم پس ترجیه میدم حتی 50 سالگی هم بتونم کد بزنم.</li>\n<li>هر از گاهی <strong>مکانتونو عوض کنید</strong>. من تجربه کافه گردی و کد زنی در کافه رو دارم. تجربه کد زنی تو اتاق در بسته رو هم دارم. گاها روی موبل هم مشغول کار شدم! اما بهترین نوعش میشه ترکیب همه ی اینا با هم. سعی کنید همیشه یک جا نباشید.</li>\n</ul>\n<p>تو زندان ماندن را دوست دارم. البته هرگاه دلم میخواد از معشوقه ام جدا می‌شوم و چند روزی به مسافرت می‌روم. با دوچرخه سفر رفتن رو بیشتر از هر سفر دیگری دوست دارم. چون کمک میکنه ذهنم کمتر درگیر تسک ها باشه. چون کمک میکنه برای مدتی هرچند کوتاه، دور از تکنولوژی باشم. میگن برا جسم و روح آدم خوبه! آها&#8230;.. تو سفر با دوچرخه با ده ها نفر دوست میشم و اینم کمک میکنه رفتار انسانیم حفظ بشه.</p>\n<p>اما&#8230; زندان جای خوبی نیست. کامپیوتر هم به عنوان معشوقه خوب نیست، لااقل نه به عنوان معشوقه اول! پس اگه تصمیم دارید فریلنسر باشید یه فریلنسر باحال باشید. یکی باشید که علاوه بر کامپیوتر و کارش هزار تا دغدغه دیگه هم داشته باشه. یکی که وقتی زندگی نامه‌شو مینویسن کامپیوتر و برنامه نویسی(یا هرکاری که با کامپیوتر میکرده) تنها نقطه قوت زندگیش نیست. چون اصلا همچین چیزی شدنی نیست. اگر تو کارتون موفقید قطعا تو چند بُعد دیگه از زندگیتون هم موفقید، مثل ارتباطتون با خانواده. امکان نداره که برنامه نویس موفقی باشید ولی تو هیچ چیز دیگه ای موفق نباشید.</p>\n","date":"2018,10,04","publish_date":"04-10-2018 04:05:10 pm","modified_date":"24-11-2018 06:34:52 pm","categories":[{"name":"برنامه نویسی"},{"name":"جامعه"}],"tags":[{"name":"تجربیات یک فریلنسر","slug":"%d8%aa%d8%ac%d8%b1%d8%a8%db%8c%d8%a7%d8%aa-%db%8c%da%a9-%d9%81%d8%b1%db%8c%d9%84%d9%86%d8%b3%d8%b1"},{"name":"خوبی ها و بدی های فریلنسری","slug":"%d8%ae%d9%88%d8%a8%db%8c-%d9%87%d8%a7-%d9%88-%d8%a8%d8%af%db%8c-%d9%87%d8%a7%db%8c-%d9%81%d8%b1%db%8c%d9%84%d9%86%d8%b3%d8%b1%db%8c"},{"name":"فریلنس","slug":"%d9%81%d8%b1%db%8c%d9%84%d9%86%d8%b3"},{"name":"فریلنسر","slug":"%d9%81%d8%b1%db%8c%d9%84%d9%86%d8%b3%d8%b1"},{"name":"نکاتی در مورد فریلنسری","slug":"%d9%86%da%a9%d8%a7%d8%aa%db%8c-%d8%af%d8%b1-%d9%85%d9%88%d8%b1%d8%af-%d9%81%d8%b1%db%8c%d9%84%d9%86%d8%b3%d8%b1%db%8c"}],"featured_media":null}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"370daf03-ac2a-5a18-a3b2-26ac80379a9c"}}