{"data":{"wordpressTag":{"id":"c07595f1-0d4c-548a-a913-fde07f7d7e46","name":"جامعه شناسی","description":""},"allWordpressPost":{"edges":[{"node":{"id":"59ef2130-fafb-5702-9714-131272e43617","title":"معلولیت","excerpt":"<p>معلولیت نه ذهنیست نه جسمی، معلولیت طرز نگاه به قضایاست. این اواخر خونه رو امن ترین پناهگاهی انتخاب کردم که در اون هستم. تنهایی هم خوبی‌هایی دارد که گاهی به همان اندازه که اجتماعی بودن خوب است، گوشه گیری هم خوب است، آخه میدونی؟ وقتی فقط خودت باشی میتونی یک عالمه فکر های قشنگ داشته &hellip; <a href=\"https://backend.hesamkaveh.com/%d9%85%d8%b9%d9%84%d9%88%d9%84%db%8c%d8%aa/\" class=\"more-link\">ادامه خواندن <span class=\"screen-reader-text\">معلولیت</span></a></p>\n","content":"<p>معلولیت نه ذهنیست نه جسمی، معلولیت طرز نگاه به قضایاست.</p>\n<p>این اواخر خونه رو امن ترین پناهگاهی انتخاب کردم که در اون هستم. تنهایی هم خوبی‌هایی دارد که گاهی به همان اندازه که اجتماعی بودن خوب است، گوشه گیری هم خوب است، آخه میدونی؟ وقتی فقط خودت باشی میتونی یک عالمه فکر های قشنگ داشته باشی ولی وقتی تو جامعه ای، طرز فکر اونا هم روت تأثیر داره. از پناهگاه که بیرون میرم همه از تحریم ها و قیمت دلار مینالن و این تومخی ترین شیونی است که این روز ها می‌شنوم. این روزا چیزی که بیشتر از مسائل سیاسی و قیمت ها ناراحتم میکنه همین نالش مردمه. البته نه اینکه فرد سیاسی ای باشم، اما خب دارم تاثیراتشو می‌بینم. البته درکشون میکنماا، اوضاع واقا سختیه اما یکی نیست بگه آخه ای انسان! کار با نالیدن که به جایی نمی‌رسه. مگه فرق انسان و حیوان در قدرت تفکر و تصمیم‌گیری نیست؟ پس بجا اینکه بنالی و جامعتو از اینی که هست افسرده تر کنی یه راهی پیدا کن درآمدت با این قیمتا تطبیق پیدا کنه.</p>\n<p>بهترین کاری که تو این اوضاع میشه کرد لبخند زدنه. لبخند زدن به معنای نادیده گرفتن شرایط موجود نیست، بلکه لبخند قوی‌ترین سلاح آدمی در برابر بدترین و سخت ترین شرایطه. درواقع روحیه خوب باعث میشه فکرمون باز شه و بجا نالیدن به فکر چاره باشیم. البته تأثیرش عین بمب اتمیه که همه رو دربر میگیره! افسردگی بدترین و سخت ترین بیماریه، آدم افسرده با طرز فکر آلوده خودش ارضاع میشه و به همین جهته که باید برای بیرون کشیدن مردمانمون از بند افسردگی از سلاح قوی‌ای چون لبخند استفاده کنیم. انگار تو ایران چند سالیه فراموش کردیم چطوری خوشحال باشیم. کسی انرژی زیاد داشته باشه میگیم داداش چی زدی؟ جنسش خوب بوده. موقع عکس انداختن اخم می‌کنیم چون اونطوری شاخ‌تر بنظر میایم. ماسک‌های بزرگسالی به چهرمون زدیم و نگران چروک پیرهنمونیم. من عاشق روحیه بچه هام چون اگه از چیزی ناراحت بشن زود فراموشش میکنن و اگرم چیزیو بخوان خودشونو به هر دری میزنن تا بدستش بیارن. تازه… اونا هنوز فراموش نکردن چطوری شاد باشن.</p>\n<p>من این روزا خیلی خوشحالم، نه بخاطر وضع اقتصادی که رو زندگی هممون تأثیرشو گذاشته. بلکه این روزای سخت چالشیه که عیار منو میسنجه، سربلند بیرون بیام عیارم بیشتر میشه. ما نمیتونیم شرایطو تغییر بدیم ولی میتونیم دیدگاهمونو نسبت به شرایط عوض کنیم.</p>\n","slug":"%d9%85%d8%b9%d9%84%d9%88%d9%84%db%8c%d8%aa","tags":[{"name":"اوضاع اقتصادی"},{"name":"ایران افسرده"},{"name":"تحریم"},{"name":"جامعه شناسی"},{"name":"لبخند"},{"name":"معلولیت ذهنی"}],"featured_media":null}}]},"site":{"siteMetadata":{"title":"حسام‌ کاوه","subtitle":"با تلاش من و شما جهان بهتر خواهد شد. نوشته هایی در مورد پیشرفت شخصی، کسب و کار و برنامه نویسی"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"c07595f1-0d4c-548a-a913-fde07f7d7e46"}}