{"data":{"wordpressTag":{"id":"635af9ca-1d12-514a-9d50-c070c274a480","name":"تاثیر روی جامعه","description":""},"allWordpressPost":{"edges":[{"node":{"id":"a01ebb65-fc87-56fb-91f5-61cc6fa748f2","title":"حیوان بودن بسه!","excerpt":"<p>روزی بود روزگاری بود&#8230; . در یک شب سرد زمستونی پسری به دنیا اومد. پسر خیلی خاصی بنظر نمیرسید ها&#8230; مثل پسر های دیگه بود. منتهی هرچی بزرگ‌تر میشد داشت میفهمید همه مردم یجورایی مثل هم زندگی می‌کنند. همه یروزی از شکم مامانشون بیرون میان، کودکی میکنند، مدرسه و دانشگاه میروند، کار میکنند، خانواده تشکیل &hellip; <a href=\"https://backend.hesamkaveh.com/%d8%ad%db%8c%d9%88%d8%a7%d9%86-%d8%a8%d9%88%d8%af%d9%86-%d8%a8%d8%b3%d9%87/\" class=\"more-link\">ادامه خواندن <span class=\"screen-reader-text\">حیوان بودن بسه!</span></a></p>\n","content":"\n<p>روزی بود روزگاری بود&#8230; . در یک شب سرد زمستونی پسری به دنیا اومد. پسر خیلی خاصی بنظر نمیرسید ها&#8230; مثل پسر های دیگه بود. منتهی هرچی بزرگ‌تر میشد داشت میفهمید همه مردم یجورایی مثل هم زندگی می‌کنند. همه یروزی از شکم مامانشون بیرون میان، کودکی میکنند، مدرسه و دانشگاه میروند، کار میکنند، خانواده تشکیل میدهند و آخرش هم میوفتن یه گوشه ای میمیرند. برخلاف میلش راهی که همه رفتند رو رفت و از قضا به بهترین ها هم رسید. بهترین ماشین، بهترین خانه، بهترین امکانات زندگی. یه همسر هم داشت خیلی همو دوست داشتند. در یک منطقه جنگلی و خیلی قشنگ هم زندگی میکردند و صبح ها با صدای پرنده ها از خواب بیدار میشدند. شب ها هم با صدای باران خوابشون می‌برد. خلاصه که زندگی خیلی خوبی داشتند. همه چیز در آرامش کامل و زندگی ای پر از امکانات.</p>\n\n\n\n<!--more-->\n\n\n\n<p>تقریبا دیگه چیزی نبود که از زندگی بخواد و بهش نرسیده باشه. اما بعد از سالیان سال زندگی و کار بالاخره روز موعود فرا رسید و این بابا هم مثل همه بابا های دیگه فوت کرد. دوست و آشنا زیاد داشت، همه اومدن سر قبرش و کلی گریه زاری کردن&#8230; . خیلی شلوغ شده بود&#8230;</p>\n\n\n\n<p> از ملیون ها سال پیش روز به روز انسان هایی متولد شدند و هدفشون آرامش بوده. در طول زندگیشون برای خواسته هاشون تلاش کردند. این بابای قصه ما هم جزو یکی از ایناست. در طول عمرش زندگی خیلی خوبی داشت، اما آخرش که چی؟ جز پر کردن چاه زیر خونش، آیا تاثیری روی این دنیا گذاشته؟ از اونجایی که من میدونم، هرکاری کرده برای خودش بوده&#8230; نمیگم بده، اما یکم عمیق که فکر کنیم زندگی چندان ارزشمندی نداشته&#8230;. اون زندگی ای ارزشمنده که روی زندگی دیگران تاثیر خوب بگذاره. و اون زندگی ای ارزشمندتره که در طول سالیان سال و حتی بعد از مرگش این تاثیرگذاری ادامه داشته باشه. درسته که وقتی این بابا فوت کرد خیلی ها ناراحت شدند، اما آیا چند سال دیگه کسی اصلا یادی ازش میکنه؟</p>\n\n\n\n<p>اگر بخوایم فقط فکر خودمون باشیم و تنها هدفمون پر و خالی کردن شکممون باشه، اینکه الان بمیریم یا ۶۰ سال دیگه هیچ فرقی نداره. تازه&#8230; ممکنه کلی هم به طبیعت آسیب برسونیم&#8230; بالاخره یچیزی باید بخوریم دیگه.</p>\n\n\n\n<p>تقریبا هر کاری انجام میدم میپرسم آخرش که چی. حتی بازی کامپیوتری هم میکنم باید برای خودم دلیل قانع کننده ای داشته باشم. معمولا در یک مدت مشخص مثلا یک ماه یک هدف کلی‌ای دارم که قاعدتا به چندتا هدف کوچک تقسیم میشه. اما&#8230; اما منی که به خیال خودم اینقدر هدفمندم، چطوری میخوام برای آیندگان تاثیرگذار باشم؟ </p>\n\n\n\n<p>اصلا آیندگان مال آیندگان، برای نسل خودم چه تاثیری دارم؟</p>\n\n\n\n<p> هدفم از زندگی چیه؟ آیا اون هدف کلی ماهیانم، هدف کوچکی از هدف کل زندگیمه؟</p>\n\n\n\n<p><br></p>\n","slug":"%d8%ad%db%8c%d9%88%d8%a7%d9%86-%d8%a8%d9%88%d8%af%d9%86-%d8%a8%d8%b3%d9%87","tags":[{"name":"تاثیر روی آیندگان"},{"name":"تاثیر روی جامعه"},{"name":"هدف زندگی"}],"featured_media":null}}]},"site":{"siteMetadata":{"title":"حسام‌ کاوه","subtitle":"با تلاش من و شما جهان بهتر خواهد شد. نوشته هایی در مورد پیشرفت شخصی، کسب و کار و برنامه نویسی"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"635af9ca-1d12-514a-9d50-c070c274a480"}}