{"data":{"wordpressCategory":{"id":"2060d515-a7d7-54eb-91f0-dc58dc6693dc","name":"برنامه نویسی","description":"مطالب مرتبط با برنامه نویسی"},"allWordpressPost":{"edges":[{"node":{"title":"دانلود فولدر خاص از ریپوزیتوری گیت هاب","excerpt":"<p>بعضی ریپوزیتوری ها خیلی حجیم هستند ولی فقط دایرکتوری خاصی از اونو لازم داریم. مثلا من پوشه examples از ریپوزیتوری gatsby را لازم داشتم. ابتدا زدم کل ریپوزیتوری دانلود شه. صبر کردم و صبر کردم&#8230; 866 مگابایت ناقابل دانلود شد:( اما خب چه کاری بود! داکیومنت ها و کلی اضافات دیگه همراه فایل ها بود &hellip; <a href=\"https://backend.hesamkaveh.com/%d8%af%d8%a7%d9%86%d9%84%d9%88%d8%af-%d9%81%d9%88%d9%84%d8%af%d8%b1-%d8%ae%d8%a7%d8%b5-%d8%a7%d8%b2-%d8%b1%db%8c%d9%be%d9%88%d8%b2%db%8c%d8%aa%d9%88%d8%b1%db%8c-%da%af%db%8c%d8%aa-%d9%87%d8%a7%d8%a8/\" class=\"more-link\">ادامه خواندن <span class=\"screen-reader-text\">دانلود فولدر خاص از ریپوزیتوری گیت هاب</span></a></p>\n","content":"\n<p>بعضی ریپوزیتوری ها خیلی حجیم هستند ولی فقط دایرکتوری خاصی از اونو لازم داریم.</p>\n\n\n\n<p>مثلا من پوشه examples از ریپوزیتوری <a rel=\"noreferrer noopener\" aria-label=\"gatsby (opens in a new tab)\" href=\"https://github.com/gatsbyjs/gatsby\" target=\"_blank\">gatsby</a> را لازم داشتم. ابتدا زدم کل ریپوزیتوری دانلود شه. صبر کردم و صبر کردم&#8230; 866 مگابایت ناقابل دانلود شد:(</p>\n\n\n\n<p>اما خب چه کاری بود! داکیومنت ها و کلی اضافات دیگه همراه فایل ها بود که اصلا به کارم نمیومد.</p>\n\n\n\n<p>سرچ کردم که چطوری یک دایرکتوری خاص از ریپازیتوری را دانلود کنم. چند تا راه پیدا کردم که دو تاش از بقیه بهتر بود. منم جفتشو معرفی میکنم، اولی روش پرسرعت تره ولی در عوض دومی روش دم دست تریه.</p>\n\n\n\n<!--more-->\n\n\n\n<h2>روش اول &#8211; استفاده از Subversion<br></h2>\n\n\n\n<p>Subversion یا svn یک ورژن کنترلر شبیه به git است که دیگه کمتر ازش استفاده میشه. اگه این ابزار روی کامپیوترتون نصب هست حتما از این روش استفاده کنید. روی manjaro بصورت پیشفرض نصب بود ولی در اوبونتو به سادگی از طریق مخازن میتونین نصبش کنید:</p>\n\n\n\n<pre class=\"wp-block-code\"><code>sudo apt install subversion</code></pre>\n\n\n\n<p>برای تست اینکه درست نصب شده یا نه در ترمینال دستور svn را بنویسید.</p>\n\n\n\n<h3>مرحله ۱ &#8211; کپی کردن لینک ریپازیتوری<br></h3>\n\n\n\n<p>لینک ریپازیتوری مورد نظر را کپی کنید، بطور مثال:</p>\n\n\n\n<pre class=\"wp-block-code\"><code>https://github.com/hesamkaveh/Sansi</code></pre>\n\n\n\n<h3>مرحله ۲ &#8211; اصلاح لینک</h3>\n\n\n\n<p>و بر فرض اگر دایرکتوری src/components از برنچ master را لازم دارید، آدرستون رو به شکل زیر تغییر بدین:</p>\n\n\n\n<pre class=\"wp-block-code\"><code>https://github.com/hesamkaveh/Sansi/trunk/src/components</code></pre>\n\n\n\n<p>trunk به این معناست که به master اشاره داریم.</p>\n\n\n\n<p>یا اگر به برنچ دیگری مثل foo اشاره دارید کافیه به جای trunk بنویسید branches/foo</p>\n\n\n\n<h3>مرحله ۳ &#8211; دانلود ریپازیتوری<br></h3>\n\n\n\n<p>و نهایتا برای دانلود این دایرکتوری کافیه دستور زیر را بزنین:</p>\n\n\n\n<pre class=\"wp-block-code\"><code>svn export YOUTLINK</code></pre>\n\n\n\n<p>فراموش نکنید YOUTLINK را با لینک اصلاح شده در مرحله قبل جایگزین کنین.<br></p>\n\n\n\n<hr class=\"wp-block-separator\"/>\n\n\n\n<h2>روش دوم &#8211; استفاده از git</h2>\n\n\n\n<p>این روش دم دست تریه چون git رو هر کامپیوتری نصبه و مام قراره از دستور git استفاده کنیم. ولی سرعتش کمتر از روش قبله. </p>\n\n\n\n<h3>مرحله ۱ و ۲</h3>\n\n\n\n<p>مشابه روش اول</p>\n\n\n\n<h3>مرحله ۳ &#8211; آماده سازی برای دانلود:</h3>\n\n\n\n<p style=\"text-align:right\">دستور زیر را در ترمینال وارد کنین:</p>\n\n\n\n<pre class=\"wp-block-code\"><code>git svn init YOUTLINK</code></pre>\n\n\n\n<p>همونطوری که میبینین تو این دستور هم یک جورایی از svn کمک گرفتیم. </p>\n\n\n\n<p>فراموش نکنید YOUTLINK را با لینک اصلاح شده در مرحله قبل جایگزین کنید.</p>\n\n\n\n<h3>مرحله ۴ &#8211; دانلود ریپازیتوری</h3>\n\n\n\n<p>دستور زیر را وارد کنین:</p>\n\n\n\n<pre class=\"wp-block-code\"><code>git svn fetch</code></pre>\n\n\n\n<p></p>\n\n\n\n<p>پ.ن:</p>\n\n\n\n<p>دلیل اینکه سرعت متفاوته، اینه که روش اول فقط آخرین نسخه از فایل را دانلود میکنه، در صورتی که روش دوم کل commit ها را دانلود میکند. </p>\n\n\n\n<p>پس روش دوم یجورایی میشه clone کردن کاستوم دایرکتوری درحالی که روش اول دانلود کردن کاستوم دایرکتوری محسوب میشه.</p>\n","slug":"%d8%af%d8%a7%d9%86%d9%84%d9%88%d8%af-%d9%81%d9%88%d9%84%d8%af%d8%b1-%d8%ae%d8%a7%d8%b5-%d8%a7%d8%b2-%d8%b1%db%8c%d9%be%d9%88%d8%b2%db%8c%d8%aa%d9%88%d8%b1%db%8c-%da%af%db%8c%d8%aa-%d9%87%d8%a7%d8%a8","categories":[{"name":"برنامه نویسی","description":"مطالب مرتبط با برنامه نویسی","id":"2060d515-a7d7-54eb-91f0-dc58dc6693dc"}],"featured_media":null}},{"node":{"title":"از ReactJS تا GatsbyJS ـ تجربیات من از دنیای ReactJS","excerpt":"<p>مدت زیادی نیست که می‌نویسم. به سبک خودم می‌‌نویسم و مطالبیو مینویسم که لااقل برای خودم خاص هستن و باهاشون حال می‌کنم:) قالب این سایت اسمش هست Sansi که در گیت هاب منتشرش کردم و میتوانید ازش استفاده کنید. میخوام فرآیندی که طراحی این سایت داشته و تکنولوژی هایی که پشت سر گذرونده رو بهتون &hellip; <a href=\"https://backend.hesamkaveh.com/%d8%a7%d8%b2-reactjs-%d8%aa%d8%a7-gatsbyjs-%d9%80-%d8%aa%d8%ac%d8%b1%d8%a8%db%8c%d8%a7%d8%aa-%d9%85%d9%86-%d8%a7%d8%b2-%d8%af%d9%86%db%8c%d8%a7%db%8c-reactjs/\" class=\"more-link\">ادامه خواندن <span class=\"screen-reader-text\">از ReactJS تا GatsbyJS ـ تجربیات من از دنیای ReactJS</span></a></p>\n","content":"<p>مدت زیادی نیست که می‌نویسم. به سبک خودم می‌‌نویسم و مطالبیو مینویسم که لااقل برای خودم خاص هستن و باهاشون حال می‌کنم:) قالب این سایت اسمش هست <a href=\"https://github.com/hesamkaveh/Sansi\" target=\"_blank\" rel=\"noopener\">Sansi</a> که در گیت هاب منتشرش کردم و میتوانید ازش استفاده کنید. میخوام فرآیندی که طراحی این سایت داشته و تکنولوژی هایی که پشت سر گذرونده رو بهتون بگم.</p>\n<h2><a href=\"https://reactjs.org/\" target=\"_blank\" rel=\"noopener\">ReactJS</a></h2>\n<p>دوست داشتم وبلاگم خاص باشه و در عین حال تجربه جدیدی برای من داشته باشه. بجای اینکه بخوام وبلاگو با وردپرس یا یک CMS دیگه بالا بیارم ترجیه دادم خودم یچی بنویسم. قصد داشتم ReactJS یاد بگیرم و خب حالا یک پروژه داشتم برای تمرین. پس تصمیم گرفتم UI وبلاگمو با ReactJS بزنم و تنها برای بک اند از وردپرس استفاده کنم.</p>\n<p><!--more--> یکم ابتدایی تر از همین وبسایتی که می‌بینید رو با reactjs+wordpres بالا آوردم ولی مشکلی که خوردم SEO سایت بود که در حالت پیشفرض برای موتور های جست و جو محتوای سایتم قابل خواندن نبود. چون تکنولوژی وبسایت CSR(Client Side Rendering) بود و درواقع همه چیز با js در سیستم کلاینت ساخته میشد و بخاطر همین Page Source(با inspect element اشتباه نگیرید) ویسایت خالی از هرگونه محتوا بود و برای گوگل خواندنش ناممکن بود. پس دو راه داشتم. یا مشکل رو حل کنم یا از فورکی از ReactJS استفاده کنم که این مشکلاتو نداشته باشه. متاسفانه اون‌زمان نتونستم مشکلو حل کنم پس تصمیم گرفتم یک بار دیگه سایت رو بنویسم با یه تکنولوژی دیگه. راستی اگه این مشکلو دارین میتونین <a href=\"https://virgool.io/JavaScript8/%D8%A7%D8%B2-reactjs-%D8%AA%D8%A7-%DA%AF%D9%88%DA%AF%D9%84-qjun39ruvoeq\">مطلب نیما</a> رو بخونید.</p>\n<h2><a href=\"https://nextjs.org/\" target=\"_blank\" rel=\"noopener\">NextJS</a></h2>\n<p>بله! رفتم سراغ این تکنولوژی. NextJS بر پایه Reactjs نوشته شده و تقریبا خیلی شبیهن. اصلی ترین تفاوتشون برای من SSR(Server Side Rendering) بودن NextJS بود که خیلی هم راضی بودم ازش:) یک تست کوچیک کردم و دیدم جواب میده و page source دارم بنابراین یک بار دیگه فرانت‌اند سایتو نوشتم منتهی اینبار با NextJS. بسیار هم عالی بود منتهی بعد اینکه بازطراحی تموم شد تازه متوجه شدم که ای بابا، قسمتایی از سایت که قراره به بک اند وصل شه و با کوئری به بک‌اند آپدیت شه(مثل محتوای پست ها) توی سورس نمایش داده نمیشه! منطقی بود! چون موقع پیج باز کردن، قسمت هایی از سایت باز میشد(همونایی که تو سورس سایت بود) بعد کلاینت به سرور کوئری میزد و محتوا رو پر میکرد. برای کوئری از axios استفاده میکردم و مشکل دقیقا همون قسمت بود. چون بصورت CSR کار میکرد ولی من SSR نیاز داشتم. دو تا راه داشتم. یا مشکلو حل کنم یا تکنولوژی رو عوض کنم! راجع به GastbyJS زیاد تعریف شنیده بودم پس تصمیم گرفتم اینبار با GasbyJS سایتو بازطراحی کنم!</p>\n<h2><a href=\"https://www.gatsbyjs.org/\" target=\"_blank\" rel=\"noopener\">GatsbyJS</a></h2>\n<p>بذارید اول GatsbyJS رو معرفی کنم! GatsbyJS بر پایه ReactJS نوشته شده با این تفاوت که سایت های استاتیک میسازه. مزیت اصلیش سرعت بالای بارگزاری سایت و درعین حال فشار بسیار کم روی سروره. سایت استاتیک دیگه دیتابیس نداره و اطلاعاتش تو صفحات html ذخیره میشه. البته با gatsby سایتتونو استاتیک نمینویسید، gatsby تبدیل میکنه به استاتیک. یعنی چی؟ GatsbyJS یک SSG(Server Side Generation) حساب میشه و موقع build گرفتن از برنامه، به بک اند وصل میشه و کوئری میگیره و با توجه به داده ها صفحات استاتیک می‌سازه. بذارید با مثال توضیح بدم. همین وبلاگی که می‌بینید برای بک اند از وردپرس استفاده میکنه و برای فرانت‌اند از Gatsby. پس شما دارید صفحات استاتیک می‌بینید! وقتی من از فرانت‌اند سایت build میگیرم وصل میشه به بک‌اند و پست ها، کتگوری ها و تگ هارو می‌گیره و با توجه به کدی که نوشتم چند تا فایل html و js تحویل میده و کافیه من بارگزاریش کنم روی سرور تا سایت آپدیت شه.</p>\n<p>چند تا سوال ممکنه پیش میاد:</p>\n<h4>اگه پست جدید بخوام بگذارم چطوری میشه؟</h4>\n<p>خب فرض کنید پست جدید در وردپرس ارسال کردم. اما تو سایت نمایش داده نمیشه. چون آخرین build ای که از سایت گرفتم مال قبل از این پست بوده. حالا باید مجدد از سایت build بگیرم تا با توجه به اطلاعات جدید سایت ساخته شه.</p>\n<h4>پس حتی برای هر کامنت باید دوباره سایت build گرفته شه؟!</h4>\n<p>مطمئنا نه! میتونست اینطور باشه ولی راهی که من انتخاب کردم قسمت کامنت سایت رو با axios طراحی کردم و بصورت CSR کار میکنه. پس بعد از اینکه پست توسط کلاینت لود شد کوئری زده میشه به سرور و کامنت های سایت لود میشن.</p>\n<h4>چرا gatsby؟</h4>\n<ul>\n<li>سرعت! فراموش نکنید سایت های استاتیک به مراتب سرعت بالاتری از سایت های داینامیک دارن.</li>\n<li>پرفورمنس! وقتی سایت داینامیکی رو لود میکنید چندین پروسه باید گذرونده شه تا سایت برای کاربر نمایش داده شه یا اصطلاحا لود شه. بدترین و پرفشارترین پروسه، کوئری به دیتابیس و گرفتن اطلاعات صفحست. این مورد در gatsbyjs فقط موقع build گرفتن از برنامه صورت میگیره. پس فشار به سرور خیلی خیلی کاهش پیدا میکنه.</li>\n</ul>\n<h2>جمع بندی</h2>\n<p>GatsbyJS و NextJS جفتشون بر پایه ReactJS هستن و خیلی مشابهن بهش. درواقع اگه ReactJS کار کرده باشید به راحتی میتونید از NextJS یا GatsbyJS استفاده کنید. فرق اصلیشون چیه؟ تو اینا:</p>\n<p>ریکت CSR هست. درواقع سایت سمت کلاینت رندر میشه و وقتی از پیج سورس بگیرید فقط یک تگ توش میبینید که هیچ محتوایی نداره. و محتوا توسط js در سیستم کاربر ساخته میشه. این بصورت پیشفرض برای موتور های جست و جو قابل دسترس نیست.</p>\n<p>نکست SSR هست. یعنی صفحات در سمت سرور ساخته میشه و به کاربر فرستاده میشه. این محتوا برای گوگل قابل دسترسه منتهی اگه قرار باشه کوئری زده شه به بک اند و محتوا از اونجا خوانده شه(یعنی سایت داینامیک باشه) اون محتوا با توجه به طرز کوئری زدنتون SSR یا CSR میشه. برای من CSR بود چون کدی که برای کوئری زده بودم CSR بود.</p>\n<p>گتس‌بای SSG هست. یعنی از محتوای داینامیک، سایت استاتیک می‌سازه. این اتفاق زمان build برنامه میوفته. یسری مزایا داره یسری معایب ولی در کل چیز خاص و جالبیه. یکم مشکل بود بازطراحی این سایت با گتس‌بای منتهی کم کم داره تکمیل میشه و اگه میخواید تو طراحی کمک کنید یا از این قالب استفاده کنید میتونید به <a href=\"https://github.com/hesamkaveh/Sansi\" target=\"_blank\" rel=\"noopener\">گیت هاب پروژه که اسمشو گذاشتم Sansi</a> سر بزنید. شاید فکر کنید خیلی سخته هر بار build گرفته شه از سایت، در جواب میگم این تکنولوژی اولا برای هر سایتی مناسب نیست و دوما میشه اتوماسیون کرد تا با هربار آپدیت بک اند، از سایت ‌build گرفته شه و روی سرور بارگزاری شه.</p>\n<h3>نتیجه اخلاقی</h3>\n<p>من با هرکدوم از این تکنولوژی ها می‌تونستم این سایتو بدون نقص طراحی کنم. منتهی زیاد برای رفع مشکلاتی که برخوردم وقت نذاشتم و همین باعث شد تکنولوژی های متفاوتی رو امتحان کنم. من عقیده دارم هرکی هرجوری راحته می‌تونه یاد بگیره و حتی معتقدم یادگیری اولیه بهتره سطحی باشه و بعدا با یک دید و درک خوبی عمیق شیم رو زمینه موردعلاقمون:)</p>\n","slug":"%d8%a7%d8%b2-reactjs-%d8%aa%d8%a7-gatsbyjs-%d9%80-%d8%aa%d8%ac%d8%b1%d8%a8%db%8c%d8%a7%d8%aa-%d9%85%d9%86-%d8%a7%d8%b2-%d8%af%d9%86%db%8c%d8%a7%db%8c-reactjs","categories":[{"name":"برنامه نویسی","description":"مطالب مرتبط با برنامه نویسی","id":"2060d515-a7d7-54eb-91f0-dc58dc6693dc"}],"featured_media":{"alt_text":"","localFile":{"childImageSharp":{"fluid":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAALABQDASIAAhEBAxEB/8QAFwABAQEBAAAAAAAAAAAAAAAAAAMBBf/EABUBAQEAAAAAAAAAAAAAAAAAAAAB/9oADAMBAAIQAxAAAAHkUmTAv//EABcQAQADAAAAAAAAAAAAAAAAAAEAAiD/2gAIAQEAAQUClgM//8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAwEBPwE//8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAgEBPwE//8QAFhAAAwAAAAAAAAAAAAAAAAAAACAh/9oACAEBAAY/AiL/AP/EABkQAAIDAQAAAAAAAAAAAAAAAAABEBFxkf/aAAgBAQABPyEVKCdF5yP/2gAMAwEAAgADAAAAEDvP/8QAFhEBAQEAAAAAAAAAAAAAAAAAAREQ/9oACAEDAQE/EEbTP//EABYRAQEBAAAAAAAAAAAAAAAAAAEQEf/aAAgBAgEBPxATJ//EABsQAQACAgMAAAAAAAAAAAAAAAEAETFhEIGh/9oACAEBAAE/EAtBa3LUWu+EwrsGDMeEcz//2Q==","aspectRatio":1.7766497461928934,"src":"/static/a4465f18443665ed6339ee318cabfc08/13e10/love-reactjs.jpg","srcSet":"/static/a4465f18443665ed6339ee318cabfc08/60a63/love-reactjs.jpg 188w,\n/static/a4465f18443665ed6339ee318cabfc08/4cd1e/love-reactjs.jpg 375w,\n/static/a4465f18443665ed6339ee318cabfc08/13e10/love-reactjs.jpg 700w","sizes":"(max-width: 700px) 100vw, 700px"}}},"media_details":{"width":700,"height":394,"file":"2018/11/love-reactjs.jpeg"}}}},{"node":{"title":"معرفی سرویس هایی که به دانشجویان خدمات خاص میدهند","excerpt":"<p>بعضی سایت ها و شرکت ها خدمات رایگان یا ویژه برای دانشجویان درنظر می‌گیرند و خداروشکر ما ایرانیا هم میتوانیم از این خدمات بهره ببریم. گیت هاب لیستی از سرویس هایی که آفر های خاص برای دانشجویان دارند را اینجا گذاشته و جالب اینکه میتونید با یک بار تایید هویت دانشجو بودنتون به این خدمات &hellip; <a href=\"https://backend.hesamkaveh.com/%d9%85%d8%b9%d8%b1%d9%81%db%8c-%d8%b3%d8%b1%d9%88%db%8c%d8%b3-%d9%87%d8%a7%db%8c%db%8c-%da%a9%d9%87-%d8%a8%d9%87-%d8%af%d8%a7%d9%86%d8%b4%d8%ac%d9%88%db%8c%d8%a7%d9%86-%d8%ae%d8%af%d9%85%d8%a7%d8%aa/\" class=\"more-link\">ادامه خواندن <span class=\"screen-reader-text\">معرفی سرویس هایی که به دانشجویان خدمات خاص میدهند</span></a></p>\n","content":"<p>بعضی سایت ها و شرکت ها خدمات رایگان یا ویژه برای دانشجویان درنظر می‌گیرند و خداروشکر ما ایرانیا هم میتوانیم از این خدمات بهره ببریم.</p>\n<p>گیت هاب لیستی از سرویس هایی که آفر های خاص برای دانشجویان دارند را <a href=\"https://education.github.com/pack/\" target=\"_blank\" rel=\"noopener noreferrer\">اینجا</a> گذاشته و جالب اینکه میتونید با یک بار تایید هویت دانشجو بودنتون به این خدمات دسترسی داشته باشید. برای اینکار کارت دانشجویی‌تونو بفرستید به گیت هاب و پس از نهایتا ۱ هفته ایمیلی مبنی بر تایید دانشجو بودنتون میاد و گیت هابتون pro میشه. اگرم میخواهید از سرویس های معرفی شده توسط گیت‌هاب استفاده کنید دیگه نیازی نیست مجددا تایید هویت شوید بلکه اینکارو گیت هاب براتون می‌کنه و خیلی فوری میتونید به خدمات ویژه دسترسی پیدا کنید. البته بعضیاشون نیازه تا تو سایتشون ثبت‌نام کنید بعضیاشونم گیت هاب اینکارو واستون انجام می‌ده.</p>\n<p>سرویس های زیادی هستند که به دانشجویان خدمات رایگان ارائه میدن. در زیر به معرفی اجمالی بعضی سرویس ها و مزایایی که برای دانشجویان دارند میپردازم:<!--more--></p>\n<h3><a href=\"https://github.com/\" target=\"_blank\" rel=\"noopener noreferrer\">GItHub</a></h3>\n<p><img class=\"size-medium wp-image-95 alignnone\" src=\"https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/Github-1-300x100.jpg?resize=300%2C100&#038;ssl=1\" alt=\"\" width=\"300\" height=\"100\" srcset=\"https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/Github-1.jpg?resize=300%2C100&amp;ssl=1 300w, https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/Github-1.jpg?w=600&amp;ssl=1 600w\" sizes=\"(max-width: 300px) 100vw, 300px\" data-recalc-dims=\"1\" /></p>\n<p>خود گیت هاب اجازه میده تا وقتی که تحصیل میکنید بتوانید بینهایت ریپوزیتوری پرایویت بسازید.</p>\n<hr />\n<h3><a href=\"https://www.algolia.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Algolia</a></h3>\n<p><img class=\"size-medium wp-image-97 alignnone\" src=\"https://i2.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/Algolia-300x75.png?resize=300%2C75&#038;ssl=1\" alt=\"\" width=\"300\" height=\"75\" srcset=\"https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/Algolia.png?resize=300%2C75&amp;ssl=1 300w, https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/Algolia.png?resize=768%2C191&amp;ssl=1 768w, https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/Algolia.png?w=805&amp;ssl=1 805w\" sizes=\"(max-width: 300px) 100vw, 300px\" data-recalc-dims=\"1\" /></p>\n<p>یه سرویسه که دیتاتونو بهش میدید و api در اختیارتون میذاره تا بتوانید با سرعت خیلی زیاد داخل اون سرچ کنید.</p>\n<p>شخصا با این سرویس کار نکردم ولی سرچ بعضی پلتفرم ها مثل twich با همین پیاده سازی شده. البته تستی که کردم سرعتش محشر بود!</p>\n<hr />\n<h3><a href=\"https://aws.amazon.com/\" target=\"_blank\" rel=\"noopener noreferrer\">AWS(Amazon Web Services)</a></h3>\n<p><img class=\"size-medium wp-image-98 alignnone\" src=\"https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/aws-300x100.jpg?resize=300%2C100&#038;ssl=1\" alt=\"\" width=\"300\" height=\"100\" srcset=\"https://i2.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/aws.jpg?resize=300%2C100&amp;ssl=1 300w, https://i2.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/aws.jpg?w=600&amp;ssl=1 600w\" sizes=\"(max-width: 300px) 100vw, 300px\" data-recalc-dims=\"1\" /></p>\n<p>aws کلود آمازونه که فضا و منابع در اختیارتون میذاره تا سایتتونو بالا بیارید، دیتابیس بسازید یا هرکار دیگه ای که با سرور میشه انجام داد.</p>\n<p>110$ خدمات رایگان به دانشجو هایی که از گیت هاب معرفی شدن میده، منتهی برای ثبت‌نام نیازه ایمیل دانشگاهی داشته باشید. اگر credit card هم داشته باشید مجموعا 150$ میده.</p>\n<hr />\n<h3><a href=\"https://www.digitalocean.com/\" target=\"_blank\" rel=\"noopener noreferrer\">DigitalOcean</a></h3>\n<p><img class=\"size-medium wp-image-99 alignnone\" src=\"https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/digitalocean-300x100.jpg?resize=300%2C100&#038;ssl=1\" alt=\"\" width=\"300\" height=\"100\" srcset=\"https://i1.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/digitalocean.jpg?resize=300%2C100&amp;ssl=1 300w, https://i1.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/digitalocean.jpg?w=600&amp;ssl=1 600w\" sizes=\"(max-width: 300px) 100vw, 300px\" data-recalc-dims=\"1\" /></p>\n<p>اینم یه سرویس کلوده که اخیرا زیاد اسمشو می‌بینیم. قیمت به نسبت بهتری نسبت به آمازون داره و دسترسی های بیشتری هم بهتون می‌ده. اگر دانشجو هستید میتوانید 50$ اعتبار بگیرید. منتهی برای ثبت‌نام credit card نیازه.</p>\n<hr />\n<h3><a href=\"https://app.bitnamihosting.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Bitnami</a></h3>\n<p><img class=\"size-medium wp-image-100 alignnone\" src=\"https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/bitnami-300x100.jpg?resize=300%2C100&#038;ssl=1\" alt=\"\" width=\"300\" height=\"100\" srcset=\"https://i2.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/bitnami.jpg?resize=300%2C100&amp;ssl=1 300w, https://i2.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/bitnami.jpg?w=600&amp;ssl=1 600w\" sizes=\"(max-width: 300px) 100vw, 300px\" data-recalc-dims=\"1\" /></p>\n<p>یک application installer هست و ایمیجی برای اپلیکیشن ها(روی پلتفرم های مختلف) در اختیارتون میذاره تا بتوانید اپ مورد نظرتونو با یک next next ساده نصب کنید. تا اینجاش برا همه رایگانه ولی چیزی که در اختیار دانشجوها میذاره مربوط به قسمت کلود و مدیریت سروره که به مثلا AWS وصلش می‌کنید و میتوانید سرور بسازید و مدیریتش کنید. مثلا انتخاب میکنید ngnix+wordpress لازم دارید و میخواهید سرورتون debian9 باشه، میاد و تو AWS همچین سروری واستون میسازه و علاوه بر کانفیگ خوبی که انجام میده، یک سری ابزار برای مدیریت سرور در اخنیارتون میذاره. مثل بک آپ و مانیتورینگ.</p>\n<hr />\n<h3><a href=\"https://www.gitkraken.com/github-student-developer-pack\" target=\"_blank\" rel=\"noopener noreferrer\">GitKraken</a></h3>\n<p><img class=\"size-medium wp-image-101 alignnone\" src=\"https://i1.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/GitKraken-300x100.jpg?resize=300%2C100&#038;ssl=1\" alt=\"\" width=\"300\" height=\"100\" srcset=\"https://i1.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/GitKraken.jpg?resize=300%2C100&amp;ssl=1 300w, https://i1.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/GitKraken.jpg?w=600&amp;ssl=1 600w\" sizes=\"(max-width: 300px) 100vw, 300px\" data-recalc-dims=\"1\" /></p>\n<p>اپلیکیشنی گرافیکی برای مدیریت گیته. یادمه وقتی دستورات کامندلاین گیت‌ رو بلد نبودم از این نرم افزار استفاده می‌کردم. نرم افزار کاملی بود و با گرافیک جالب‌انگیزش باعث شد راحتتر مفاهیم git را یاد بگیرم. به‌نظرم استفاده از چنین نرم افزارهایی به خصوص برا شروع یادگیری خیلی کمک کننده میتونه باشه.</p>\n<p>و البته یه قسمتی هم داره به اسم Glo Boards که به نوعی Issue tracker یا task tracker محسوب میشه.</p>\n<p>۱ سال اشتراک رایگان به ارزش 49$ در اختیارتون میذاره.</p>\n<hr />\n<h3><a href=\"https://www.heroku.com/home\" target=\"_blank\" rel=\"noopener noreferrer\">Heroku</a></h3>\n<p><img class=\"size-medium wp-image-102 alignnone\" src=\"https://i2.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/Heroku-300x127.png?resize=300%2C127&#038;ssl=1\" alt=\"\" width=\"300\" height=\"127\" srcset=\"https://i1.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/Heroku.png?resize=300%2C127&amp;ssl=1 300w, https://i1.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/Heroku.png?w=474&amp;ssl=1 474w\" sizes=\"(max-width: 300px) 100vw, 300px\" data-recalc-dims=\"1\" /></p>\n<p>میتونید اپ هاتونو روی این پلتفرم دیپلوی و استفاده کنید. از زبان ها و فریمورک های زیادی هم پشتیبانی می‌کنه. در کل ایده جالبیه و پرفورمنس خوبی داره، منتهی ترجیه من اینه که روی سرور خودم دیپلوی کنم. مشکل اصلی ای که با این سرویس دارم اینه که پلنی که بهمون میده بعد یک تایمی پروسسش استاپ میشه و برناممونو باید مجدد ران کنیم:(</p>\n<hr />\n<h3><a href=\"https://www.jetbrains.com/student/?authMethod=github\" target=\"_blank\" rel=\"noopener noreferrer\">Jetbrains</a></h3>\n<p><img class=\"size-medium wp-image-103 alignnone\" src=\"https://i1.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/jetbrains-300x100.png?resize=300%2C100&#038;ssl=1\" alt=\"\" width=\"300\" height=\"100\" srcset=\"https://i1.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/jetbrains.png?resize=300%2C100&amp;ssl=1 300w, https://i1.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/jetbrains.png?w=600&amp;ssl=1 600w\" sizes=\"(max-width: 300px) 100vw, 300px\" data-recalc-dims=\"1\" /></p>\n<p>IDE های مختلفی بیرون داده مثل pycharm برای پایتون، webstorm برای html/css/js و phpstorm برای php. من از محصولاتش استفاده میکنم و قبولشون دارم. موافق با این ایده ام که هر زبان IDE خودشو داشته باشه. اینطوری امکانات حرفه ای تری میشه تو نرم افزار گذاشت با این حال نرم‌افزار بیخودی سنگین نمیشه.</p>\n<hr />\n<h3><a href=\"https://www.namecheap.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Namecheap</a></h3>\n<p><img class=\"size-medium wp-image-104 alignnone\" src=\"https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/nameCheap-300x100.jpg?resize=300%2C100&#038;ssl=1\" alt=\"\" width=\"300\" height=\"100\" srcset=\"https://i2.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/nameCheap.jpg?resize=300%2C100&amp;ssl=1 300w, https://i2.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/nameCheap.jpg?w=600&amp;ssl=1 600w\" sizes=\"(max-width: 300px) 100vw, 300px\" data-recalc-dims=\"1\" /></p>\n<p>ازینجا میتوانید ۱سال دامین .me و یک سال ssl به رایگان دریافت کنید!</p>\n<hr />\n<h3><a href=\"https://www.thinkful.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Thinkful</a></h3>\n<p><img class=\"size-medium wp-image-105 alignnone\" src=\"https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/Thinkful-300x100.jpg?resize=300%2C100&#038;ssl=1\" alt=\"\" width=\"300\" height=\"100\" srcset=\"https://i2.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/Thinkful.jpg?resize=300%2C100&amp;ssl=1 300w, https://i2.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/Thinkful.jpg?w=600&amp;ssl=1 600w\" sizes=\"(max-width: 300px) 100vw, 300px\" data-recalc-dims=\"1\" /></p>\n<p>یک سایت آموزشیه برای برنامه نویسی( دوره های وب و دیتاساینس ) و یک فرقی که با بقیه جاها داره اینه که پشتیبان در اختیارتون می‌گذاره تا اگر سوالی پیش اومد ازش بپرسید. نمیدونم کیفیت دوره هاش چطوره ولی ایده جالب و کاربردی ای داره.</p>\n<hr />\n<h3><a href=\"https://www.transifex.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Transifex</a></h3>\n<p><img class=\"size-medium wp-image-106 alignnone\" src=\"https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/Transifex-300x100.jpg?resize=300%2C100&#038;ssl=1\" alt=\"\" width=\"300\" height=\"100\" srcset=\"https://i2.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/Transifex.jpg?resize=300%2C100&amp;ssl=1 300w, https://i2.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/Transifex.jpg?w=600&amp;ssl=1 600w\" sizes=\"(max-width: 300px) 100vw, 300px\" data-recalc-dims=\"1\" /></p>\n<p>این سرویس برای اینه که سایتتونو به چند زبان ترجمه کنید و با توجه به موقعیت مکانی بازدیدکننده، به زبان اون منطقه نمایش بدید.</p>\n<hr />\n<h3><a href=\"https://travis-ci.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Travis CI</a></h3>\n<p><img class=\"size-medium wp-image-107 alignnone\" src=\"https://i2.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/Travis-CI-300x100.jpg?resize=300%2C100&#038;ssl=1\" alt=\"\" width=\"300\" height=\"100\" srcset=\"https://i2.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/Travis-CI.jpg?resize=300%2C100&amp;ssl=1 300w, https://i2.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/Travis-CI.jpg?w=600&amp;ssl=1 600w\" sizes=\"(max-width: 300px) 100vw, 300px\" data-recalc-dims=\"1\" /></p>\n<p>از جمله نرم افزار های Continuous Integration محسوب میشه و می‌تونید فرآیند های یک نرم افزار مثل کامپایل، تست و دیپلوی رو اتوماتیک کنید. Travis CI ازجمله نرم افزار های DevOps هست و کارهای تکراری و روتین رو براتون انجام میده. به زودی در موردش می‌نویسم:)</p>\n<p>Travis سورس برنامه‌تونو از گیت‌هاب می‌گیره ولی در حالت عادی به private repositories دسترسی ندارید ولی اگر دانشجو باشید تا پایان دانشگاه این دسترسی باز میشه.(ارزش ماهیانه 69$)</p>\n<hr />\n<h3 class=\"LC20lb\"><a href=\"https://www.figure-eight.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Figure Eight</a></h3>\n<p><img class=\"alignnone size-medium wp-image-126\" src=\"https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/crowdflower-300x100.jpg?resize=300%2C100&#038;ssl=1\" alt=\"\" width=\"300\" height=\"100\" srcset=\"https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/crowdflower.jpg?resize=300%2C100&amp;ssl=1 300w, https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/crowdflower.jpg?w=600&amp;ssl=1 600w\" sizes=\"(max-width: 300px) 100vw, 300px\" data-recalc-dims=\"1\" /></p>\n<p>برای پردازش تصویره و برای object detection استفاده میشه. مثلا یک عکس میدید بهش و ماشین های توشو مشخص میکنه. البته ازش استفاده نکردم ولی سرویس جالبی بنظر میاد.</p>\n<p>واقعیت اینه که از بعضی سرویس هایی که معرفی کردم استفاده نداشتم و آفرشون تو گیت‌هاب باعث شد باهاشون آشنا شم:) . اگر سرویس دیگری میشناسید که به دانشجویان آفر خاص میده، در کامنت ها معرفی کنید.</p>\n","slug":"%d9%85%d8%b9%d8%b1%d9%81%db%8c-%d8%b3%d8%b1%d9%88%db%8c%d8%b3-%d9%87%d8%a7%db%8c%db%8c-%da%a9%d9%87-%d8%a8%d9%87-%d8%af%d8%a7%d9%86%d8%b4%d8%ac%d9%88%db%8c%d8%a7%d9%86-%d8%ae%d8%af%d9%85%d8%a7%d8%aa","categories":[{"name":"برنامه نویسی","description":"مطالب مرتبط با برنامه نویسی","id":"2060d515-a7d7-54eb-91f0-dc58dc6693dc"},{"name":"معرفی چیز ها","description":"","id":"3f5f51d0-2c88-5ca4-b49a-6b2a04da0f6c"}],"featured_media":{"alt_text":"","localFile":{"childImageSharp":{"fluid":{"base64":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAOCAIAAACgpqunAAAACXBIWXMAAAsSAAALEgHS3X78AAABnklEQVQoz5WSTUsCURSG/Rm1aRe1KKQvCNoEbVsGRet+QJs2bVrVqlWLoEWUYCLVQqJFUIRNmjOTX1FjZupoKqWOztUZU8f70XUsIsa0Xg6Hc7jvc7mHc02YEGMgTEWoMEaY4LYe6jARg1pYvV5PvxYhIrqzvUwGsmmX40zxdM5rWRQ9e4S8tx7RHSaoQRO4WavZenxbw+xGbzVi11nYBW4NChQt45ivHQ0m9icC25OSc0U/Q11ghJoOjuU9m0PkxBzbHRNsC5J7/R+w6/IssmOGjrE360jWMlC6WPoaGHecWb8+F2U1e59y0C8dTqUto3nbOKy8fa/BCGP8uVkIkRDgKp7V3PFM3jErWqdfz5dRo44/PQYY4zZrgBBqpVQFZDTUcc901EJRBqBEkwzKzRIAqQAkWVWrWrms6IcK9RTlUrVW+wFnc7ng3f1zNBZPJMNPEVrQHI2JQigUaXZx2sTiophICo/hVDqjNRrf8IMQcl4xLH/rDwb9gSDjctN4DD/5/AGO93I8z1y7mWtXMvly4+FYjldUlfz2t/+uD50PCCkBb/8eAAAAAElFTkSuQmCC","aspectRatio":1.4649446494464944,"src":"/static/0e8f12e4b2487b4898bb060b27fc9d5b/5a67f/Github_developer_pack.png","srcSet":"/static/0e8f12e4b2487b4898bb060b27fc9d5b/b1628/Github_developer_pack.png 188w,\n/static/0e8f12e4b2487b4898bb060b27fc9d5b/ae0e1/Github_developer_pack.png 375w,\n/static/0e8f12e4b2487b4898bb060b27fc9d5b/5a67f/Github_developer_pack.png 750w,\n/static/0e8f12e4b2487b4898bb060b27fc9d5b/b6e3c/Github_developer_pack.png 794w","sizes":"(max-width: 750px) 100vw, 750px"}}},"media_details":{"width":794,"height":542,"file":"2018/10/Github_developer_pack.png"}}}},{"node":{"title":"تجربیات یک فریلنسر از ۳ سال حبس شدن در اتاق","excerpt":"<p>شنیدید میگن با هرکی بگردی شبیه به همون می‌شی؟ یا شخصیت آدم میانگین شخصیت های ۵ نفر اطرافشه؟ من سه ساله که تو یک اتاق حبس شدم. تقصیر خودم بودا! انتخابی بود که خودم کردم، خودم کردم که لعنت بر خودم باد. این سه سال بیشتر دوستام مجازی بودن یا نهایتا هر چند روزی یکدومشونو &hellip; <a href=\"https://backend.hesamkaveh.com/freelance-experiences/\" class=\"more-link\">ادامه خواندن <span class=\"screen-reader-text\">تجربیات یک فریلنسر از ۳ سال حبس شدن در اتاق</span></a></p>\n","content":"<p>شنیدید میگن با هرکی بگردی شبیه به همون می‌شی؟ یا شخصیت آدم میانگین شخصیت های ۵ نفر اطرافشه؟ من سه ساله که تو یک اتاق حبس شدم. تقصیر خودم بودا! انتخابی بود که خودم کردم، خودم کردم که لعنت بر خودم باد. این سه سال بیشتر دوستام مجازی بودن یا نهایتا هر چند روزی یکدومشونو میدیدم&#8230;. خب محدودیت داشتم تو خروج از اتاق. البته نه اینکه نگهبانی بالا سرم باشه یا کسی مجبورم کرده باشه تو اتاق بمونما، خودم اینطور میخواستم. آها شخصیتم یجورایی میانگینی شده بود از خودم و کامپیوترم! شاید چون باهاش از هرکسی راحتتر بودم و بیشترین وقتو هم با همین زبون بسته میذاشتم. البته اگه یک اینترنت درست درمون بهش وصل باشه همچینم زبون بسته نیست. این سه سال داشتم سعی میکردم زبون حرف زدن باهاشو بیشتر و بیشتر یاد بگیرم اما هرچی جلوتر می‌رفتم مییدیدم چیزای خیلی بیشتری هست&#8230; انگارکه از هرطرف انتهاش سرابی بیش نیست!<br />\nبعضی وقتا هم با بچه ها کنار هم جمع میشدیم و هرکدوم مینشستیم پشت لپ تاپمون و کارمونو میکردیم. تا حدیش خوب بود و مشکلاتمونو با هم به اشتراک میذاشتیم و بعضا زودتر حل میشد. اما بعضی وقت‌ها خوب نبود. نظر منو بخوای لپ تاپ عین ناموس آدم میمونه. بعضی وقت‌ها میشه اکیپی کنار هم نشست. اما معمولا ترجیه بر اینه که خلوت کنیم و تو سکوت و تمرکز کامل عشق بازی کنیم.<!--more--><br />\nهمه ی اینارو گفتم که فقط یجیزی بهتون بگم. من فریلنسری رو دوست دارم اما هرچیزی حدی داره. دوست ندارم یه خفن کامپیوتری باشم، ولی الان همچین دید رو نسبت به خودم دارم. نه به این معنا که ته کامپیوترو دراوردما، بلکه به این معنا که دور خودمو پر کردم از یک مشت تسک که تک تکشون ارزشمندن برام و انگار هیچوقت تمومی ندارن.</p>\n<h2>فریلنسری، خوب، بد، زشت<strong><br />\n</strong></h2>\n<p>هرچیزی خوبی ها و بدی های خودشو داره. اما <strong>هرچیزی زیادیش بده! هرچیزی!</strong></p>\n<ul>\n<li>تجربه فریلنسری بهم اجازه داد<strong> فقط هرچیزی رو که به کارم میاد و علاقه دارم یاد بگیرم</strong>. اما شاید اگه تو یه شرکت بودم، چیز های متفاوت تری یاد میگرفتم. چیز هایی که گاها دلم نمیخواست ولی خب ضایعه اگه انجامشون ندم یا بلد نباشمشون.</li>\n<li><strong>هم تندتر پیشرفت میکنید هم کندتر.</strong> واقعیتش به نظر قطعی نرسیدم. بعضی چیزا و مشکلات هستن که تو خلوت خودم راحتتر یادشون میگیرم، وقتی یک Road map مشخص داشته باشم، احتمالا تا یک سطحی رو تنهایی راحتتر پیش میرم. اما بعضی مشکلات هستن هم فکری میخوان. از طرفی، یکسری تجربیات هست که بقیه با سعی و خطا بسیار کسب کردن و احتمالا حضوری بهترین روش باشه که در اختیارتون بذارنش.</li>\n<li>یه فریلنسر<strong> وقتش آزاده</strong>. هرموقع که میخواد کار میکنه هر موقع که میخواد کار نمیکنه. هرموقع که میخواد میره مسافرت. ولی این شیوه کار کردن بسیار بسیار <strong>اعتیاد آوره</strong>. اگه موتادش بشید احتمالا انجام تسک هاتونو حتی به خواب شب ترجیه میدید. اگه قراره روزی 8 ساعت بخوابید همون 8 ساعت میخوابیدا، ولی تا وقتی ذهنتون میکشه کار میکنید و همین باعث میشه خوابتون هم به هم بریزه.</li>\n<li><strong>از جامعه دور میشید.</strong> این اصلی ترین مشکل فریلنسریه. من یک آدمی بودم که تنهایی تا سر کوچه هم نمیرفتم، اما الان راحتترم که با کامپیوترم حرف بزنم تا با دوستام!</li>\n<li>سلامتی رو جدی بگیرید. البته فریلنسر ها معمولا بیشتر وقتشونو درحال ورزشن، ورزش از نوع ذهنی. اما<strong> بدنتون بعد یک مدت ضعیف میشه.</strong> سعی کنید برا کارتون خرج کنید. <strong>مهندس کامپیوتر فقط یک لپ تاپ نمیخواد</strong>، بلکه صندلی، میز و مانیتور خیلی خیلی مهمند. حتی عینک کامپیوتر هم برا اینجور افراد ساخته شده&#8230; ما استفاده نکنیم پس کی قراره استفاده کنه؟ بخدا که خیلی تاثیر داره. من بطور میانگین روزانه 15 کیلومتر رکاب میزنم. کمتر ماهی پیش میاد که استخر نرم. با اینحال تا وقتی تجهیزاتمو بروز نکرده بودم کمردرد و گردن درد داشتم.</li>\n</ul>\n<ul>\n<li><strong>فریلنسر ها معمولا راحتتر متمرکز می‌شوند.</strong> درسته که کسی که میتونه تمرکز کنه، در هرجایی میتونه تمرکز کنه. اما به شدت معتقدم که تو خونه راحتتر میتونید تمرکز کنید. <strong>باید تکنیک هاشو بلد باشید</strong> وگرنه میشید یه مولتی تسکر و بین هزاران تسک فکرتون آشفته میشه! مطمئنا <strong>اگه کسی بلد نباشه با چه روشی تمرکز کنه، خب نمیتونه تمرکز کنه!</strong> دیگه فرقی نداره تو شرکت کار کنه یا تو خونه! معمولا برای اینکه کارهام باهم قاطی نشه روی کاغذ کار هایی که باید انجام بدمو مینویسم(ToDo List) و کاری که الان مشغولشم رو هم مشخص میکنم(Current Task).</li>\n</ul>\n<p><img class=\"alignnone wp-image-81 size-full\" src=\"https://i1.wp.com/back.hesamkaveh.com/wp-content/uploads/2018/10/20181004_224344.jpg?resize=660%2C495&#038;ssl=1\" alt=\"\" width=\"660\" height=\"495\" srcset=\"https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/20181004_224344.jpg?w=1080&amp;ssl=1 1080w, https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/20181004_224344.jpg?resize=300%2C225&amp;ssl=1 300w, https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/20181004_224344.jpg?resize=768%2C576&amp;ssl=1 768w, https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/10/20181004_224344.jpg?resize=1024%2C768&amp;ssl=1 1024w\" sizes=\"(max-width: 660px) 100vw, 660px\" data-recalc-dims=\"1\" /></p>\n<h2>چند توصیه برای فریلنسر ها</h2>\n<ul>\n<li>مواظب باشید خوابتون به هم نریزه! جدا ازینکه خواب نامنظم برای بدنتون ضرر داره، باعث میشه کنترل زمانیتونو از دست بدید. <strong>چیزی که به‌نظرم مهمتر از صبح زود بیدار شدنه، خواب منظم داشتنه</strong>. شخصا پر بازده ترین روز هام روز های متوالی ای بوده که صبح زود از خواب بیدار میشدم. تسکی رو که روز های عادی تو 1 ساعت انجام میدادم، در همچین روزهایی زودتر انجامشون میدم.</li>\n<li><strong>ساعت کاری</strong> تعریف کنید. خیلی خیلی مهمه! هم باعث میشه از جامعه دور نشید و به کار های دیگرتون برسید همینکه باعث میشه بازدهتون بالاتر بره و سریع تر تسک هارو انجام بدین. و شاید هزار تا خوبی دیگه!</li>\n<li><strong>اجتماعی باشید</strong>. اگه خوره کامپیوتر باشید احتمالا بهترین نعمت دنیا نصیبتون شده. چون کار و تفریحتون یکیه! یا بهتره بگم کارتون تفریحتونه! ولی از حدش رد نکنید! حداعقل جمعه هارو به خودتون استراحت بدید. باعث میشه هم اجتماعی تر باشید و انسانی تر زندگی کنید و همینکه ذهنتون باز شه و تو ادامه کار بهتر پیش برید! ضمنا! هیچ کس و هیچ شرکتی دوست نداره کارمند یا دوستش یه برنامه نویسی باشه که همش سرش تو کامپیوتره و دیوانه وار درحال کد زدنه!</li>\n<li><strong>ورزش</strong> کنید. هیچ چیز از سلامتی مهمتر نیست. من کارمو دوست دارم پس ترجیه میدم حتی 50 سالگی هم بتونم کد بزنم.</li>\n<li>هر از گاهی <strong>مکانتونو عوض کنید</strong>. من تجربه کافه گردی و کد زنی در کافه رو دارم. تجربه کد زنی تو اتاق در بسته رو هم دارم. گاها روی موبل هم مشغول کار شدم! اما بهترین نوعش میشه ترکیب همه ی اینا با هم. سعی کنید همیشه یک جا نباشید.</li>\n</ul>\n<p>تو زندان ماندن را دوست دارم. البته هرگاه دلم میخواد از معشوقه ام جدا می‌شوم و چند روزی به مسافرت می‌روم. با دوچرخه سفر رفتن رو بیشتر از هر سفر دیگری دوست دارم. چون کمک میکنه ذهنم کمتر درگیر تسک ها باشه. چون کمک میکنه برای مدتی هرچند کوتاه، دور از تکنولوژی باشم. میگن برا جسم و روح آدم خوبه! آها&#8230;.. تو سفر با دوچرخه با ده ها نفر دوست میشم و اینم کمک میکنه رفتار انسانیم حفظ بشه.</p>\n<p>اما&#8230; زندان جای خوبی نیست. کامپیوتر هم به عنوان معشوقه خوب نیست، لااقل نه به عنوان معشوقه اول! پس اگه تصمیم دارید فریلنسر باشید یه فریلنسر باحال باشید. یکی باشید که علاوه بر کامپیوتر و کارش هزار تا دغدغه دیگه هم داشته باشه. یکی که وقتی زندگی نامه‌شو مینویسن کامپیوتر و برنامه نویسی(یا هرکاری که با کامپیوتر میکرده) تنها نقطه قوت زندگیش نیست. چون اصلا همچین چیزی شدنی نیست. اگر تو کارتون موفقید قطعا تو چند بُعد دیگه از زندگیتون هم موفقید، مثل ارتباطتون با خانواده. امکان نداره که برنامه نویس موفقی باشید ولی تو هیچ چیز دیگه ای موفق نباشید.</p>\n","slug":"freelance-experiences","categories":[{"name":"برنامه نویسی","description":"مطالب مرتبط با برنامه نویسی","id":"2060d515-a7d7-54eb-91f0-dc58dc6693dc"},{"name":"جامعه","description":"","id":"5b0c418e-6a28-5cac-9f2f-c09205fd5eef"}],"featured_media":null}},{"node":{"title":"ویندوز یا لینوکس؟ عمیق بیندیشیم","excerpt":"<p>اول از هرچی از روز برنامه نویس بگم چون امروز 22 شهریوره و روز برنامه نویسه! تقریبا به هرکی تبریک گفتم جاخورد ازینکه روز برنامه نویس هم داریم. احتمالا دلیلش اینه که هنوز تو تقویم شمسی ثبت نشده و یادمه داشتند امضا جمع میکردند که ثبت شه(الان که چک میکنم سایتش ساسپند شده! ولی خب &hellip; <a href=\"https://backend.hesamkaveh.com/%d9%88%db%8c%d9%86%d8%af%d9%88%d8%b2-%db%8c%d8%a7-%d9%84%db%8c%d9%86%d9%88%da%a9%d8%b3%d8%9f/\" class=\"more-link\">ادامه خواندن <span class=\"screen-reader-text\">ویندوز یا لینوکس؟ عمیق بیندیشیم</span></a></p>\n","content":"<p>اول از هرچی از <strong>روز برنامه نویس</strong> بگم چون امروز 22 شهریوره و روز برنامه نویسه! تقریبا به هرکی تبریک گفتم جاخورد ازینکه روز برنامه نویس هم داریم. احتمالا دلیلش اینه که هنوز تو تقویم شمسی ثبت نشده و یادمه داشتند امضا جمع میکردند که ثبت شه(الان که چک میکنم سایتش ساسپند شده! ولی خب قبلا من امضامو ثبت کرده بودم). امیدوارم الان که این مطلبو میخونید<a href=\"http://programmerday.ir\" target=\"_blank\" rel=\"nofollow\"> programmerday.ir</a> براتون باز بشه:( . بریم سر اصل مطلب!</p>\n<h2>حق و باطل</h2>\n<p>همه ی داستانای معروف تو یچیز مشترکند، جنگ میان حق و باطلند. ارباب حلقه ها، جنگ ستارگان، رستم و اسفندیار هم ازین قضیه مستثنی نیست. تو دنیای واقعی هم ازین جنگا داریم مثل جنگ بین لینوکسی ها و ویندوزی ها. به شخصه خیلی ازین بحثا خوشم میاد چون جنبه ی خوشگذرونی داره و به نوبه ی خودش فانه. اما واقعیت اینه که اعتقاد دارم جفتنشون خوبن، اما&#8230;. اما برای هر کاری و برای هرکسی یک سیستم عامل خوبه. مثلا یک C# کار هیچوقت لینوکس واسش انتخاب مناسبی نیست یا طرز تفکر یه پایتون کار احتمالا بیشتر با لینوکس سازگاره.</p>\n<p><!--more--></p>\n<h2>ویندوز برای چه کسی مناسبه؟ لینوکس چطور؟</h2>\n<p>خیلی سعی کردم افراد و کار هارو دسته بندی کنم و با توجه به اونا پیشنهاد بدم که چه سیستم عاملی مناسبشونه، اما واقعا سخته. برای مثال اگه شما گیمرید احتمالا ویندوز واستون مناسبه چون دامنه بازی های لینوکسی کمتره. اما بازی هایی که هم ویندوز و هم لینوکس ساپورت میکنن(مثل Dota) تو لینوکس بهتر و روون تر اجرا میشن. دیدید؟ کلی پارامتر هست که حتی یه گیمر بخواد سیستم عاملشو انتخاب کنه. تصمیم گیری اینکه کدوم سیستم عامل واستون مناسبه رو خودتون باید انجام بدید. چند سالیه من کاربر لینوکسم و بذارید تجربیاتمو از ویندوز و لینوکس واستون بگم:</p>\n<h2>تجربیاتم از ویندوز</h2>\n<p>ویندوز واقعا راحت بود. تقریبا با رابط گرافیکیش هر کاری میتونستم کنم.  به سادگی هر برنامه ی پولی ای رو آزادانه(!) از اینترنت دانلود میکردم و کرک میکردم، بعد شورتکات میذاشتم روی دسکتاپ و هر موقع میخواستم اجراش می‌کردم. هر دو سه روز هم سایت‌های دانلود مثل soft98 رو چک میکردم ببینم اگه آپدیت اومده دوباره دانلود کنم. عاشق این بودم که یه آرشیو از نصاب برنامه ها روی هاردم داشته باشم تا ویندوز عوض میکنم راحت باشم. اما واقعیت این بود که همینطور آپدیت میومد و مجددا دانلودشون میکردم.  هر بازی ای که میخواستو دانلود میکردم و دغدغم این بود که چه کرکی رو استفاده کنم تا بتونم اجراش کنم. اون زمانا تنها مشکلی که با ویندوز داشتم ویروس گرفتنش بود وگرنه برای کار های معمول، روتین های خاصی وجود داشت. منم کارم طراحی وب بود و کم و کاستی نمی‌دیدم.</p>\n<h2>چطور لینوکسی شدم؟</h2>\n<p>اسم لینوکسو شنیده بودم و با <a href=\"https://forum.ubuntu.ir/\">اوبونتو فروم</a> آشنا شدم. دیدم چقدر کاربر فعال داره! کنجکاو شدم نصبش کنم و بله! اولین تجربه و اولین شکست&#8230; هاردم فرمت شد. (<i>تو پرانتز بگم که هنوزم خیلیا این مشکلو دارن. انتظار دارن نصب لینوکس مثل ویندوز یه next next ساده باشه. سادست اما به شرطی که گزینه هارو با دقت انتخاب کنی!</i>). چند روزی مشغول ریکاوریشون بودم و دوباره شروع کردم به نصب لینوکس ولی اینبار از روی یه آموزش. انتظار نداشتم رابط گرافیکی لینوکس اینقدر خوشگل باشه( آخه اسم لینوکس یکم خشن بود! ) و واسم جالب بود که میشه حتی شکل و شمایلشو به کل عوض کرد. طریقه نصب برنامه واسم کمی عجیب بود اما یکم که بیشتر آشنا شدم دیدم چقد کاراتر و ساده‌تر از نصب برنامه بصورت ویندوزیه و آپدیت کردنشون چقدر راحته. اوایل زیاد ارتباط خوبی با ترمینال نداشتم ولی اینطور که تو اینترنت میدیدم کارای زیادی میشه باهاش کرد ولی حوصله و دانش میخواد. این شد که هی بین لینوکس و ویندوز سوییچ میکردم و یجورایی بینشون بلاتکلیف بودم.</p>\n<h2>اصل شماره ۱ &#8211; هر چیزی طرز تفکر خاص خودشو داره. باید فکرتون لینوکسی باشه</h2>\n<p>یکم که پیش رفتم با پایتون آشنا شدم و خیلی باهاش حال کردم. پایتون یسری فلسفه و طرز فکر پشتشه که به مرور تو ذهنم حکاکی میشد. هیچ چیزی قرار نیست یهویی اتفاق بیوفته و بعضی چیزا به مرور زمان بدست میاد. طرز تفکر پایتونی و حتی شاید نحوه اجرای برنامه های پایتونی به لینوکس و برنامه هاش خیلی شبیه بود و این شد که تصمیممو گرفتم سختی های لینوکسو به جون بخرم و لااقل برای مدتی خودمو از ویندوز دور کنم.</p>\n<p>لینوکس رابط گرافیکی خیلی خوبی داره و به شدت هم شخصی سازی میشه کردش اما این رابط گرافیکی به تنهایی جوابگو همه کار نیست. همه کاری که میگم منظورم چیزی فراتر از یه وبگردی ساده یا حتی فیلم دیدنه.</p>\n<h2>اصل شماره ۲ &#8211; شما باید خوره کامپیوتر باشید تا بتونید با طرز فکر لینوکسی انس بگیرید</h2>\n<p>با VLC آشنایی دارید؟ یه نرم افزار خیلی معروف برای دیدن فیلمه! امروزه سرعت اینترنت بالا رفته و لازم نیست فیلمو دانلود کنید و بعد ببینید. کافیه VLC رو باز کنید و لینک فیلم رو بهش بدید تا استریمش کنه و آنلاین ببینیدش. اینو هم تو لینوکس و هم تو ویندوز میشه با رابط گرافیکی انجام داد. اما یه خوره کامپیوتر احتمالا ترجیهش اینه که بجای اینکه VLC رو باز کنه و بین منو ها بگرده و گزینه ی استریم از اینترنت رو پیدا کنه، تو ترمینال همجین چیزی بنویسه:</p>\n<p><code>vlc http://x.com/my_movie.mkv</code></p>\n<p>کاربرا حرفه ای لینوکس اکثرا اینطورین! این کار یا کار های مشابه بر اثر تجربه بدست میاد و به مرور میتونید حدس بزنید چه پارامتر هایی پاس بدید برنامه مورد نظر چه کاری انجام میده. اینکارا با یکم دنگ و فنگ تو ویندوز هم شدنیه اما واقعیت اینه که ویندوز برای اینکارا ساخته نشده. حتی یه کاربر معمولی ممکنه هیچوقت با این روش راحت نباشه.</p>\n<p>ترمینال انعطاف خیلی زیادی به برنامه ها میده و کارهارو با دقت خیلی بیشتری انجام میده. درواقع برنامه‌نویس‌ها به جای اینکه وقتشونو بذارن تا هرچیزیو گرافیکی بنویسند، برنامه های تحت ترمینال مینویسند ولی با قابلیت کاستومایز و کنترل بیشتر(<em>البته برای برنامه های رایج نسخه گرافیکی هم توسط همون توسعه دهنده یا توسعه دهنده های دیگه منتشر میشه</em>). سرعتتون‌هم میتونه هم خیلی بیشتر شه هم خیلی کمتر. واقعیت اینه که رابط گرافیکی تو نگاه اول خیلی ساده تره چون همه چیز(<em>با گزینه ها و انتخابای کمتر</em>) جلوی چشمتونه اما اگه بخواید حرفه ای تر کاری کنید دیگه رابط گرافیکی جوابگو نیست! نیازه که وقت بذارید و کار با ترمینالو یاد بگیرید. هر برنامه دنیاییه و کانفیگ کردنش برای اولین بار میتونه دشوار باشه.</p>\n<h2>اصل شماره ۳ &#8211; اگه میخوای لینوکسی حرفه‌ای شی باید تو چیز ها عمیق شی</h2>\n<p>همه چیز تو لینوکس دست خودتونه و همه چیز قابل تغییره! تو ویندوز سرور خیلی راحت میتونید یه سایت بالا بیارید اما تو سرور لینوکسی باید دانشی از apache و bind server داشته باشید. البته تو لول های حرفه ای تر ویندوزی ها هم باید این دانش رو بدست بیارن اما تو لینوکس شما شیرجه میزنید تو دل داستان و باید بدونید چی کار می‌کنید! البته جای ترسی نداره چون اینترنت پره از داکیومنت و آموزش و میتونید با اونا شروع کنید! و البته نیازی نیست همه چیز از مثلا apache رو بلد باشید اما حداعقلاتی نیازه. به مرور حرفه ای میشید:). دفعات اول با کپی پیست دستورات روی سرور لینوکس سایت بالا میاوردم. اما تکرار در انجام دادنشون به مرور مفاهیم اولیه رو بهم یاد داد.</p>\n<h2>اصل شماره ۴ &#8211; این تویی که تصمیم گیرنده ای. احترام متقابله</h2>\n<p>لینوکسیا به برنامه ها احترام میذارن و برنامه ها هم به لینوکسیا احترام میذارن. البته این یچیز خیلی کلیه اما واقعیت اینه که اغلب اینطوره. تا شما نخواید برنامه ها کاری انجام نمیدن. مثلا حتی برای اضافه کردن برنامه به استارتاپ شما خودتون باید تصمیم بگیرید و تا شما نخواید اضافه نمیشه! یا برای انجام کار های مهم مثل تغییرات سیستمی باید پسورد ادمین(روت) را وارد کنید. اکثر برنامه ها اوپن سورس هستن و اگه به هردلیل بهشون اعتماد نداشته باشید میتوانید سورسشونو چک کنید. یا اگه مشکلی داشتن میتونید تو گیت هاب گزارش بدید یا حتی خودتون اصلاحش کنید و کامیت کنید!</p>\n<p>اعتقاد بر اینه که انتشار سورس میتونه برنامه رو قوی‌تر کنه و واقعا هم جواب داده.  شرکت هایی مثل مایکروسافت که قدیم به هیچ وجه سورس منتشر نمیکردن دارند محصولاتشونو اوپن سورس میکنن که اولا مشکلاتش رو بقیه هم رفع کنند، دوما بقیه هم بتوانند توسعش بدن و سوما بشه بهشون اعتماد کرد!</p>\n<h2>اصل شماره ۵ &#8211; نیازی نیست برنامه نویس باشید</h2>\n<p>اشتباه نکنید، لینوکس فقط برا برنامه نویس‌ها مناسب نیست! من لینوکسو برا چهار دسته آدم مناسب میدونم:</p>\n<ul>\n<li>خوره ها</li>\n<li>کسایی که دنبال یک سیستم عامل پایدار برای کار های روتین مثل وبگردی هستن و نمیخوان هی عوضش کنن.</li>\n<li>برنامه نویس ها</li>\n<li>sysAdmin ها</li>\n</ul>\n<h3><b>نتیجه گیری:</b></h3>\n<p>حس میکنم زیادی در مورد لینوکس حرف زدم. اصلا منظورم این نیست که حرفه ای ها همه لینوکسین. ولی کاملا منظورم اینه که تو لینوکس پتانسیل برای حرفه ای شدن بیشتره. و البته راه ساده ای قرار نیست پیش رو باشه. لینوکس بسیار چالش بر انگیزه و همون چالش هاست که باعث میشه شما یاد بگیرید و خودتونو بالا بکشید:) . اگر بتونید لینوکسی شید هیچوقت سمت ویندوز نمیرید و البته این به معنای ضعیف بودن ویندوز نیست، بلکه به این معناست که دیگه فکرتون با راه‌کار های لینوکسی خو گرفته. اگرم یه ویندوزی حرفه ای هستید و نهایت کاری که میکنید نصب یه برنامه یا کرک کردن یه بازی نیست، احتمالا دیگه نتونید لینوکسی شید!</p>\n","slug":"%d9%88%db%8c%d9%86%d8%af%d9%88%d8%b2-%db%8c%d8%a7-%d9%84%db%8c%d9%86%d9%88%da%a9%d8%b3%d8%9f","categories":[{"name":"برنامه نویسی","description":"مطالب مرتبط با برنامه نویسی","id":"2060d515-a7d7-54eb-91f0-dc58dc6693dc"},{"name":"سیستم عامل","description":"","id":"9f405b39-e913-5e0f-b7a7-fa396c22f39d"},{"name":"لینوکس","description":"","id":"2261f593-d54a-5307-bbbb-a6d1ad5e134d"}],"featured_media":null}},{"node":{"title":"چطوری برنامه نویسی یاد بگیرم؟","excerpt":"<p>یادگیری هر کسی با کسی دیگه متفاوته. من نمیتونم روش کلی بگم. اجازه بدید داستان خودمو براتون تعریف کنم:. تقریباً 15 سالم بود که داشتم به برنامه نویسی علاقه&zwnj;مند میشدم و با html و css شروع کردم. اونموقع ها نهایت کاری که میکردم این بود یه وردپرس بزنم و افزونه و قالب نصب کنم و &hellip; <a href=\"https://backend.hesamkaveh.com/%da%86%d8%b7%d9%88%d8%b1%db%8c-%d8%a8%d8%b1%d9%86%d8%a7%d9%85%d9%87-%d9%86%d9%88%db%8c%d8%b3%db%8c-%db%8c%d8%a7%d8%af-%d8%a8%da%af%db%8c%d8%b1%d9%85%d8%9f/\" class=\"more-link\">ادامه خواندن <span class=\"screen-reader-text\">چطوری برنامه نویسی یاد بگیرم؟</span></a></p>\n","content":"<p style=\"text-align: right;\">\n\tیادگیری هر کسی با کسی دیگه متفاوته. من نمیتونم روش کلی بگم. اجازه بدید داستان خودمو براتون تعریف کنم:.\n</p>\n<p style=\"text-align: right;\">\n\tتقریباً 15 سالم بود که داشتم به برنامه نویسی علاقه&zwnj;مند میشدم و با html و css شروع کردم. اونموقع ها نهایت کاری که میکردم این بود یه وردپرس بزنم و افزونه و قالب نصب کنم و ادیتشون کنم. و خب درواقع پروژه خاص و حرفه&zwnj;ای ای انجام نمی&zwnj;دادم. همین باعث شد که تقریباً طی 4 سال چندین بار html و css بخونم و درنهایت بازم هیچی بلد نباشم چون تقریبا تمرین عملی نداشتم. اومدم دانشگاه و تو جو رقابتی با چند تا از بچه&zwnj;ها قرار گرفتیم و باعث شد اعتماد به نفس اینو پیدا کنم که پروژه واقعی انجام بدم، درصورتی که بازم دانش زیادی نداشتم. برای دست گرمی یه عکس از یک وبسایت گیراوردم و شروع کردم به کد زنیش. بیشتر کد هایی که پیاده کردم با آزمون و خطا بود یا با سرچ! درواقع 4 سال و چند باری که html خوندنم اونقدری کمک نکرده بود!! اونجا بود که متوجه شدم <strong>اینکه چقدر برای انجام یک کار دورخیز میکنیم مهم نیست، مهم اینه&nbsp;که واقا میخوایم اون کار رو انجام بدیم و شروعش می&zwnj;کنیم یا نه!</strong>\n</p>\n<p><!--more--></p>\n<p>\n\tبعد از اون قضیه دیگه آموزش من پروژه محور شد. یکم چشم و گوشتونو باز کنین کلی پروژه به چشمتون میخوره که یا بقیه بهتون پیشنهاد کردن یا خودتون باید پیشنهاد بدید و بگیریدش. من پروژه هایی رو انتخاب می&zwnj;کردم که با کمی تحقیق در موردشون این حسو داشتم که میتونم انجامشون بدم(حتی اگه در اون لحظه دانششو نداشتم. این روش یسری حسن داره:\n</p>\n<ul style=\"text-align: right;\">\n<li>\n\t\tاولاً اینکه درگیر کار می&zwnj;شید و میبینید چیو باید یاد بگیرید و چیزای اضافیو یاد نمیگیرید(بعدها نیاز پیدا کنید یاد میگیرید). مهم اینه که شما راه میوفتید\n\t</li>\n<li>\n\t\tعقلانیه که پروژه هایی که قبول کردید انتظار زیادی ازتون ندارن و لزومی نداره کار خیلی حرفه&zwnj;ای تحویل بدید(البته نه به این معنا که تلاش نکنین)\n\t</li>\n<li>\n\t\tدر قبال یادگیریتون پول هم دریافت میکنید. شاید مقدار زیادی نباشه ولی شیرین&zwnj;ترینه\n\t</li>\n</ul>\n<p style=\"text-align: right;\">\n\tهنوزم که هنوزه دارم از این روش جواب میگیرم. همین وبلاگی که می&zwnj;بینید بهونه ای شد که reactjs یاد بگیرم درحالی که میتونستم خیلی راحت با وردپرس بزنم. اما دنبال یه پروژه ای بودم که باهاش ریکت یاد بگیرم و البته مدت ها بود میخواستم وبلاگ بزنم.&nbsp;البته اینجور پروژه ها معمولاً مشکلات و چالش هایی دارن که به مرور زمان حل میشن.\n</p>\n<p style=\"text-align: right;\">\n\tآها یه نکته رو یادم رفت بگم&hellip; اگه میخواید لایببری جدید یاد بگیرید از example ها کمک بگیرید. معمولاً لایبرری ها یسری example دارن که یه پروژه ساده باهاشون پیاده&zwnj;سازی شده. من مستقیم میرم سر تست اونا و سعی میکنم ادیتش کنم به چیزی که میخوام. هرجا هم مشکل بخورم از داکیومنتش کمک میگیرم یا سرچ میکنم.\n</p>\n<p style=\"text-align: right;\">\n\tروش دیگه ای هم هست اینکه اول مطالعه کنید و با دورخیز مناسبی وارد پروژه شید. درواقع بعضیا آکادمیک کار می&zwnj;کنن بعد عملی. شاید این بهترین روش باشه اما نه برای شروع! شما در اول راه برای شروع کار و پروژه نیاز به انگیزه دارید و چه انگیزه&zwnj;ای بهتر از تجربه انجامش؟!\n</p>\n<h3 style=\"text-align: right;\">\n\tچه زبان برنامه نویسی بهتره؟<br />\n</h3>\n<p style=\"text-align: right;\">\n\tواقعیتش اینه که هر زبانی هدفی داره. ولی اگه هنوز زبانی رو انتخاب نکرده&zwnj;اید نگران نباشید. بجا اینکه وسواس به خرج بدید و هی تحقیق کنید که اسمشو میذارم دورخیز برای یه شروع قوی(که معمولا اتفاق نمیوفته)، خودتونو درگیر یک زبان کنید و به مرور زمان زبان مورد علاقتونو پیدا میکنید. یک زبان قدیمی و با داکیومنت بالا بهترین انتخاب میتونه باشه. مثل پایتون یا c#. البته اگه پیشنهاد منو بخواید چیزی نیست جز پایتون.\n</p>\n<p style=\"text-align: right;\">\n\tیه توصیه:<strong> تو دنیای نرم&zwnj;افزار، با همون تکنولوژی که راه دستته و کارت رو راه می اندازه شروع کن، هر وقت به نقطه&zwnj;ای رسیدی که کارت دیگه راه نیافتاد خودت می&zwnj;فهمی وقت تغییره و باید سراغ چی بری.</strong>\n</p>\n<h3 style=\"text-align: right;\">\n\t&nbsp;<br />\n</h3>\n<h3 style=\"text-align: right;\">\n\tبرنامه نویسی دسکتاپ، وب و یا موبایل؟<br />\n</h3>\n<p style=\"text-align: right;\">\n\tشاید امروزه برنامه نویسی موبایل خیلی رو بورس باشه و نقش وب کمرنگ تر بنظر بیاد. اما اکثر برنامه&zwnj;های موبایل به وب وابسته اند. برنامه نویسی دسکتاپ هم دچار تحول بوده و دیگه کمتر اپ دسکتاپ می&zwnj;بینیم اما حوزه های جدیدی در برنامه نویسی بوجود آمده مثل ماشین لرنینگ یا داده کاوی. شاید در ابتدای کار مجبور شید چند پلتفرم یا حوزه های مختلف امتحان کنید تا متوجه شید به چی علاقه دارید.\n</p>\n<h3 style=\"text-align: right;\">\n\tاز چه منبعی یاد بگیرم؟<br />\n</h3>\n<p style=\"text-align: right;\">\n\tبرای یادگیری از هر منبعی میتونید استفاده کنید. بعضی منبع ها از بعضی دیگه بهترن ولی <strong>بهترین منبع اونیه که شما باهاش ارتباط برقرار می&zwnj;کنید.</strong> بطور مثال جادی در یک دوره ای به اسم بستون، یه چیز هایی در مورد django گفت در حالی که هدفش آموزش جانگو نبود و شاید مطالب جانگویی که گفت زیاد حرفه&zwnj;ای نبود. ولی همون کافی بود تا منو با جانگو آشنا کنه و بقیه چیز هاشو به مرور زمان و طی پروژه های مختلف یاد گرفتم(البته دنیای برنامه نویسی یه چیز نامحدودیه و هیچ&zwnj;وقت یادگیری متوقف نمیشه). درواقع اون آموزش برای من مفید بود بخاطر اینکه یه حداعقلاتی به من یاد داد و اعتماد به نفس و انگیزه منو برای یادگیری بیشتر کرد.\n</p>\n<h3 style=\"text-align: right;\">\n\tبرنامه نویسی کار کردم ولی یادم میره. چه کنم؟<br />\n</h3>\n<p style=\"text-align: right;\">\n\tتمرین تمرین تمرین. برنامه نویسی دقیقاً یک ورزش ذهنیه و همونطوری که ورزشکار نیاز به تمرین داره تا رو فرم بمونه، برنامه نویس هم باید از ذهنش استفاده کنه و اینطوری خودشو آماده نگه داره(چه برای یادگیری چیز جدید، چه برای استفاده از دانش قبلی)\n</p>\n<p style=\"text-align: right;\">\n\tاگرم برای کار های تکراری مجدداً سرچ می&zwnj;کنید یا از کد پروژه های قبلیتون کمک میگیرید، نگران نباشید. شما مثل حرفه&zwnj;ای ترین برنامه نویس ها عمل می&zwnj;کنید:)\n</p>\n<h3 style=\"text-align: right;\">\n\tبازارکار برای برنامه نویسی چطوره؟<br />\n</h3>\n<p style=\"text-align: right;\">\n\tنمیخوام در مورد بازار در این پست حرف بزنم چون بحث&zwnj;های زیادی داره. بطور کلی شما هرچی رو واقا دوست داشته باشید و مهارت داشته باشید میتونید ازش پول بدست بیارید. چه برسه به برنامه نویسی که الان خیلی هم رو بورسه.\n</p>\n<p style=\"text-align: right;\">\n\t<strong>چند نکته:</strong>\n</p>\n<ul>\n<li style=\"text-align: right;\">\n\t\tالزاماً هرکی که دانش آکادمیک داره، نمیتونه عملی پیادش کنه. بخاطر همینه که معمولا استاد دانشگاه&zwnj;ها حتی اگه مبحثی رو تسلط دارن نمیتونن در عمل پیاده سازیش کنند.\n\t</li>\n<li style=\"text-align: right;\">\n\t\tاگه میخواید در عمل خوب باشید، تمرین کنید. مطالعه کافی نیست.\n\t</li>\n<li style=\"text-align: right;\">\n\t\tاز گرفتن پروژه نترسید.\n\t</li>\n<li style=\"text-align: right;\">\n\t\tپروژه ای که با علایقتون همسو نیست نگیرید، حتی اگه پول توش باشه. اولاً زمانتون برای لذت از زندگی محدوده و باید با چیزایی که خوشحالتون میکنه وقت بگذرونید. دوماً همون وقتو میتونید بذارید و چیزایی یاد بگیرید که روی آیندتون تأثیر داره.\n\t</li>\n<li>\n<p style=\"text-align: right;\">\n\t\t\tو از همه مهمتر، سخت نگیرید. برید دنبال علاقتون و خودتونو درگیرش کنید.\n\t\t</p>\n</li>\n</ul>\n","slug":"%da%86%d8%b7%d9%88%d8%b1%db%8c-%d8%a8%d8%b1%d9%86%d8%a7%d9%85%d9%87-%d9%86%d9%88%db%8c%d8%b3%db%8c-%db%8c%d8%a7%d8%af-%d8%a8%da%af%db%8c%d8%b1%d9%85%d8%9f","categories":[{"name":"برنامه نویسی","description":"مطالب مرتبط با برنامه نویسی","id":"2060d515-a7d7-54eb-91f0-dc58dc6693dc"}],"featured_media":{"alt_text":"","localFile":{"childImageSharp":{"fluid":{"base64":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAJCAIAAAC9o5sfAAAACXBIWXMAAAsSAAALEgHS3X78AAAB8UlEQVQozzWRe0/TYBTG+YB+AYxoAkqMf0wwIiYEnZauyzYY7Ea7W7u+fXvZDXACMkbZXBhOtrdvadBoNDHTsXaX4EewnSN5/jg5Ob+c5zlnCmqmI2yKel/EfVEfSMYQahbQLEEzJ0KmiC1ojCC2JN2aIJo5NalQN3P+Q/j8K1n9Gj1sSqj7Tu/I7a6CB1ls5ow+f/GbP2zyzU7yrAPRLSyga+XqZqNw7I/z/MHZJiu+XH0TTbBGq8VCsLpOksHwa4LK5guCUgLlg/0PL5hKW7y03fUcOHt145Ura6/IVJxT91K5Qs618Gzh0WyAXllJuZ96ffMP7otbQbqoJkolObfINb7b6RwYop50OaLLzUg6knhfTeSPFMrzeG5uZuZOIOnazjHLJHV3enpp9h7zfD6UkpbXWa7x0z7Q/8zXAP+FJ6Uv+KE/JdBlzAi7bveaa3EpBvxcNkp5KYIgKJLw+96G2YwsK6yKHdvI3qz1oD7kP33boN1p1YikFbGwG6AJH++t1M5raq3eNo4+NiISeBIjPVys3qhxp9hGxrBjexg/0d2hSLRYZRhB3ldj28EwSIcLZVraCe9Ut/bqoeLpppD3JqGHzjDHmnS72Tm6gHoQD/hWN4Mt9uIPr40AGthNgEzQ7oLWWMj+uSUgyxkeU/8AakZ1DzRee6YAAAAASUVORK5CYII=","aspectRatio":2.1818181818181817,"src":"/static/667f338fa3fabcc9cfff3b3131d6b3e2/5a67f/programming.png","srcSet":"/static/667f338fa3fabcc9cfff3b3131d6b3e2/b1628/programming.png 188w,\n/static/667f338fa3fabcc9cfff3b3131d6b3e2/ae0e1/programming.png 375w,\n/static/667f338fa3fabcc9cfff3b3131d6b3e2/5a67f/programming.png 750w,\n/static/667f338fa3fabcc9cfff3b3131d6b3e2/bc549/programming.png 960w","sizes":"(max-width: 750px) 100vw, 750px"}}},"media_details":{"width":960,"height":440,"file":"2018/09/programming.png"}}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"2060d515-a7d7-54eb-91f0-dc58dc6693dc"}}