{"data":{"wordpressCategory":{"id":"ed2626c0-24e3-54e0-bbf5-56a22b75453d","name":"قوانین زندگی من","description":""},"allWordpressPost":{"edges":[{"node":{"title":"نود و هفت: کوله باری برای سال جدید","excerpt":"<p>ما آدما تو زندگیمون به سمت و سو های زیادی میریم. همچو کشتی در دریای طوفانی. تنها چیزی که میتونه سمت و سوی حرکتمونو مشخص کنه اینه که بدونیم کدوم سمت برویم! اما فقط این کافی نیست. باید بدونیم با چه سرعتی پیش برویم تا هم پیشروی خوبی داشته باشیم هم سوختمون تموم نشه.</p>\n","content":"\n<p>ما آدما تو زندگیمون به سمت و سو های زیادی میریم. همچو کشتی در دریای طوفانی. تنها چیزی که میتونه سمت و سوی حرکتمونو مشخص کنه اینه که بدونیم کدوم سمت برویم! اما فقط این کافی نیست. باید بدونیم با چه سرعتی پیش برویم تا هم پیشروی خوبی داشته باشیم هم سوختمون تموم نشه. </p>\n\n\n\n<!--more-->\n\n\n\n<h3>ورزش</h3>\n\n\n\n<p>من تو زندگیم عشق های زیادی داشتم. از معدود عشق های پایداری که از بچگیم همراهم بوده دوچرخه سواریمه. سال پیش هم این عشق به گرمی گذشت. اگه بخوام یک حساب سرانگشتی کنم سال پیش جمعا به اندازه یک ماه با دوچرخه در مسافرت بودم. هیچوقت اینطوری نگاه نمی‌کنم که یک ماه تو زندگیم عقب افتادم، چون تابحال به هرجا رسیدم مدیون ورزش و علی‌الخصوص دوچرخه سواری بودم. فقط یک ورزش نیست&#8230; بلکه کلی مهارت به آدم یاد میده.</p>\n\n\n\n<p>اما سبک دوچرخه سواری من یک مشکل داره. ماه به ماه ممکنه سوار دوچرخه نشم (و عملا ورزش نداشته باشم) تا اینکه برم مسافرت. امسال قصد دارم برای کار های روزمره کمتر از ماشین استفاده کنم و همچنین هر جمعه دوچرخه سواری کنم. </p>\n\n\n\n<p>سال پیش یکم استخر و فوتسال و باشگاه بدنسازی هم رفتم. یکی از اینا رو با برنامه و درحد لالیگا ادامه میدم. احتمالا انتخابم شنا خواهد بود چون قبلا بصورت حرفه ای دنبال میکردم( هر کسی کو دور ماند از اصل خویش*** باز جوید روزگار وصل خویش )<br></p>\n\n\n\n<h3>پول و مهارت</h3>\n\n\n\n<p>پول و مهارت دو چیز کاملا جدا از هم هستن. آدمای پولدار کسایی نیستن که مهارت بالایی دارند، بلکه کسایی هستن که میدونن از مهارتشون چطوری استفاده کنند. خیلی تلاش کردم بتونم در مورد این دو حیث جداگونه بنویسم اما هی نوشتم و هی پاک کردم. خلاصه که نشد که بشه. سال گذشته در یک درگیری بودم بین اینکه مهارت زیاد کنم یا درآمد کسب کنم. درنهایت به این نتیجه رسیدم الان وقتیه که به مهارت بیشتر از پول نیاز دارم و پول درآوردن رو محدود کردم به رفع نیاز هام. تقریبا نیمی از سال را فقط به مهارت چسبیده بودم و نیمی از سال را به کسب درآمد. با این‌حال رشد ۲ برابری در درآمدم داشتم که عملا از لذتش بخاطر گرونی ها بهره ای نبردم.</p>\n\n\n\n<p>اما امسال یکم وضع فرق داره. یکم بیشتر تمرکز میکنم روی درآمد و برای رشد ۳ برابری آماده شدم. نگاهی که به برنامه نویسی دارم عین نگاه به یک ابزاره که کارمو راه میندازه. بنابراین بیزینسی به برنامه نویسی نگاه میکنم و اینم میدونم که تا آخر عمر برنامه نویسی نمیکنم.</p>\n\n\n\n<h3>وزارت فرهنگ و سواد</h3>\n\n\n\n<p>کتاب فقط ۷ تا خواندم. افتضاحه. حس میکنم بیشتر از اینکه کتاب‌خوان باشم، حرفشو می‌زنم. امسال تصمیم دارم 15 تا کتاب بخوانم. برای من جهش نسبتا بزرگیه رسیدن به این تعداد و برای همین یک پست مینویسم از کتاب هایی که باید بخوانم و اونجا برنامه ریزی می‌کنم. </p>\n\n\n\n<h3>صدا و سیما</h3>\n\n\n\n<p>و اما وبلاگ&#8230; ۷ ماهه شده و ۱۴ تا پست. یعنی ۲ تا در ماه.  فکر میکردم کمتر از اینا باشه و خب راضیم که اینطور بوده. نوشتن رو ۱۰۰٪ ادامه میدم و برنامه دارم چند بخش جالب بهش اضافه کنم مثل نوشتن در مورد کتاب هایی که خواندم یا خاطرات سفر.</p>\n\n\n\n<p>به <a rel=\"noreferrer noopener\" aria-label=\"لیموناد (در یک برگه جدید باز می‌کند)\" href=\"http://limoonad.com/\" target=\"_blank\">لیموناد</a> هم قول دادم یک دوره آموزش جنگو منتشر کنم. دارم روش کار میکنم و نیمه اول سال منتشر میشه.</p>\n\n\n\n<h3>تجربه های جدید</h3>\n\n\n\n<p>عاشقشم! یکی از چیزایی که باعث میشه زنده بمونم تجربه های خاص و پر هیجانه. به هیچ قیمتی نمیفروشمشون و الان هم سنم جوریه که میتونم تجربشون کنم. </p>\n\n\n\n<p>امسال چه از نظر شغلی چه از نظر تفریحی چند تا تجربه باحال دارم. reactjs کار کردم و به یکی از فریمورک های محبوبم اضافه شد! میتونید قالب این وبسایت را از <a rel=\"noreferrer noopener\" aria-label=\"گیت‌هاب (در یک برگه جدید باز می‌کند)\" href=\"https://github.com/hesamkaveh/sansi\" target=\"_blank\">گیت‌هاب</a> بگیرید و استفاده کنید. قبل تر در مورد <a href=\"https://hesamkaveh.com/%d8%a7%d8%b2-reactjs-%d8%aa%d8%a7-gatsbyjs-%d9%80-%d8%aa%d8%ac%d8%b1%d8%a8%db%8c%d8%a7%d8%aa-%d9%85%d9%86-%d8%a7%d8%b2-%d8%af%d9%86%db%8c%d8%a7%db%8c-reactjs\">دلیل استفادم از gatsby</a> نوشتم.</p>\n\n\n\n<p>تجربه تدریس پایتون هم داشتم با ۷۰ تا دانشجو! در دانشگاه اراک کلاس آموزش مقدماتی پایتون گذاشتم و استقبال خیلی خوبی شد. بازم از این جور کلاس ها برگزار میکنم ولی مطمئنن به عنوان یک شغل بهش نگاه نمی‌کنم.<br></p>\n\n\n\n<p>تجربه ورزشی خیلی خاصی هم که داشتم غارنوردی بود. تابحال وقتی فکرم میرفت سمت غار، یک محیط امن که پر از چراغ و بازدیدکنندست رو تصور میکردم. اما غارپیمایی یعنی رفتن به جایی که تنها چیزی که توش وجود نداره امنیته. ولی در عوض تاریکی مطلق، خفاش، کار های خفن مثل صخره نوردی و این چیزا توش هست. </p>\n\n\n\n<p>امسال از نظر ورزشی صخره‌نوردی رو امتحان میکنم و از نظر شغلی هم اعتقاد دارم reactjs اونقدری گسترده هست که بتونم واسش وقت بذارم. التبه قصد دارم نیم نگاهی هم به nodejs بندازم.</p>\n\n\n\n<h3>روابط</h3>\n\n\n\n<p>ترکوندم! امسال رشد زیادی تو روابطم داشتم که از مهارت هاییه که تو سفر با دوچرخه بدست آوردم. دیگه به اون مهارتی رسیدم که با هرکسی بخوام بتونم ارتباط بزنم. از این بین دو تا دوست خوب پیدا کردم و یکمم دارم روی دوست های صمیمیم تجدید نظر می‌کنم. دوست خیلی روی آدم تاثیر داره و خواه ناخواه مسیر شبیه به همی رو طی میکنیم. </p>\n\n\n\n<h3>اولویت ها<br></h3>\n\n\n\n<ul><li>استارتاپ اخیرمونو به درآمد میرسونم.</li><li>ورزش پیوسته</li><li>مطالعه</li><li>دوره آموزشی آنلاین</li><li>عمیق کردن روابط</li></ul>\n","slug":"%d9%86%d9%88%d8%af-%d9%88-%d9%87%d9%81%d8%aa-%da%a9%d9%88%d9%84%d9%87-%d8%a8%d8%a7%d8%b1%db%8c-%d8%a8%d8%b1%d8%a7%db%8c-%d8%b3%d8%a7%d9%84-%d8%ac%d8%af%db%8c%d8%af","categories":[{"name":"قوانین زندگی من","description":"","id":"ed2626c0-24e3-54e0-bbf5-56a22b75453d"}],"featured_media":null}},{"node":{"title":"حیوان بودن بسه!","excerpt":"<p>روزی بود روزگاری بود&#8230; . در یک شب سرد زمستونی پسری به دنیا اومد. پسر خیلی خاصی بنظر نمیرسید ها&#8230; مثل پسر های دیگه بود. منتهی هرچی بزرگ‌تر میشد داشت میفهمید همه مردم یجورایی مثل هم زندگی می‌کنند. همه یروزی از شکم مامانشون بیرون میان، کودکی میکنند، مدرسه و دانشگاه میروند، کار میکنند، خانواده تشکیل &hellip; <a href=\"https://backend.hesamkaveh.com/%d8%ad%db%8c%d9%88%d8%a7%d9%86-%d8%a8%d9%88%d8%af%d9%86-%d8%a8%d8%b3%d9%87/\" class=\"more-link\">ادامه خواندن <span class=\"screen-reader-text\">حیوان بودن بسه!</span></a></p>\n","content":"\n<p>روزی بود روزگاری بود&#8230; . در یک شب سرد زمستونی پسری به دنیا اومد. پسر خیلی خاصی بنظر نمیرسید ها&#8230; مثل پسر های دیگه بود. منتهی هرچی بزرگ‌تر میشد داشت میفهمید همه مردم یجورایی مثل هم زندگی می‌کنند. همه یروزی از شکم مامانشون بیرون میان، کودکی میکنند، مدرسه و دانشگاه میروند، کار میکنند، خانواده تشکیل میدهند و آخرش هم میوفتن یه گوشه ای میمیرند. برخلاف میلش راهی که همه رفتند رو رفت و از قضا به بهترین ها هم رسید. بهترین ماشین، بهترین خانه، بهترین امکانات زندگی. یه همسر هم داشت خیلی همو دوست داشتند. در یک منطقه جنگلی و خیلی قشنگ هم زندگی میکردند و صبح ها با صدای پرنده ها از خواب بیدار میشدند. شب ها هم با صدای باران خوابشون می‌برد. خلاصه که زندگی خیلی خوبی داشتند. همه چیز در آرامش کامل و زندگی ای پر از امکانات.</p>\n\n\n\n<!--more-->\n\n\n\n<p>تقریبا دیگه چیزی نبود که از زندگی بخواد و بهش نرسیده باشه. اما بعد از سالیان سال زندگی و کار بالاخره روز موعود فرا رسید و این بابا هم مثل همه بابا های دیگه فوت کرد. دوست و آشنا زیاد داشت، همه اومدن سر قبرش و کلی گریه زاری کردن&#8230; . خیلی شلوغ شده بود&#8230;</p>\n\n\n\n<p> از ملیون ها سال پیش روز به روز انسان هایی متولد شدند و هدفشون آرامش بوده. در طول زندگیشون برای خواسته هاشون تلاش کردند. این بابای قصه ما هم جزو یکی از ایناست. در طول عمرش زندگی خیلی خوبی داشت، اما آخرش که چی؟ جز پر کردن چاه زیر خونش، آیا تاثیری روی این دنیا گذاشته؟ از اونجایی که من میدونم، هرکاری کرده برای خودش بوده&#8230; نمیگم بده، اما یکم عمیق که فکر کنیم زندگی چندان ارزشمندی نداشته&#8230;. اون زندگی ای ارزشمنده که روی زندگی دیگران تاثیر خوب بگذاره. و اون زندگی ای ارزشمندتره که در طول سالیان سال و حتی بعد از مرگش این تاثیرگذاری ادامه داشته باشه. درسته که وقتی این بابا فوت کرد خیلی ها ناراحت شدند، اما آیا چند سال دیگه کسی اصلا یادی ازش میکنه؟</p>\n\n\n\n<p>اگر بخوایم فقط فکر خودمون باشیم و تنها هدفمون پر و خالی کردن شکممون باشه، اینکه الان بمیریم یا ۶۰ سال دیگه هیچ فرقی نداره. تازه&#8230; ممکنه کلی هم به طبیعت آسیب برسونیم&#8230; بالاخره یچیزی باید بخوریم دیگه.</p>\n\n\n\n<p>تقریبا هر کاری انجام میدم میپرسم آخرش که چی. حتی بازی کامپیوتری هم میکنم باید برای خودم دلیل قانع کننده ای داشته باشم. معمولا در یک مدت مشخص مثلا یک ماه یک هدف کلی‌ای دارم که قاعدتا به چندتا هدف کوچک تقسیم میشه. اما&#8230; اما منی که به خیال خودم اینقدر هدفمندم، چطوری میخوام برای آیندگان تاثیرگذار باشم؟ </p>\n\n\n\n<p>اصلا آیندگان مال آیندگان، برای نسل خودم چه تاثیری دارم؟</p>\n\n\n\n<p> هدفم از زندگی چیه؟ آیا اون هدف کلی ماهیانم، هدف کوچکی از هدف کل زندگیمه؟</p>\n\n\n\n<p><br></p>\n","slug":"%d8%ad%db%8c%d9%88%d8%a7%d9%86-%d8%a8%d9%88%d8%af%d9%86-%d8%a8%d8%b3%d9%87","categories":[{"name":"جامعه","description":"","id":"5b0c418e-6a28-5cac-9f2f-c09205fd5eef"},{"name":"قوانین زندگی من","description":"","id":"ed2626c0-24e3-54e0-bbf5-56a22b75453d"}],"featured_media":null}},{"node":{"title":"چرا دانشگاه روی دانشجو تاثیرات بد میگذارد؟","excerpt":"<p>دانشجوی ترم ۷ ام. دانشجو&#8230;. دانشجو بودن خوبی هایی داره. مثلا وقتی با تاکسی میام اراک میگم دانشجو ام تا طرف دلش بسوزه و تخفیف بده. یا وقتی پسری میره خواستگاری دختر مورد علاقش و میپرسن چی دست و بالته؟ میگه دانشجو ام، چیزی ندارم. دانشجو یعنی بدبخت، یعنی بیچاره ای که وبال گردن خانوادشه. &hellip; <a href=\"https://backend.hesamkaveh.com/%da%86%d8%b1%d8%a7-%d8%af%d8%a7%d9%86%d8%b4%da%af%d8%a7%d9%87-%d8%b1%d9%88%db%8c-%d8%af%d8%a7%d9%86%d8%b4%d8%ac%d9%88-%d8%aa%d8%a7%d8%ab%db%8c%d8%b1%d8%a7%d8%aa-%d8%a8%d8%af-%d9%85%db%8c%da%af%d8%b0/\" class=\"more-link\">ادامه خواندن <span class=\"screen-reader-text\">چرا دانشگاه روی دانشجو تاثیرات بد میگذارد؟</span></a></p>\n","content":"\n<p>دانشجوی ترم ۷ ام. دانشجو&#8230;. دانشجو بودن خوبی هایی داره. مثلا وقتی با تاکسی میام اراک میگم دانشجو ام تا طرف دلش بسوزه و تخفیف بده. یا وقتی پسری میره خواستگاری دختر مورد علاقش و میپرسن چی دست و بالته؟ میگه دانشجو ام، چیزی ندارم. دانشجو یعنی بدبخت، یعنی بیچاره ای که وبال گردن خانوادشه. یعنی بهترین بهونه برای چیزی نداشتن! اصلا واژه و شغل دانشجو چیزیه که دولت ها به افراد چسبوندن تا سرکوبشون کنند. دولت ها دوست ندارند افراد جامعه مسیر های متفاوتی داشته باشن. اینکه افراد یک مسیر ثابتی رو برن برای دولت ها خیلی خوشاینده چون میتونه راحتتر روشون کنترل و نظارت داشته باشه. ضمن اینکه تو این مسیر سرکوب بخورن واسش خیلی بهتره چون خودش اون بالا و رأس قدرت میمونه و بقیه رو بازیچه خودش میکنه. اینکه دانشجو فکر کنه فرد مهمیه میتونه خیلی به ضرر دولت ها باشه. اصلا پستم سیاسی نیست، اما این سرکوب خوردن واقعیتیه که روی ناخودآگاهمون تاثیر زیادی داره. البته فقط دانشگاه نیست که به محصل بی احترامی میشه، سیستم آموزشی از ریشه خرابه، چقدر کتک خوردیم تا به اینجا برسیم؟ من معلمی داشتم که لای انگشتامون خودکار میگذاشت که چرا نمره بدی گرفتی. بیشترین دغدغمون یک‌زمان این بود که از زیر شلنگ معلم جون سالم به در ببریم.</p>\n\n\n\n<p>دانشگاه اندازه  یکی دو ترم خوبه. اون ترم های اول جوگیر بودیم و فکر میکردیم هممون با علاقه رشتمونو انتخاب کردیم و هممون قراره فعال باشیم. مغرور هم بودیم&#8230; فکر میکردیم خدای رشتمونیم. اما بعد ها با دروس و نیاز های جدیدی آشنا شدیم که باعث شد با زیرشاخه های رشتمون آشنا شیم و کم کم یکی از زمینه های مورد علاقمونو انتخاب کردیم. برای بعضی ها ممکنه زودتر و برای بعضی ها دیرتر اتفاق بیوفته. اونوقته که فکرمون یک سایز بزرگتر شده و لااقل بعد از اون من نکته مثبتی ندیدم تو دانشگاه. از اونموقع به بعد دیگه دانشگاه میشه عذاب، میشه مانعی برای رسیدن به اهداف. اونوقته که میخوایم وقتمونو بگذاریم برای یادگیری و کار و متقابلا از یکسری درس های غیرمرتبط عقب میوفتیم ولی استاد های عزیز لطف میکنن با نمره ندادن دانشگاهمونو طولانی تر میکنند تا چیزی که میخوان رو یاد بگیریم، نه چیزی که خودمون تصمیمشو داریم. این یعنی چی؟ یعنی توهین به تصمیمات دانشجو، توهین به اهداف دانشجو، جلوگیری از اینکه افراد حس مهم بودن کنند. شخص دانشجو از دیدگاه اساتید  یک موجود علافیه که نمیدونه کدوم سمت باید بره و نیاز داره تا راه بگذارن جلوش. <br></p>\n\n\n\n<p>اساتید عزیز، کارکنان عزیز دانشگاه لطفا بفهمید! دانشجو بخواد چیزی یاد بگیره خودش میره دنبالش. اینترنت هست. ازونجا یاد میگیره. همایش ها هستن، اونجا با چیز های جدید آشنا میشه. اگرم سوالی داشته باشه یا کمک بخواد اونوقت میاد و کمک میگیره. شما این حقو ندارید مجبورش کنید به یادگیری چیز هایی که شما بلدید و نه به کارش میاد و نه علاقه داره. اگه میخواید درستون واسش مفید باشه نباید مجبورش کنید، باید جذبش کنید!</p>\n\n\n\n<p>بهتر بود دانشگاه اختیاری باشه. کاش فرهنگ غنی جامعمون درک بیشتری از دنیای world wide web داشت و میفهمید تقریبا هرچیزی اونجا هست. اوایل خانواده ام مخالف درس نخواندن من بودند(من هیچوقت درس هایی که علاقه نداشتم رو نمره خوب نمیگرفتم. معدلمم معمولا جزو معدل های بالا نبوده). میگفتن اگه درس نخونی پس چطوری میخوای یاد بگیری؟</p>\n\n\n\n<p>پ.ن:</p>\n\n\n\n<ul><li>من نرم افزار میخونم و خودآموزی تو این رشته جواب میده. منتهی رشته هایی هم هست که اونقدری سورس ندارند و برای یادگیریشون به دانشگاه نیازه.</li><li>کاملا مخالف سیستم نمره دهی هستم. کار ندارم کجای جهان دانشگاه ها چطورین. من طرز دید خودمو دارم. دانشجو اگه درسیو بیوفته یکی دو ترم بعد بالاخره برش میداره و پاسش میکنه. اما&#8230; آیا اینطوری پاس کردن واقعا همراه با یادگیریه؟ آیا اگه میخواست اون درسو یاد بگیره همون ترم اول تلاششو نمیکرد؟</li></ul>\n","slug":"%da%86%d8%b1%d8%a7-%d8%af%d8%a7%d9%86%d8%b4%da%af%d8%a7%d9%87-%d8%b1%d9%88%db%8c-%d8%af%d8%a7%d9%86%d8%b4%d8%ac%d9%88-%d8%aa%d8%a7%d8%ab%db%8c%d8%b1%d8%a7%d8%aa-%d8%a8%d8%af-%d9%85%db%8c%da%af%d8%b0","categories":[{"name":"جامعه","description":"","id":"5b0c418e-6a28-5cac-9f2f-c09205fd5eef"},{"name":"قوانین زندگی من","description":"","id":"ed2626c0-24e3-54e0-bbf5-56a22b75453d"}],"featured_media":{"alt_text":"","localFile":{"childImageSharp":{"fluid":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAXABQDASIAAhEBAxEB/8QAGAABAAMBAAAAAAAAAAAAAAAAAAIDBAX/xAAVAQEBAAAAAAAAAAAAAAAAAAAAAf/aAAwDAQACEAMQAAAB6dM8C9tAldQagf/EABwQAAICAgMAAAAAAAAAAAAAAAECABEDEiEyQv/aAAgBAQABBQJmN78zJ39KbDJZXFAKn//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQMBAT8BH//EABQRAQAAAAAAAAAAAAAAAAAAACD/2gAIAQIBAT8BH//EABoQAAICAwAAAAAAAAAAAAAAAAARARAhQWH/2gAIAQEABj8CMzfBjJe6/8QAGxABAAMBAAMAAAAAAAAAAAAAAQARITEQcYH/2gAIAQEAAT8hMgyocNPfgPGQaF3R7AMNjO2+RzXOiUKJ/9oADAMBAAIAAwAAABDA777/xAAWEQEBAQAAAAAAAAAAAAAAAAABESD/2gAIAQMBAT8QC4//xAAVEQEBAAAAAAAAAAAAAAAAAAABIP/aAAgBAgEBPxBj/8QAHBABAAMAAgMAAAAAAAAAAAAAAQARITFhQYGh/9oACAEBAAE/EFq0rDqI2NUA1BssMmo+DodRHXMEHHuUGhieYuo0ZaiWgrVHT7KVrAowKJ//2Q==","aspectRatio":0.8519003931847968,"src":"/static/7d3bad3465d553f63d3add78d9ed73f0/00201/student-1-1.jpg","srcSet":"/static/7d3bad3465d553f63d3add78d9ed73f0/60a63/student-1-1.jpg 188w,\n/static/7d3bad3465d553f63d3add78d9ed73f0/4cd1e/student-1-1.jpg 375w,\n/static/7d3bad3465d553f63d3add78d9ed73f0/00201/student-1-1.jpg 650w","sizes":"(max-width: 650px) 100vw, 650px"}}},"media_details":{"width":650,"height":763,"file":"2018/12/student-1-1.jpg"}}}},{"node":{"title":"تجربه یک ماهه من از ترک اعتیاد، اعتیادی به سبک عادت","excerpt":"<p>اعتیاد فقط راجع به مواد مخدر نیست، من اعتیاد را نوعی وابستگی بد و به نوعی عادت می‌دونم و معمولا این وابستگی اعتیاده که بده وگرنه مثلا یک نخ سیگار به تنهایی چیز خاصی نیست. اعتیاد می‌تونه راجع به هرجیزی باشه، از چیز های خوب مثل قهوه بگیر تا چیز های بد مثل سیگار و &hellip; <a href=\"https://backend.hesamkaveh.com/%d8%aa%d8%ac%d8%b1%d8%a8%d9%87-%db%8c%da%a9-%d9%85%d8%a7%d9%87%d9%87-%d9%85%d9%86-%d8%a7%d8%b2-%d8%aa%d8%b1%da%a9-%d8%a7%d8%b9%d8%aa%db%8c%d8%a7%d8%af/\" class=\"more-link\">ادامه خواندن <span class=\"screen-reader-text\">تجربه یک ماهه من از ترک اعتیاد، اعتیادی به سبک عادت</span></a></p>\n","content":"<p>اعتیاد فقط راجع به مواد مخدر نیست، من <strong>اعتیاد</strong> را نوعی وابستگی بد و به<strong> نوعی عادت</strong> می‌دونم و معمولا این وابستگی اعتیاده که بده وگرنه مثلا یک نخ سیگار به تنهایی چیز خاصی نیست. اعتیاد می‌تونه راجع به هرجیزی باشه، از چیز های خوب مثل قهوه بگیر تا چیز های بد مثل سیگار و الکل.<!--more--></p>\n<p>میخوام اول راجع به اینستاگرام حرف بزنم و بعد ربطش بدم به عادت هامون توی زندگی. من یک ماهه که اینستاگرام رو کنار گذاشتم و استفاده ای نداشتم. استفاده من از اینستاگرام بیشتر حول پست های آموزشی، بیزینسی و انگیزشی بود. از اول که اینستاگرام نصب کردم تا الان کم پیش اومده واسم مهم باشه فالوور هام چه عکسی از خودشون گذاشتن، مثلا غذا چی خوردن، کجا رفتند، باکی رفتند یا&#8230; . بعضی پست ها رو که اصلا ناشی از افسردگی میدونم.</p>\n<h2>چرا اینستاگرام رو حذف کردم؟</h2>\n<p>مطالب آموزشی و بیزینسی که از کارآفرین های بزرگ (چه داخل چه خارج) دنبال میکردم واسم جذاب بودن. اما کم کم به این نتیجه رسیدم که کتاب خواندن می‌تونه خیلی موثرتر باشه. اما این به تنهایی دلیل حذف کردنش نیست! بعضی وقتا از سر بیکاری یه از سر رفتن حوصله اینستاگرام چک می‌کردم، دقیقا مثل خیلی های دیگه&#8230;. منتهی اون تایم ها حتی اگه مطالب آموزشی دنبال میکردم یادگیری چندانی نداشتم. چون اینستاگرام بیشتر برا سرگرمی مناسبه تا آموزش!</p>\n<p>از طرفی&#8230; من واقعا واسم مهم نیست بقیه چطور زندگی میکنند و در طول زندگیشون چه کار های قشنگی انجام می‌دن. نه اینکه مهم نباشه، مهمه ولی نمیخوام از ریز ریز جزئیاتشون باخبر شم! من هیچوقت اینجور مطالب رو دنبال نمی‌کردم اما چشمم بهشون می‌خورد و متاسفانه اینجور مطالب حتی اگه مستقیم روی طرز فکر آدم اثر نگذاره، رو ناخودآگاه آدم اثر میگذاره. و ضمنا نمیخوام مردم درست یا غلط زندگی رو تو اینستاگرام به من نشون بدهند؛ من یک فرصت دارم که یک زندگی ای رو کنترل کنم و اون زندگی خودمه، پس به سبک خودم عمل می‌کنم.</p>\n<h2>خوب، بد، زشت</h2>\n<p>تایم زیادی رو تو اینستاگرام نمی‌گذروندم ولی معمولا همون تایم بخاطر فرار از بیکاری بود! خوب نیست آدم همه تایم هاشو پر کنه، یه تایم هایی برای بیکاری، تفکر، وقت گذروندن با خانواده و&#8230; لازمه. با حذف اینستاگرام یه موقع هایی واقعا بیکار می‌شدم و خب این اوایل سخت بود واسم، چون عادت داشتم همیشه سرم با یه چیزی مشغول باشه، ولی دیگه طبق عادتم تو وقت های بیکاری اینستاگرامو چک نمی‌کردم. اما بعد ها متوجه شدم تایم بیکاری در اتوبوس رو میتونم با یه لبخند و اندکی تفکر پر کنم. یا اگه خانه باشم میتونم وقتمو با خانواده بگذرونم یا کتاب بخوانم.</p>\n<h2>چرخه عادت</h2>\n<p>و اینکه یه نکته ای هست. معمولا کار های تکراری شما بخاطر عادتتونه نه یک تصمیم که تفکر پشتش باشه. اگه تایم های بیکاری اینستاگرامتونو چک می‌کنید بخاطر یه چرخه سادست. شما بیکار شده اید، پس اینستاگرام چک میکنید، درنتیجه جایزه می‌گیرید. جایزتون چیه؟ احساس خوب مفید بودن. اینطوری دیگه اون احساس گناه بیکار موندنتون تبدیل میشه به یه حس خوب و رضایت.</p>\n<p><img class=\"aligncenter wp-image-158 size-full\" src=\"https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/11/Habit.jpg?resize=660%2C384&#038;ssl=1\" alt=\"\" width=\"660\" height=\"384\" srcset=\"https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/11/Habit.jpg?w=785&amp;ssl=1 785w, https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/11/Habit.jpg?resize=300%2C175&amp;ssl=1 300w, https://i0.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/11/Habit.jpg?resize=768%2C447&amp;ssl=1 768w\" sizes=\"(max-width: 660px) 100vw, 660px\" data-recalc-dims=\"1\" /></p>\n<p>در این نمودار محرک شما اینه که بیکار شده اید و بیکار شدن را دوست ندارید<strong>(محرک یا سرنخ)</strong>. پس دنبال راهی هستید که بهتون حس خوب بده، پس طبق عادتتون عمل می‌کنید و اینستاگرام چک میکنید<strong>(روتین یا کار تکراری)</strong>، وقتتون سپری میشه و حس میکنید کار مهمی انجام میدید<strong>(پاداش)</strong>. اما متاسفانه فقط موقع بیکار شدن این چرخه انجام نمی‌شه. زیاد دیدم مردم از ناراحنی یا استرس به چرخه ای مشابه این چرخه عمل میکنند. درواقع اینستاگرام شده جزوی از عادت های ما برای مواجهه با موقعیت های مختلف زندگی و ارضاء کردن اون. درواقع هرکسی چرخه منحصر به فرد خودش رو داره و هرکسی که مدام اینستاگرام چک میکنه، انتظار یک پاداشی خاص داره. ممکنه اینستاگرام برای یکی حس شادی و خوشحالی داشته باشه، ولی به من این حس دست میده که بیکار نیستم و سرم شلوغه، درواقع خودمو گول میزنم که وقتم رو مفید استفاده میکنم.</p>\n<p>پس در هر چرخه عادت سه پارامتر مهم هست. محرک، کار تکراری که انجام میدید، و پاداشی که می‌گیرید. اگه میخواید چرخه عادت ( بی‌کاری ـ چک کردن اینستاگرام ـ احساس مفید بودن ) رو حذف کنید باید بگم که نمیتونید! اما می‌توانید اونو عوض کنید.</p>\n<h2>چگونه چرخه عادت خود را عوض کنم؟</h2>\n<p><strong>محرک</strong> و <strong>پاداش</strong> شما معمولا یکسانه. یعنی در موقعیت های مشابه، انتظار پاداش خاصی را دارید و با یک روتین یا کار تکراری به اون پاداش می‌رسید و اون احساس خوب بهتون دست می‌ده. <strong>شما نمی‌تونین این چرخه رو حذف کنید چون مغزتون جوری برنامه ریزی شده که به ازای محرک های خاص پاداش خاصی انتظار داشته باشه. اما میتونید روتین(کار تکراری) رو عوض کنید.</strong> برگردیم به مثال خودمون. بیکار شدم==&gt; پس باید یک راهی پیدا کنم که احساس خوب بهم دست بده(وقتمو مفید سپری کنم) ==&gt; پس اینستاگرام رو چک میکنم. این چرخه نمیتونه حذف شه. چون محرک شما(احساس بیکاری) حذف نمیشه و یجوری باید بهش جواب داده شه. من به جای اینکه با اینستاگرام به این چرخه پاسخ بدم، کتاب میخونم یا وقتمو با خانواده سپری میکنم. درواقع کتاب/خانواده می‌شه واسطه ای برای از بیکاری به حس خوب رسیدن(تا قبل از این اینستاگرام واسطه بود).</p>\n<p><em>چرخه عادت قبلی من:</em> <strong>بیکار</strong> شدم ـ از <strong>اینستاگرام</strong> استفاده میکنم ـ احساس <strong>مفید</strong> بودن</p>\n<p><em>چرخه عادت جدید من:</em> <strong>بیکار</strong> شدم ـ <strong>کتاب</strong> میخوانم ـ احساس <strong>مفید</strong> بودن</p>\n<h2>مثالی دیگر از چرخه عادت</h2>\n<p><img class=\"alignnone size-full wp-image-172\" src=\"https://i1.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/11/habit-to-cigar.jpg?resize=660%2C385&#038;ssl=1\" alt=\"\" width=\"660\" height=\"385\" srcset=\"https://i1.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/11/habit-to-cigar.jpg?w=700&amp;ssl=1 700w, https://i1.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/11/habit-to-cigar.jpg?resize=300%2C175&amp;ssl=1 300w\" sizes=\"(max-width: 660px) 100vw, 660px\" data-recalc-dims=\"1\" /></p>\n<p>&nbsp;</p>\n<p>اگه عادت های ما نباشن زندگی خیلی سخت میشه. فرض کنید می‌خواهید کفش بپوشید، اول کدام کفش را پایتان می‌کنید؟ راست یا چپ؟ این طبق عادت شما انجام میشه و نیازی نیست هربار بهش فکر کنید. عادت ها بطور کلی خوب هستند چون <strong>دو بخش اصلی</strong> دارند یعنی <strong>محرک</strong> و <strong>پاداش</strong>. ولی یک<strong> بخش قابل تغییر</strong> دارند که اون تعیین کننده خوب یا بد بودن عملتونه. مثلا فردی را تصور کنید که هروقت ناراحته سیگار می‌کشه. بیاید چرخه عادت این فرد را بررسی کنیم. فرد ناراحت شده( محرک )  ==&gt; میخواد آرام شه( پاداش ) ==&gt; سیگار میکشه(نیکوتین باعث آرام شدن میشه)(کار تکراری). ممکنه افراد به دلایل مختلفی سیگار بکشند اما من همچین فردی مد نظرم بود. اگه بتونید محرک و پاداشتون را به درستی تشخیص بدهید، میتوانید کارتکراری(روتین) را عوض کنید. یک روتین جایگزین برای همچین فرد سیگاری ای میتونه وقت گذاشتن و درد و دل کردن با همسر باشه.</p>\n<p><img class=\"alignnone size-full wp-image-173\" src=\"https://i2.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/11/changed.jpg?w=100%25&#038;ssl=1\" alt=\"\" srcset=\"https://i2.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/11/changed.jpg?w=540&amp;ssl=1 540w, https://i2.wp.com/backend.hesamkaveh.com/wp-content/uploads/2018/11/changed.jpg?resize=300%2C160&amp;ssl=1 300w\" sizes=\"(max-width: 540px) 100vw, 540px\" data-recalc-dims=\"1\" /></p>\n<p>چرخه عادت به سیگار(همون اعتیاد به سیگار) به خودی خودش بد نیست. چون هرکی ناراحت باشه باید یجوری خودشو آروم کنه. منتهی راهی که برای پاسخگویی به این عادته، یعنی سیگار کشیدن، اون بده. سیگار صرفا یک وسیله ایه که باعث بشه چرخه عادت ما تکمیل بشه:</p>\n<p><em>چرخه عادت با پاسخگویی بد:</em> احساس <em><strong>ناراحتی</strong></em> ـ <strong>سیگار</strong> ـ احساس <em><strong>آرامش</strong></em>(نیکوتین)</p>\n<p><em>پاسخگویی خوب:</em> احساس <em><strong>ناراحتی</strong></em> ـ ارتباط با<strong> همسر</strong> ـ احساس <em><strong>آرامش</strong></em></p>\n<p>پس چرخه عادت های ما بد نیستن چون کاملا نیاز های طرف رو پوشش میدن. منتهی این مهمه که چطوری به اونها پاسخ بدیم.</p>\n<p>&nbsp;</p>\n<p>اگر آدم چرخه عادت هاشو بشناسه و این اراده رو داشته باشه که کار های تکراریشو تغییر بده، میتونه اون کار رو بعضی وقت ها بصورت انتخابی انجام بده. مثلا من میتونم اینستاگرام بیام و موتادش نباشم. اینستاگرام جای بسیار خوبیه برای افرادی که میخوان با کسی ارتباط بزنن یا کسی رو بشناسن. منتهی مشکلی که داره اینه که پست های دیگران روی آدم تاثیر میگذارند و من راه حلی برای این پیدا نکرده ام.</p>\n<p>عادت های ما بیشتر از قدرت تفکر تو زندگیمون تاثیر دارن، کتاب قدرت عادت یاد میده تا با تفکر عادت هامونو جایگزین کنیم.</p>\n","slug":"%d8%aa%d8%ac%d8%b1%d8%a8%d9%87-%db%8c%da%a9-%d9%85%d8%a7%d9%87%d9%87-%d9%85%d9%86-%d8%a7%d8%b2-%d8%aa%d8%b1%da%a9-%d8%a7%d8%b9%d8%aa%db%8c%d8%a7%d8%af","categories":[{"name":"جامعه","description":"","id":"5b0c418e-6a28-5cac-9f2f-c09205fd5eef"},{"name":"قوانین زندگی من","description":"","id":"ed2626c0-24e3-54e0-bbf5-56a22b75453d"}],"featured_media":{"alt_text":"","localFile":{"childImageSharp":{"fluid":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAQABQDASIAAhEBAxEB/8QAGAAAAwEBAAAAAAAAAAAAAAAAAAIDBAX/xAAWAQEBAQAAAAAAAAAAAAAAAAAAAwT/2gAMAwEAAhADEAAAAb1RslOebQ//xAAYEAADAQEAAAAAAAAAAAAAAAAAAQIRA//aAAgBAQABBQLnODK4LZ6KjR4z/8QAFhEBAQEAAAAAAAAAAAAAAAAAAAER/9oACAEDAQE/AYx//8QAGREAAgMBAAAAAAAAAAAAAAAAABEBAhIh/9oACAECAQE/AbN9Nyf/xAAaEAACAgMAAAAAAAAAAAAAAAAAETFBARAh/9oACAEBAAY/AneuZQrIIP/EABwQAAICAgMAAAAAAAAAAAAAAAABESExQVFhsf/aAAgBAQABPyHLq2OhFEM0P4LhXobRYRkuR//aAAwDAQACAAMAAAAQpy//xAAVEQEBAAAAAAAAAAAAAAAAAAARAP/aAAgBAwEBPxAEL//EABcRAQEBAQAAAAAAAAAAAAAAAAEAETH/2gAIAQIBAT8Q2gM7f//EABwQAQACAgMBAAAAAAAAAAAAAAEAESFBUWHB4f/aAAgBAQABPxAa2jwdOWCLa2XfyNSqZqCD1cAKOHxBI6qIltJ//9k=","aspectRatio":1.2152777777777777,"src":"/static/630e48d205c6f89a826cbe6e3da60b80/13e10/the-pwer-of-habit.jpg","srcSet":"/static/630e48d205c6f89a826cbe6e3da60b80/60a63/the-pwer-of-habit.jpg 188w,\n/static/630e48d205c6f89a826cbe6e3da60b80/4cd1e/the-pwer-of-habit.jpg 375w,\n/static/630e48d205c6f89a826cbe6e3da60b80/13e10/the-pwer-of-habit.jpg 700w","sizes":"(max-width: 700px) 100vw, 700px"}}},"media_details":{"width":700,"height":576,"file":"2018/11/the-pwer-of-habit.jpg"}}}},{"node":{"title":"سخت نگیر، حتی در سخت نگرفتن","excerpt":"<p>چند سال پیش نزدیکای عروسی داییم بود و درگیر بنایی بودیم. میرفتم خونشون و تو رنگ کاری و آماده کردن خونه کمکش میکردم. کاری بهم می‌سپرد به بهترین نحو انجام میدادم و حتی نمیذاشتم یک ایراد کوچیک باقی بمونه. اما مشکلی که بود عروسی خیلی نزدیک بود و خونه آماده نبود پس باید عجله می‌کردیم. &hellip; <a href=\"https://backend.hesamkaveh.com/%d8%b3%d8%ae%d8%aa-%d9%86%da%af%db%8c%d8%b1%d8%8c-%d8%ad%d8%aa%db%8c-%d8%af%d8%b1-%d8%b3%d8%ae%d8%aa-%d9%86%da%af%d8%b1%d9%81%d8%aa%d9%86/\" class=\"more-link\">ادامه خواندن <span class=\"screen-reader-text\">سخت نگیر، حتی در سخت نگرفتن</span></a></p>\n","content":"<p>چند سال پیش نزدیکای عروسی داییم بود و درگیر بنایی بودیم. میرفتم خونشون و تو رنگ کاری و آماده کردن خونه کمکش میکردم. کاری بهم می‌سپرد به بهترین نحو انجام میدادم و حتی نمیذاشتم یک ایراد کوچیک باقی بمونه. اما مشکلی که بود عروسی خیلی نزدیک بود و خونه آماده نبود پس باید عجله می‌کردیم. ازین جهت داییم مدام میگفت حسام سخت نگیر. چیزی که واسش مهم بود این بود که بنایی زودتر تموم شه نه اینکه کار خیلی تمیز و بدون هیچ نقص از آب در بیاد. منم سعی کردم سخت نگیرم و این باعث شد از رفع یک سری مشکلات و وسواسی های خیلی کوچیک که حتی به چشم نمیاد صرف نظر کنم و درنهایت نتیجه این شد که بنایی به موقع و چند روز مونده به عروسی تموم شد و نتیجه کار بسیار عالی بود.<strong> عالی بودن به معنای بدون نقص بودن نیست بلکه به این معناست که نواقص اونقدری کوچیکن که اصلا به چشم نمیان</strong>، مثل یک قطره رنگی که روی زمین ریخته. یا به عنوان مثالی دیگر، در رنگ‌کاری اگر خیلی تمیز کار کنی و مواظب باشی رنگی روی زمین نچکه، کار تمیز در میاد، ولی وقتی یکم از این دقتت کم کنی و آخرش رنگ های ریخته شده روی زمین را پاک کنی باز هم کار به همون تمیزی در میاد ولی تایمی که میگیره خیلی کمتره. این اولین باری بود که ذهن کوچیک من با مفهوم سخت نگیر آشنا شد و فهمیدم <strong>سخت نگرفتن به معنای اهمیت ندادن نیست.</strong></p>\n<p>بسیاری دانش‌آموزان و دانشجویان را می‌بینم که مدام پای کتاب میشینن و درس میخونن با این تفکر که درسشون واقا سخته و میخوان درسشونو با نمره +10 پاس کنن. همینشم کلی تلاش می‌خواد از نظرشون. اما به راستی چه دلیلی داره که نتیجه به مراتب بدتری میگیرن نسبت به کسی که فقط شب امتحان رو وقت گذاشته؟ بذارید احتمالات را بررسی کنیم:<!--more--></p>\n<ol>\n<li>دانشجو با نمره بالاتر <strong>استعداد بیشتری</strong> در اون درس داشته.</li>\n<li>دانشجو با نمره بالاتر از امتحانش <strong>نترسیده و با آرامش</strong> درس خونده.</li>\n<li>دانشجو با نمره بالاتر وقتشو روی <strong>مباحثی گذاشته که اهمیت بیشتری</strong> داشتن.</li>\n</ol>\n<p>احتمال 1 بحثش جداست، و حتی به‌نظر من دو احتمال دیگر دلیل مهمتری هستند برای پاس شدن. دو احتمال دیگر مصداق سخت نگرفتن است.</p>\n<p><strong>وقتی خیلی در چیزی سخت بگیری احتمال ترسیدنت هم بیشتر میشه و آرامشت از بین میره&#8230;</strong> همش پیش خودت میگی نکنه پاس نشم&#8230; اگه پاس نشم بدبخت می‌شم&#8230; این فکر ها تا یک حدیش انرژی میده برای درس خوندن ولی از یک حد بیشترش تنها نتیجه ای که داره کاهش اعتماد به نفس و ترسیدنه.</p>\n<p><strong>وقتی بیش از حد سخت بگیری دچار جزء بینی میشی و از کلیات جا میمونی.</strong> در درس خواندن ممکنه درگیر یک مبحث بشی و ازش نمونه سوال حل کنی در صورتی که اگه چند ورق اونورتر رو نگاه کنی می‌بینی مطالب خیلی مهمتری هستند که باید روشون وقت بگذاری. یا مثلا در رنگ‌کاری یادمه خیلی با دقت چهارچوب پنجره را رنگ میکردم و وقت زیادی می‌گرفت ازم، منتهی حواسم نبود که جهارچوب پنجره قراره بره پشت پرده و هنوز رنگ دیوار ها که واجب‌تر هم هست مونده!</p>\n<h2>سخت نگرفتن یک شعار نیست، به معنای منطقی تصمیم گرفتن است</h2>\n<p>وقتی فهمیدم سخت نگرفتن چقدر خوبه، سعی کردم کلا تو کارهام سخت نگیرم و مدام به خودم بگم سخت نگیر. اما انگار که همون هارو سخت می‌گرفتم!! شما وقتی سعی کنید که سخت نگیرید، در سخت نگرفتن موفق می‌شید ولی نتیجه ای که میگیرید متفاوت با وقتیه که به دلایل خاص تصمیم بگیرید سخت نگیرید. بگذارید یک مثال بزنم. اون کجا که مدام در حال خواندن درستون به خودتون بگویید سخت نگیر و از مباحث به راحتی عبور کنید، و اون کجا که از مباحث خاصی به علت وجود مباحث مهمتر عبور کنید.</p>\n<p><strong>سخت نگرفتن باید تابع دید از بالا باشد.</strong> شما باید شرایط و گزینه ها را جلو خودتون بگذارید و با توجه به اولویت ها و نتایج مورد انتظارتون شروع به انجام کارهاتون کنین. پس بدون دلیل سعی نکنید که سخت نگیرید چون سخت نگرفتن به این معنا نیست که به کار ها اهمیت ندهیم، به این معناست که <strong>دقتمونو از چیز های نامهم به چیز های مهم متمرکز کنیم</strong>. پس:</p>\n<blockquote><p>سخت نگیر، حتی در سخت نگرفتن.</p></blockquote>\n<h2>سخت نگرفتن در مفهومی دیگر</h2>\n<p>فعل سخت نگیر رو برای <strong>نترسیدن</strong> هم به کار می‌برم. هرگاه حس میکنم دارم در مورد چیزی مثل پاس شدن درس می‌ترسم، به خودم می‌گم سخت نگیر( به معنای: نترس ).</p>\n<h2>کمی عمیق تر</h2>\n<p>بیشتر که فکر می‌کنم یکی از دلایل موفقیت کاری مردان نسبت به زنان دقیقا همین سخت نگرفتنه. زنان گاهی آنقدری درگیر جزئیات میشن که از کلیات جا می‌مونن، مشخص کردن اولویت ها واسشون به مراتب سخت‌تره. دقت کنید رهبران بزرگ اکثرا مرد ها بوده اند چون یکی از ویژگی های مهمی که رهبر باید داشته باشه اینه که بتونه دید کلی از کار داشته باشه و بدونه تو چه زمینه هایی باید تمرکز کرد.</p>\n<p>البته بعضی موفقیت ها بستگی به دید ما دارند. مثلا در اسباب کشی و چیدن وسایل، مرد وقتی خودشو موفق میدونه که همه وسایل رو بیاره داخل خونه و در جایی بگذاردشون. ولی زن وقتی خودشو موفق می‌دونه که تک تک وسایل رو در جای مناسب بچینه:) .همین طرز دید ها و طرز تفکر ها هستند که مرد ها یا زن ها را در کار هایی موفق‌تر میکنند.</p>\n","slug":"%d8%b3%d8%ae%d8%aa-%d9%86%da%af%db%8c%d8%b1%d8%8c-%d8%ad%d8%aa%db%8c-%d8%af%d8%b1-%d8%b3%d8%ae%d8%aa-%d9%86%da%af%d8%b1%d9%81%d8%aa%d9%86","categories":[{"name":"قوانین زندگی من","description":"","id":"ed2626c0-24e3-54e0-bbf5-56a22b75453d"}],"featured_media":{"alt_text":"","localFile":{"childImageSharp":{"fluid":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAOABQDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAAMEAf/EABcBAAMBAAAAAAAAAAAAAAAAAAABAgP/2gAMAwEAAhADEAAAAaCfcxIkt//EABoQAQACAwEAAAAAAAAAAAAAAAECEgADERP/2gAIAQEAAQUC5Fyp3eF/cx3FZSs//8QAFhEBAQEAAAAAAAAAAAAAAAAAAQAh/9oACAEDAQE/ATdJL//EABkRAAMAAwAAAAAAAAAAAAAAAAABAhEhMf/aAAgBAgEBPwHcrDJ4f//EABsQAAIBBQAAAAAAAAAAAAAAAAARMQEhQYGh/9oACAEBAAY/Ao4RQ0WZljP/xAAeEAEAAQMFAQAAAAAAAAAAAAABACFh4RExUYHB8P/aAAgBAQABPyHgKRjcMAAsnq0zAp0ufM349z//2gAMAwEAAgADAAAAENwP/8QAFxEBAQEBAAAAAAAAAAAAAAAAAQARMf/aAAgBAwEBPxAa4yDf/8QAGBEBAAMBAAAAAAAAAAAAAAAAAQARIUH/2gAIAQIBAT8QesvIaJP/xAAdEAEBAAIBBQAAAAAAAAAAAAABEQAxUSFBYbHB/9oACAEBAAE/EBkF5QYBbDhJ8wHdFDDb4zqqQmzgFBZYO9wZ0wl29uf/2Q==","aspectRatio":1.471698113207547,"src":"/static/23919dd67ac8f1ca550bb83f361f6792/9f583/relax-and-take-it-easy-orlando-espinosa.jpg","srcSet":"/static/23919dd67ac8f1ca550bb83f361f6792/60a63/relax-and-take-it-easy-orlando-espinosa.jpg 188w,\n/static/23919dd67ac8f1ca550bb83f361f6792/4cd1e/relax-and-take-it-easy-orlando-espinosa.jpg 375w,\n/static/23919dd67ac8f1ca550bb83f361f6792/9f583/relax-and-take-it-easy-orlando-espinosa.jpg 750w,\n/static/23919dd67ac8f1ca550bb83f361f6792/2a8b2/relax-and-take-it-easy-orlando-espinosa.jpg 1092w","sizes":"(max-width: 750px) 100vw, 750px"}}},"media_details":{"width":1092,"height":742,"file":"2018/11/relax-and-take-it-easy-orlando-espinosa.jpg"}}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"ed2626c0-24e3-54e0-bbf5-56a22b75453d"}}