{"data":{"wordpressPost":{"title":"سخت نگیر، حتی در سخت نگرفتن","acf":null,"wordpress_id":147,"content":"<p>چند سال پیش نزدیکای عروسی داییم بود و درگیر بنایی بودیم. میرفتم خونشون و تو رنگ کاری و آماده کردن خونه کمکش میکردم. کاری بهم می‌سپرد به بهترین نحو انجام میدادم و حتی نمیذاشتم یک ایراد کوچیک باقی بمونه. اما مشکلی که بود عروسی خیلی نزدیک بود و خونه آماده نبود پس باید عجله می‌کردیم. ازین جهت داییم مدام میگفت حسام سخت نگیر. چیزی که واسش مهم بود این بود که بنایی زودتر تموم شه نه اینکه کار خیلی تمیز و بدون هیچ نقص از آب در بیاد. منم سعی کردم سخت نگیرم و این باعث شد از رفع یک سری مشکلات و وسواسی های خیلی کوچیک که حتی به چشم نمیاد صرف نظر کنم و درنهایت نتیجه این شد که بنایی به موقع و چند روز مونده به عروسی تموم شد و نتیجه کار بسیار عالی بود.<strong> عالی بودن به معنای بدون نقص بودن نیست بلکه به این معناست که نواقص اونقدری کوچیکن که اصلا به چشم نمیان</strong>، مثل یک قطره رنگی که روی زمین ریخته. یا به عنوان مثالی دیگر، در رنگ‌کاری اگر خیلی تمیز کار کنی و مواظب باشی رنگی روی زمین نچکه، کار تمیز در میاد، ولی وقتی یکم از این دقتت کم کنی و آخرش رنگ های ریخته شده روی زمین را پاک کنی باز هم کار به همون تمیزی در میاد ولی تایمی که میگیره خیلی کمتره. این اولین باری بود که ذهن کوچیک من با مفهوم سخت نگیر آشنا شد و فهمیدم <strong>سخت نگرفتن به معنای اهمیت ندادن نیست.</strong></p>\n<p>بسیاری دانش‌آموزان و دانشجویان را می‌بینم که مدام پای کتاب میشینن و درس میخونن با این تفکر که درسشون واقا سخته و میخوان درسشونو با نمره +10 پاس کنن. همینشم کلی تلاش می‌خواد از نظرشون. اما به راستی چه دلیلی داره که نتیجه به مراتب بدتری میگیرن نسبت به کسی که فقط شب امتحان رو وقت گذاشته؟ بذارید احتمالات را بررسی کنیم:<!--more--></p>\n<ol>\n<li>دانشجو با نمره بالاتر <strong>استعداد بیشتری</strong> در اون درس داشته.</li>\n<li>دانشجو با نمره بالاتر از امتحانش <strong>نترسیده و با آرامش</strong> درس خونده.</li>\n<li>دانشجو با نمره بالاتر وقتشو روی <strong>مباحثی گذاشته که اهمیت بیشتری</strong> داشتن.</li>\n</ol>\n<p>احتمال 1 بحثش جداست، و حتی به‌نظر من دو احتمال دیگر دلیل مهمتری هستند برای پاس شدن. دو احتمال دیگر مصداق سخت نگرفتن است.</p>\n<p><strong>وقتی خیلی در چیزی سخت بگیری احتمال ترسیدنت هم بیشتر میشه و آرامشت از بین میره&#8230;</strong> همش پیش خودت میگی نکنه پاس نشم&#8230; اگه پاس نشم بدبخت می‌شم&#8230; این فکر ها تا یک حدیش انرژی میده برای درس خوندن ولی از یک حد بیشترش تنها نتیجه ای که داره کاهش اعتماد به نفس و ترسیدنه.</p>\n<p><strong>وقتی بیش از حد سخت بگیری دچار جزء بینی میشی و از کلیات جا میمونی.</strong> در درس خواندن ممکنه درگیر یک مبحث بشی و ازش نمونه سوال حل کنی در صورتی که اگه چند ورق اونورتر رو نگاه کنی می‌بینی مطالب خیلی مهمتری هستند که باید روشون وقت بگذاری. یا مثلا در رنگ‌کاری یادمه خیلی با دقت چهارچوب پنجره را رنگ میکردم و وقت زیادی می‌گرفت ازم، منتهی حواسم نبود که جهارچوب پنجره قراره بره پشت پرده و هنوز رنگ دیوار ها که واجب‌تر هم هست مونده!</p>\n<h2>سخت نگرفتن یک شعار نیست، به معنای منطقی تصمیم گرفتن است</h2>\n<p>وقتی فهمیدم سخت نگرفتن چقدر خوبه، سعی کردم کلا تو کارهام سخت نگیرم و مدام به خودم بگم سخت نگیر. اما انگار که همون هارو سخت می‌گرفتم!! شما وقتی سعی کنید که سخت نگیرید، در سخت نگرفتن موفق می‌شید ولی نتیجه ای که میگیرید متفاوت با وقتیه که به دلایل خاص تصمیم بگیرید سخت نگیرید. بگذارید یک مثال بزنم. اون کجا که مدام در حال خواندن درستون به خودتون بگویید سخت نگیر و از مباحث به راحتی عبور کنید، و اون کجا که از مباحث خاصی به علت وجود مباحث مهمتر عبور کنید.</p>\n<p><strong>سخت نگرفتن باید تابع دید از بالا باشد.</strong> شما باید شرایط و گزینه ها را جلو خودتون بگذارید و با توجه به اولویت ها و نتایج مورد انتظارتون شروع به انجام کارهاتون کنین. پس بدون دلیل سعی نکنید که سخت نگیرید چون سخت نگرفتن به این معنا نیست که به کار ها اهمیت ندهیم، به این معناست که <strong>دقتمونو از چیز های نامهم به چیز های مهم متمرکز کنیم</strong>. پس:</p>\n<blockquote><p>سخت نگیر، حتی در سخت نگرفتن.</p></blockquote>\n<h2>سخت نگرفتن در مفهومی دیگر</h2>\n<p>فعل سخت نگیر رو برای <strong>نترسیدن</strong> هم به کار می‌برم. هرگاه حس میکنم دارم در مورد چیزی مثل پاس شدن درس می‌ترسم، به خودم می‌گم سخت نگیر( به معنای: نترس ).</p>\n<h2>کمی عمیق تر</h2>\n<p>بیشتر که فکر می‌کنم یکی از دلایل موفقیت کاری مردان نسبت به زنان دقیقا همین سخت نگرفتنه. زنان گاهی آنقدری درگیر جزئیات میشن که از کلیات جا می‌مونن، مشخص کردن اولویت ها واسشون به مراتب سخت‌تره. دقت کنید رهبران بزرگ اکثرا مرد ها بوده اند چون یکی از ویژگی های مهمی که رهبر باید داشته باشه اینه که بتونه دید کلی از کار داشته باشه و بدونه تو چه زمینه هایی باید تمرکز کرد.</p>\n<p>البته بعضی موفقیت ها بستگی به دید ما دارند. مثلا در اسباب کشی و چیدن وسایل، مرد وقتی خودشو موفق میدونه که همه وسایل رو بیاره داخل خونه و در جایی بگذاردشون. ولی زن وقتی خودشو موفق می‌دونه که تک تک وسایل رو در جای مناسب بچینه:) .همین طرز دید ها و طرز تفکر ها هستند که مرد ها یا زن ها را در کار هایی موفق‌تر میکنند.</p>\n","date":"2018,11,21","publish_date":"21-11-2018 04:23:32 am","modified_date":"21-11-2018 05:48:03 am","categories":[{"name":"قوانین زندگی من"}],"tags":[{"name":"تمرکز روی موارد مهم","slug":"%d8%aa%d9%85%d8%b1%da%a9%d8%b2-%d8%b1%d9%88%db%8c-%d9%85%d9%88%d8%a7%d8%b1%d8%af-%d9%85%d9%87%d9%85"},{"name":"چرا مردان از زنان موفق ترند؟","slug":"%da%86%d8%b1%d8%a7-%d9%85%d8%b1%d8%af%d8%a7%d9%86-%d8%a7%d8%b2-%d8%b2%d9%86%d8%a7%d9%86-%d9%85%d9%88%d9%81%d9%82-%d8%aa%d8%b1%d9%86%d8%af%d8%9f"},{"name":"چگونه درس بخوانیم؟","slug":"%da%86%da%af%d9%88%d9%86%d9%87-%d8%af%d8%b1%d8%b3-%d8%a8%d8%ae%d9%88%d8%a7%d9%86%db%8c%d9%85%d8%9f"},{"name":"چگونه موفق شویم؟","slug":"%da%86%da%af%d9%88%d9%86%d9%87-%d9%85%d9%88%d9%81%d9%82-%d8%b4%d9%88%db%8c%d9%85%d8%9f"},{"name":"سخت نگیر","slug":"%d8%b3%d8%ae%d8%aa-%d9%86%da%af%db%8c%d8%b1"},{"name":"نترس","slug":"%d9%86%d8%aa%d8%b1%d8%b3"}],"featured_media":{"alt_text":"","localFile":{"childImageSharp":{"fluid":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAOABQDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAAMEAf/EABcBAAMBAAAAAAAAAAAAAAAAAAABAgP/2gAMAwEAAhADEAAAAaCfcxIkt//EABoQAQACAwEAAAAAAAAAAAAAAAECEgADERP/2gAIAQEAAQUC5Fyp3eF/cx3FZSs//8QAFhEBAQEAAAAAAAAAAAAAAAAAAQAh/9oACAEDAQE/ATdJL//EABkRAAMAAwAAAAAAAAAAAAAAAAABAhEhMf/aAAgBAgEBPwHcrDJ4f//EABsQAAIBBQAAAAAAAAAAAAAAAAARMQEhQYGh/9oACAEBAAY/Ao4RQ0WZljP/xAAeEAEAAQMFAQAAAAAAAAAAAAABACFh4RExUYHB8P/aAAgBAQABPyHgKRjcMAAsnq0zAp0ufM349z//2gAMAwEAAgADAAAAENwP/8QAFxEBAQEBAAAAAAAAAAAAAAAAAQARMf/aAAgBAwEBPxAa4yDf/8QAGBEBAAMBAAAAAAAAAAAAAAAAAQARIUH/2gAIAQIBAT8QesvIaJP/xAAdEAEBAAIBBQAAAAAAAAAAAAABEQAxUSFBYbHB/9oACAEBAAE/EBkF5QYBbDhJ8wHdFDDb4zqqQmzgFBZYO9wZ0wl29uf/2Q==","aspectRatio":1.471698113207547,"src":"/static/23919dd67ac8f1ca550bb83f361f6792/9f583/relax-and-take-it-easy-orlando-espinosa.jpg","srcSet":"/static/23919dd67ac8f1ca550bb83f361f6792/60a63/relax-and-take-it-easy-orlando-espinosa.jpg 188w,\n/static/23919dd67ac8f1ca550bb83f361f6792/4cd1e/relax-and-take-it-easy-orlando-espinosa.jpg 375w,\n/static/23919dd67ac8f1ca550bb83f361f6792/9f583/relax-and-take-it-easy-orlando-espinosa.jpg 750w,\n/static/23919dd67ac8f1ca550bb83f361f6792/2a8b2/relax-and-take-it-easy-orlando-espinosa.jpg 1092w","sizes":"(max-width: 750px) 100vw, 750px"}}},"media_details":{"width":1092,"height":742,"file":"2018/11/relax-and-take-it-easy-orlando-espinosa.jpg"}}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"e8841083-9470-5c0b-b07d-2b8fa2a79712"}}