{"data":{"wordpressTag":{"id":"4fe3854f-2fd1-5d34-b0c7-5c70c9936e09","name":"ریکت","description":""},"allWordpressPost":{"edges":[{"node":{"id":"638d27cd-0a31-5c4f-84d3-5e5e626c7541","title":"از ReactJS تا GatsbyJS ـ تجربیات من از دنیای ReactJS","excerpt":"<p>مدت زیادی نیست که می‌نویسم. به سبک خودم می‌‌نویسم و مطالبیو مینویسم که لااقل برای خودم خاص هستن و باهاشون حال می‌کنم:) قالب این سایت اسمش هست Sansi که در گیت هاب منتشرش کردم و میتوانید ازش استفاده کنید. میخوام فرآیندی که طراحی این سایت داشته و تکنولوژی هایی که پشت سر گذرونده رو بهتون &hellip; <a href=\"https://backend.hesamkaveh.com/%d8%a7%d8%b2-reactjs-%d8%aa%d8%a7-gatsbyjs-%d9%80-%d8%aa%d8%ac%d8%b1%d8%a8%db%8c%d8%a7%d8%aa-%d9%85%d9%86-%d8%a7%d8%b2-%d8%af%d9%86%db%8c%d8%a7%db%8c-reactjs/\" class=\"more-link\">ادامه خواندن <span class=\"screen-reader-text\">از ReactJS تا GatsbyJS ـ تجربیات من از دنیای ReactJS</span></a></p>\n","content":"<p>مدت زیادی نیست که می‌نویسم. به سبک خودم می‌‌نویسم و مطالبیو مینویسم که لااقل برای خودم خاص هستن و باهاشون حال می‌کنم:) قالب این سایت اسمش هست <a href=\"https://github.com/hesamkaveh/Sansi\" target=\"_blank\" rel=\"noopener\">Sansi</a> که در گیت هاب منتشرش کردم و میتوانید ازش استفاده کنید. میخوام فرآیندی که طراحی این سایت داشته و تکنولوژی هایی که پشت سر گذرونده رو بهتون بگم.</p>\n<h2><a href=\"https://reactjs.org/\" target=\"_blank\" rel=\"noopener\">ReactJS</a></h2>\n<p>دوست داشتم وبلاگم خاص باشه و در عین حال تجربه جدیدی برای من داشته باشه. بجای اینکه بخوام وبلاگو با وردپرس یا یک CMS دیگه بالا بیارم ترجیه دادم خودم یچی بنویسم. قصد داشتم ReactJS یاد بگیرم و خب حالا یک پروژه داشتم برای تمرین. پس تصمیم گرفتم UI وبلاگمو با ReactJS بزنم و تنها برای بک اند از وردپرس استفاده کنم.</p>\n<p><!--more--> یکم ابتدایی تر از همین وبسایتی که می‌بینید رو با reactjs+wordpres بالا آوردم ولی مشکلی که خوردم SEO سایت بود که در حالت پیشفرض برای موتور های جست و جو محتوای سایتم قابل خواندن نبود. چون تکنولوژی وبسایت CSR(Client Side Rendering) بود و درواقع همه چیز با js در سیستم کلاینت ساخته میشد و بخاطر همین Page Source(با inspect element اشتباه نگیرید) ویسایت خالی از هرگونه محتوا بود و برای گوگل خواندنش ناممکن بود. پس دو راه داشتم. یا مشکل رو حل کنم یا از فورکی از ReactJS استفاده کنم که این مشکلاتو نداشته باشه. متاسفانه اون‌زمان نتونستم مشکلو حل کنم پس تصمیم گرفتم یک بار دیگه سایت رو بنویسم با یه تکنولوژی دیگه. راستی اگه این مشکلو دارین میتونین <a href=\"https://virgool.io/JavaScript8/%D8%A7%D8%B2-reactjs-%D8%AA%D8%A7-%DA%AF%D9%88%DA%AF%D9%84-qjun39ruvoeq\">مطلب نیما</a> رو بخونید.</p>\n<h2><a href=\"https://nextjs.org/\" target=\"_blank\" rel=\"noopener\">NextJS</a></h2>\n<p>بله! رفتم سراغ این تکنولوژی. NextJS بر پایه Reactjs نوشته شده و تقریبا خیلی شبیهن. اصلی ترین تفاوتشون برای من SSR(Server Side Rendering) بودن NextJS بود که خیلی هم راضی بودم ازش:) یک تست کوچیک کردم و دیدم جواب میده و page source دارم بنابراین یک بار دیگه فرانت‌اند سایتو نوشتم منتهی اینبار با NextJS. بسیار هم عالی بود منتهی بعد اینکه بازطراحی تموم شد تازه متوجه شدم که ای بابا، قسمتایی از سایت که قراره به بک اند وصل شه و با کوئری به بک‌اند آپدیت شه(مثل محتوای پست ها) توی سورس نمایش داده نمیشه! منطقی بود! چون موقع پیج باز کردن، قسمت هایی از سایت باز میشد(همونایی که تو سورس سایت بود) بعد کلاینت به سرور کوئری میزد و محتوا رو پر میکرد. برای کوئری از axios استفاده میکردم و مشکل دقیقا همون قسمت بود. چون بصورت CSR کار میکرد ولی من SSR نیاز داشتم. دو تا راه داشتم. یا مشکلو حل کنم یا تکنولوژی رو عوض کنم! راجع به GastbyJS زیاد تعریف شنیده بودم پس تصمیم گرفتم اینبار با GasbyJS سایتو بازطراحی کنم!</p>\n<h2><a href=\"https://www.gatsbyjs.org/\" target=\"_blank\" rel=\"noopener\">GatsbyJS</a></h2>\n<p>بذارید اول GatsbyJS رو معرفی کنم! GatsbyJS بر پایه ReactJS نوشته شده با این تفاوت که سایت های استاتیک میسازه. مزیت اصلیش سرعت بالای بارگزاری سایت و درعین حال فشار بسیار کم روی سروره. سایت استاتیک دیگه دیتابیس نداره و اطلاعاتش تو صفحات html ذخیره میشه. البته با gatsby سایتتونو استاتیک نمینویسید، gatsby تبدیل میکنه به استاتیک. یعنی چی؟ GatsbyJS یک SSG(Server Side Generation) حساب میشه و موقع build گرفتن از برنامه، به بک اند وصل میشه و کوئری میگیره و با توجه به داده ها صفحات استاتیک می‌سازه. بذارید با مثال توضیح بدم. همین وبلاگی که می‌بینید برای بک اند از وردپرس استفاده میکنه و برای فرانت‌اند از Gatsby. پس شما دارید صفحات استاتیک می‌بینید! وقتی من از فرانت‌اند سایت build میگیرم وصل میشه به بک‌اند و پست ها، کتگوری ها و تگ هارو می‌گیره و با توجه به کدی که نوشتم چند تا فایل html و js تحویل میده و کافیه من بارگزاریش کنم روی سرور تا سایت آپدیت شه.</p>\n<p>چند تا سوال ممکنه پیش میاد:</p>\n<h4>اگه پست جدید بخوام بگذارم چطوری میشه؟</h4>\n<p>خب فرض کنید پست جدید در وردپرس ارسال کردم. اما تو سایت نمایش داده نمیشه. چون آخرین build ای که از سایت گرفتم مال قبل از این پست بوده. حالا باید مجدد از سایت build بگیرم تا با توجه به اطلاعات جدید سایت ساخته شه.</p>\n<h4>پس حتی برای هر کامنت باید دوباره سایت build گرفته شه؟!</h4>\n<p>مطمئنا نه! میتونست اینطور باشه ولی راهی که من انتخاب کردم قسمت کامنت سایت رو با axios طراحی کردم و بصورت CSR کار میکنه. پس بعد از اینکه پست توسط کلاینت لود شد کوئری زده میشه به سرور و کامنت های سایت لود میشن.</p>\n<h4>چرا gatsby؟</h4>\n<ul>\n<li>سرعت! فراموش نکنید سایت های استاتیک به مراتب سرعت بالاتری از سایت های داینامیک دارن.</li>\n<li>پرفورمنس! وقتی سایت داینامیکی رو لود میکنید چندین پروسه باید گذرونده شه تا سایت برای کاربر نمایش داده شه یا اصطلاحا لود شه. بدترین و پرفشارترین پروسه، کوئری به دیتابیس و گرفتن اطلاعات صفحست. این مورد در gatsbyjs فقط موقع build گرفتن از برنامه صورت میگیره. پس فشار به سرور خیلی خیلی کاهش پیدا میکنه.</li>\n</ul>\n<h2>جمع بندی</h2>\n<p>GatsbyJS و NextJS جفتشون بر پایه ReactJS هستن و خیلی مشابهن بهش. درواقع اگه ReactJS کار کرده باشید به راحتی میتونید از NextJS یا GatsbyJS استفاده کنید. فرق اصلیشون چیه؟ تو اینا:</p>\n<p>ریکت CSR هست. درواقع سایت سمت کلاینت رندر میشه و وقتی از پیج سورس بگیرید فقط یک تگ توش میبینید که هیچ محتوایی نداره. و محتوا توسط js در سیستم کاربر ساخته میشه. این بصورت پیشفرض برای موتور های جست و جو قابل دسترس نیست.</p>\n<p>نکست SSR هست. یعنی صفحات در سمت سرور ساخته میشه و به کاربر فرستاده میشه. این محتوا برای گوگل قابل دسترسه منتهی اگه قرار باشه کوئری زده شه به بک اند و محتوا از اونجا خوانده شه(یعنی سایت داینامیک باشه) اون محتوا با توجه به طرز کوئری زدنتون SSR یا CSR میشه. برای من CSR بود چون کدی که برای کوئری زده بودم CSR بود.</p>\n<p>گتس‌بای SSG هست. یعنی از محتوای داینامیک، سایت استاتیک می‌سازه. این اتفاق زمان build برنامه میوفته. یسری مزایا داره یسری معایب ولی در کل چیز خاص و جالبیه. یکم مشکل بود بازطراحی این سایت با گتس‌بای منتهی کم کم داره تکمیل میشه و اگه میخواید تو طراحی کمک کنید یا از این قالب استفاده کنید میتونید به <a href=\"https://github.com/hesamkaveh/Sansi\" target=\"_blank\" rel=\"noopener\">گیت هاب پروژه که اسمشو گذاشتم Sansi</a> سر بزنید. شاید فکر کنید خیلی سخته هر بار build گرفته شه از سایت، در جواب میگم این تکنولوژی اولا برای هر سایتی مناسب نیست و دوما میشه اتوماسیون کرد تا با هربار آپدیت بک اند، از سایت ‌build گرفته شه و روی سرور بارگزاری شه.</p>\n<h3>نتیجه اخلاقی</h3>\n<p>من با هرکدوم از این تکنولوژی ها می‌تونستم این سایتو بدون نقص طراحی کنم. منتهی زیاد برای رفع مشکلاتی که برخوردم وقت نذاشتم و همین باعث شد تکنولوژی های متفاوتی رو امتحان کنم. من عقیده دارم هرکی هرجوری راحته می‌تونه یاد بگیره و حتی معتقدم یادگیری اولیه بهتره سطحی باشه و بعدا با یک دید و درک خوبی عمیق شیم رو زمینه موردعلاقمون:)</p>\n","slug":"%d8%a7%d8%b2-reactjs-%d8%aa%d8%a7-gatsbyjs-%d9%80-%d8%aa%d8%ac%d8%b1%d8%a8%db%8c%d8%a7%d8%aa-%d9%85%d9%86-%d8%a7%d8%b2-%d8%af%d9%86%db%8c%d8%a7%db%8c-reactjs","tags":[{"name":"gatsbyjs"},{"name":"nextjs"},{"name":"reactjs"},{"name":"sansi"},{"name":"ریکت"}],"featured_media":{"alt_text":"","localFile":{"childImageSharp":{"fluid":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAALABQDASIAAhEBAxEB/8QAFwABAQEBAAAAAAAAAAAAAAAAAAMBBf/EABUBAQEAAAAAAAAAAAAAAAAAAAAB/9oADAMBAAIQAxAAAAHkUmTAv//EABcQAQADAAAAAAAAAAAAAAAAAAEAAiD/2gAIAQEAAQUClgM//8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAwEBPwE//8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAgEBPwE//8QAFhAAAwAAAAAAAAAAAAAAAAAAACAh/9oACAEBAAY/AiL/AP/EABkQAAIDAQAAAAAAAAAAAAAAAAABEBFxkf/aAAgBAQABPyEVKCdF5yP/2gAMAwEAAgADAAAAEDvP/8QAFhEBAQEAAAAAAAAAAAAAAAAAAREQ/9oACAEDAQE/EEbTP//EABYRAQEBAAAAAAAAAAAAAAAAAAEQEf/aAAgBAgEBPxATJ//EABsQAQACAgMAAAAAAAAAAAAAAAEAETFhEIGh/9oACAEBAAE/EAtBa3LUWu+EwrsGDMeEcz//2Q==","aspectRatio":1.7766497461928934,"src":"/static/a4465f18443665ed6339ee318cabfc08/13e10/love-reactjs.jpg","srcSet":"/static/a4465f18443665ed6339ee318cabfc08/60a63/love-reactjs.jpg 188w,\n/static/a4465f18443665ed6339ee318cabfc08/4cd1e/love-reactjs.jpg 375w,\n/static/a4465f18443665ed6339ee318cabfc08/13e10/love-reactjs.jpg 700w","sizes":"(max-width: 700px) 100vw, 700px"}}},"media_details":{"width":700,"height":394,"file":"2018/11/love-reactjs.jpeg"}}}}]},"site":{"siteMetadata":{"title":"حسام‌ کاوه","subtitle":"با تلاش من و شما جهان بهتر خواهد شد. نوشته هایی در مورد پیشرفت شخصی، کسب و کار و برنامه نویسی"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"4fe3854f-2fd1-5d34-b0c7-5c70c9936e09"}}