{"data":{"wordpressCategory":{"id":"9f405b39-e913-5e0f-b7a7-fa396c22f39d","name":"سیستم عامل","description":""},"allWordpressPost":{"edges":[{"node":{"title":"ویندوز یا لینوکس؟ عمیق بیندیشیم","excerpt":"<p>اول از هرچی از روز برنامه نویس بگم چون امروز 22 شهریوره و روز برنامه نویسه! تقریبا به هرکی تبریک گفتم جاخورد ازینکه روز برنامه نویس هم داریم. احتمالا دلیلش اینه که هنوز تو تقویم شمسی ثبت نشده و یادمه داشتند امضا جمع میکردند که ثبت شه(الان که چک میکنم سایتش ساسپند شده! ولی خب &hellip; <a href=\"https://backend.hesamkaveh.com/%d9%88%db%8c%d9%86%d8%af%d9%88%d8%b2-%db%8c%d8%a7-%d9%84%db%8c%d9%86%d9%88%da%a9%d8%b3%d8%9f/\" class=\"more-link\">ادامه خواندن <span class=\"screen-reader-text\">ویندوز یا لینوکس؟ عمیق بیندیشیم</span></a></p>\n","content":"<p>اول از هرچی از <strong>روز برنامه نویس</strong> بگم چون امروز 22 شهریوره و روز برنامه نویسه! تقریبا به هرکی تبریک گفتم جاخورد ازینکه روز برنامه نویس هم داریم. احتمالا دلیلش اینه که هنوز تو تقویم شمسی ثبت نشده و یادمه داشتند امضا جمع میکردند که ثبت شه(الان که چک میکنم سایتش ساسپند شده! ولی خب قبلا من امضامو ثبت کرده بودم). امیدوارم الان که این مطلبو میخونید<a href=\"http://programmerday.ir\" target=\"_blank\" rel=\"nofollow\"> programmerday.ir</a> براتون باز بشه:( . بریم سر اصل مطلب!</p>\n<h2>حق و باطل</h2>\n<p>همه ی داستانای معروف تو یچیز مشترکند، جنگ میان حق و باطلند. ارباب حلقه ها، جنگ ستارگان، رستم و اسفندیار هم ازین قضیه مستثنی نیست. تو دنیای واقعی هم ازین جنگا داریم مثل جنگ بین لینوکسی ها و ویندوزی ها. به شخصه خیلی ازین بحثا خوشم میاد چون جنبه ی خوشگذرونی داره و به نوبه ی خودش فانه. اما واقعیت اینه که اعتقاد دارم جفتنشون خوبن، اما&#8230;. اما برای هر کاری و برای هرکسی یک سیستم عامل خوبه. مثلا یک C# کار هیچوقت لینوکس واسش انتخاب مناسبی نیست یا طرز تفکر یه پایتون کار احتمالا بیشتر با لینوکس سازگاره.</p>\n<p><!--more--></p>\n<h2>ویندوز برای چه کسی مناسبه؟ لینوکس چطور؟</h2>\n<p>خیلی سعی کردم افراد و کار هارو دسته بندی کنم و با توجه به اونا پیشنهاد بدم که چه سیستم عاملی مناسبشونه، اما واقعا سخته. برای مثال اگه شما گیمرید احتمالا ویندوز واستون مناسبه چون دامنه بازی های لینوکسی کمتره. اما بازی هایی که هم ویندوز و هم لینوکس ساپورت میکنن(مثل Dota) تو لینوکس بهتر و روون تر اجرا میشن. دیدید؟ کلی پارامتر هست که حتی یه گیمر بخواد سیستم عاملشو انتخاب کنه. تصمیم گیری اینکه کدوم سیستم عامل واستون مناسبه رو خودتون باید انجام بدید. چند سالیه من کاربر لینوکسم و بذارید تجربیاتمو از ویندوز و لینوکس واستون بگم:</p>\n<h2>تجربیاتم از ویندوز</h2>\n<p>ویندوز واقعا راحت بود. تقریبا با رابط گرافیکیش هر کاری میتونستم کنم.  به سادگی هر برنامه ی پولی ای رو آزادانه(!) از اینترنت دانلود میکردم و کرک میکردم، بعد شورتکات میذاشتم روی دسکتاپ و هر موقع میخواستم اجراش می‌کردم. هر دو سه روز هم سایت‌های دانلود مثل soft98 رو چک میکردم ببینم اگه آپدیت اومده دوباره دانلود کنم. عاشق این بودم که یه آرشیو از نصاب برنامه ها روی هاردم داشته باشم تا ویندوز عوض میکنم راحت باشم. اما واقعیت این بود که همینطور آپدیت میومد و مجددا دانلودشون میکردم.  هر بازی ای که میخواستو دانلود میکردم و دغدغم این بود که چه کرکی رو استفاده کنم تا بتونم اجراش کنم. اون زمانا تنها مشکلی که با ویندوز داشتم ویروس گرفتنش بود وگرنه برای کار های معمول، روتین های خاصی وجود داشت. منم کارم طراحی وب بود و کم و کاستی نمی‌دیدم.</p>\n<h2>چطور لینوکسی شدم؟</h2>\n<p>اسم لینوکسو شنیده بودم و با <a href=\"https://forum.ubuntu.ir/\">اوبونتو فروم</a> آشنا شدم. دیدم چقدر کاربر فعال داره! کنجکاو شدم نصبش کنم و بله! اولین تجربه و اولین شکست&#8230; هاردم فرمت شد. (<i>تو پرانتز بگم که هنوزم خیلیا این مشکلو دارن. انتظار دارن نصب لینوکس مثل ویندوز یه next next ساده باشه. سادست اما به شرطی که گزینه هارو با دقت انتخاب کنی!</i>). چند روزی مشغول ریکاوریشون بودم و دوباره شروع کردم به نصب لینوکس ولی اینبار از روی یه آموزش. انتظار نداشتم رابط گرافیکی لینوکس اینقدر خوشگل باشه( آخه اسم لینوکس یکم خشن بود! ) و واسم جالب بود که میشه حتی شکل و شمایلشو به کل عوض کرد. طریقه نصب برنامه واسم کمی عجیب بود اما یکم که بیشتر آشنا شدم دیدم چقد کاراتر و ساده‌تر از نصب برنامه بصورت ویندوزیه و آپدیت کردنشون چقدر راحته. اوایل زیاد ارتباط خوبی با ترمینال نداشتم ولی اینطور که تو اینترنت میدیدم کارای زیادی میشه باهاش کرد ولی حوصله و دانش میخواد. این شد که هی بین لینوکس و ویندوز سوییچ میکردم و یجورایی بینشون بلاتکلیف بودم.</p>\n<h2>اصل شماره ۱ &#8211; هر چیزی طرز تفکر خاص خودشو داره. باید فکرتون لینوکسی باشه</h2>\n<p>یکم که پیش رفتم با پایتون آشنا شدم و خیلی باهاش حال کردم. پایتون یسری فلسفه و طرز فکر پشتشه که به مرور تو ذهنم حکاکی میشد. هیچ چیزی قرار نیست یهویی اتفاق بیوفته و بعضی چیزا به مرور زمان بدست میاد. طرز تفکر پایتونی و حتی شاید نحوه اجرای برنامه های پایتونی به لینوکس و برنامه هاش خیلی شبیه بود و این شد که تصمیممو گرفتم سختی های لینوکسو به جون بخرم و لااقل برای مدتی خودمو از ویندوز دور کنم.</p>\n<p>لینوکس رابط گرافیکی خیلی خوبی داره و به شدت هم شخصی سازی میشه کردش اما این رابط گرافیکی به تنهایی جوابگو همه کار نیست. همه کاری که میگم منظورم چیزی فراتر از یه وبگردی ساده یا حتی فیلم دیدنه.</p>\n<h2>اصل شماره ۲ &#8211; شما باید خوره کامپیوتر باشید تا بتونید با طرز فکر لینوکسی انس بگیرید</h2>\n<p>با VLC آشنایی دارید؟ یه نرم افزار خیلی معروف برای دیدن فیلمه! امروزه سرعت اینترنت بالا رفته و لازم نیست فیلمو دانلود کنید و بعد ببینید. کافیه VLC رو باز کنید و لینک فیلم رو بهش بدید تا استریمش کنه و آنلاین ببینیدش. اینو هم تو لینوکس و هم تو ویندوز میشه با رابط گرافیکی انجام داد. اما یه خوره کامپیوتر احتمالا ترجیهش اینه که بجای اینکه VLC رو باز کنه و بین منو ها بگرده و گزینه ی استریم از اینترنت رو پیدا کنه، تو ترمینال همجین چیزی بنویسه:</p>\n<p><code>vlc http://x.com/my_movie.mkv</code></p>\n<p>کاربرا حرفه ای لینوکس اکثرا اینطورین! این کار یا کار های مشابه بر اثر تجربه بدست میاد و به مرور میتونید حدس بزنید چه پارامتر هایی پاس بدید برنامه مورد نظر چه کاری انجام میده. اینکارا با یکم دنگ و فنگ تو ویندوز هم شدنیه اما واقعیت اینه که ویندوز برای اینکارا ساخته نشده. حتی یه کاربر معمولی ممکنه هیچوقت با این روش راحت نباشه.</p>\n<p>ترمینال انعطاف خیلی زیادی به برنامه ها میده و کارهارو با دقت خیلی بیشتری انجام میده. درواقع برنامه‌نویس‌ها به جای اینکه وقتشونو بذارن تا هرچیزیو گرافیکی بنویسند، برنامه های تحت ترمینال مینویسند ولی با قابلیت کاستومایز و کنترل بیشتر(<em>البته برای برنامه های رایج نسخه گرافیکی هم توسط همون توسعه دهنده یا توسعه دهنده های دیگه منتشر میشه</em>). سرعتتون‌هم میتونه هم خیلی بیشتر شه هم خیلی کمتر. واقعیت اینه که رابط گرافیکی تو نگاه اول خیلی ساده تره چون همه چیز(<em>با گزینه ها و انتخابای کمتر</em>) جلوی چشمتونه اما اگه بخواید حرفه ای تر کاری کنید دیگه رابط گرافیکی جوابگو نیست! نیازه که وقت بذارید و کار با ترمینالو یاد بگیرید. هر برنامه دنیاییه و کانفیگ کردنش برای اولین بار میتونه دشوار باشه.</p>\n<h2>اصل شماره ۳ &#8211; اگه میخوای لینوکسی حرفه‌ای شی باید تو چیز ها عمیق شی</h2>\n<p>همه چیز تو لینوکس دست خودتونه و همه چیز قابل تغییره! تو ویندوز سرور خیلی راحت میتونید یه سایت بالا بیارید اما تو سرور لینوکسی باید دانشی از apache و bind server داشته باشید. البته تو لول های حرفه ای تر ویندوزی ها هم باید این دانش رو بدست بیارن اما تو لینوکس شما شیرجه میزنید تو دل داستان و باید بدونید چی کار می‌کنید! البته جای ترسی نداره چون اینترنت پره از داکیومنت و آموزش و میتونید با اونا شروع کنید! و البته نیازی نیست همه چیز از مثلا apache رو بلد باشید اما حداعقلاتی نیازه. به مرور حرفه ای میشید:). دفعات اول با کپی پیست دستورات روی سرور لینوکس سایت بالا میاوردم. اما تکرار در انجام دادنشون به مرور مفاهیم اولیه رو بهم یاد داد.</p>\n<h2>اصل شماره ۴ &#8211; این تویی که تصمیم گیرنده ای. احترام متقابله</h2>\n<p>لینوکسیا به برنامه ها احترام میذارن و برنامه ها هم به لینوکسیا احترام میذارن. البته این یچیز خیلی کلیه اما واقعیت اینه که اغلب اینطوره. تا شما نخواید برنامه ها کاری انجام نمیدن. مثلا حتی برای اضافه کردن برنامه به استارتاپ شما خودتون باید تصمیم بگیرید و تا شما نخواید اضافه نمیشه! یا برای انجام کار های مهم مثل تغییرات سیستمی باید پسورد ادمین(روت) را وارد کنید. اکثر برنامه ها اوپن سورس هستن و اگه به هردلیل بهشون اعتماد نداشته باشید میتوانید سورسشونو چک کنید. یا اگه مشکلی داشتن میتونید تو گیت هاب گزارش بدید یا حتی خودتون اصلاحش کنید و کامیت کنید!</p>\n<p>اعتقاد بر اینه که انتشار سورس میتونه برنامه رو قوی‌تر کنه و واقعا هم جواب داده.  شرکت هایی مثل مایکروسافت که قدیم به هیچ وجه سورس منتشر نمیکردن دارند محصولاتشونو اوپن سورس میکنن که اولا مشکلاتش رو بقیه هم رفع کنند، دوما بقیه هم بتوانند توسعش بدن و سوما بشه بهشون اعتماد کرد!</p>\n<h2>اصل شماره ۵ &#8211; نیازی نیست برنامه نویس باشید</h2>\n<p>اشتباه نکنید، لینوکس فقط برا برنامه نویس‌ها مناسب نیست! من لینوکسو برا چهار دسته آدم مناسب میدونم:</p>\n<ul>\n<li>خوره ها</li>\n<li>کسایی که دنبال یک سیستم عامل پایدار برای کار های روتین مثل وبگردی هستن و نمیخوان هی عوضش کنن.</li>\n<li>برنامه نویس ها</li>\n<li>sysAdmin ها</li>\n</ul>\n<h3><b>نتیجه گیری:</b></h3>\n<p>حس میکنم زیادی در مورد لینوکس حرف زدم. اصلا منظورم این نیست که حرفه ای ها همه لینوکسین. ولی کاملا منظورم اینه که تو لینوکس پتانسیل برای حرفه ای شدن بیشتره. و البته راه ساده ای قرار نیست پیش رو باشه. لینوکس بسیار چالش بر انگیزه و همون چالش هاست که باعث میشه شما یاد بگیرید و خودتونو بالا بکشید:) . اگر بتونید لینوکسی شید هیچوقت سمت ویندوز نمیرید و البته این به معنای ضعیف بودن ویندوز نیست، بلکه به این معناست که دیگه فکرتون با راه‌کار های لینوکسی خو گرفته. اگرم یه ویندوزی حرفه ای هستید و نهایت کاری که میکنید نصب یه برنامه یا کرک کردن یه بازی نیست، احتمالا دیگه نتونید لینوکسی شید!</p>\n","slug":"%d9%88%db%8c%d9%86%d8%af%d9%88%d8%b2-%db%8c%d8%a7-%d9%84%db%8c%d9%86%d9%88%da%a9%d8%b3%d8%9f","categories":[{"name":"برنامه نویسی","description":"مطالب مرتبط با برنامه نویسی","id":"2060d515-a7d7-54eb-91f0-dc58dc6693dc"},{"name":"سیستم عامل","description":"","id":"9f405b39-e913-5e0f-b7a7-fa396c22f39d"},{"name":"لینوکس","description":"","id":"2261f593-d54a-5307-bbbb-a6d1ad5e134d"}],"featured_media":null}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"9f405b39-e913-5e0f-b7a7-fa396c22f39d"}}